{
  "title": "Čtyři základní myšlenky",
  "description": "Čtyři základní myšlenky (čtyři obecné přípravy) jsou jako klíče, které otevírají dveře k opravdové motivaci na cestě dharmy. V linii Karma Kagjü se jim říká čtyři myšlenky, které obracejí mysl k dharmě – protože doslova otáčejí naši pozornost od povrchních věcí světa směrem k tomu, co je trvalé a skutečné.",
  "markdown": "# Čtyři základní myšlenky, které obrací mysl k Dharmě\n\nČtyři základní myšlenky (tibetsky *blo ldog rnam bzhi*, česky lo džong ngöndro) představují nejdůležitější přípravu na jakoukoliv autentickou praxi v linii Karma Kagjü. **Bez jejich pravého pochopení a integrace do našeho bytí zůstává i desetiletí meditace jen prázdnou slupkou**, která pouze zesiluje naše přilnutí k cyklické existenci a tvrdost našeho srdce. Kalu Rinpočhe učil, že pokud tyto čtyři myšlenky nejsou integrovány do našeho vědomí, nezáleží na tom, kolik let praktikujeme – nic podstatného se nestane. Tyto kontemplace systematicky otáčejí naši mysl od samsárických starostí směrem k osvobození tím, že (1) rozpoznáváme vzácnost současné příležitosti, (2) uvědomujeme si její pomíjivost, (3) chápeme zákon příčiny a následku a (4) vidíme inherentní neuspokojivost podmíněné existence. Tyto čtyři myšlenky tvoří společné předběžné praktiky (*thun mong gi sngon 'gro*), které musí předcházet netradičním předběžným praktikám – 111 000 prostracím, Vadžrasattvě, mandalovým obětinám a guru józe – a nakonec samotné praktice mahámudry.\n\n## Vzácnost lidského zrození otevírá bránu k osvobození\n\nPrvní myšlenka učí o osmí svobodách (*dal wa gyé*) a desíti příznivých podmínkách (*jor wa chu*), které dohromady tvoří osmnáct okolností vzácného lidského zrození (*dal jor chobgyé*). Tyto podmínky jsou tak vzácné, že Buddha použil metaforu slepé želvy žijící na dně obrovského oceánu, která se vynořuje jednou za sto let – pravděpodobnost, že její hlava projde dřevěným jhem plovoucím na hladině, je větší než pravděpodobnost získání vzácného lidského zrození. Moderní výpočty potvrzují tuto intuici: poměr povrchu oceánů k ploše otvoru v jhu vychází přibližně na 7,2 × 10^-16, což odpovídá buddhistickým kosmologickým kalkulacím pravděpodobnosti lidského zrození.\n\n**Osm svobod znamená, že nejsme zrozeni** v pekelnýcjh říších, kde neustálé utrpení znemožňuje jakoukoliv praxi; ve světě hladových duchů (*yi dwak*), kde mentální pálení a neustálý hlad pohltí veškerou pozornost; ve zvířecí říši (*dü dro*), kde hloupost a absence ctnosti brání pochopení; mezi dlouhověkými bohy, kteří setrvávají v nekoncepčních stavech bez mentální aktivity; v barbarských zemích, kde Dharma není dostupná; s nesprávnými názory, které znemožňují pochopení vztahu ctnosti a znovuzrození; v době, kdy se Buddha neobjevil; nebo s fyzickými či mentálními hendikepy, které brání porozumění učením.\n\nDeset příznivých podmínek se dělí na pět osobních výhod (*rang jor nga*) a pět okolních výhod (*gzhan jor nga*). Osobní výhody zahrnují lidské narození s funkčními orgány, narození v zemi, kde jsou učení dostupná, intaktní smyslové schopnosti, nezvrácení se k těžkým negativním činům a víru v učení. Okolní výhody znamenají, že Buddha se objevil v tomto světě, vyučoval Dharmu, učení stále existují, jsou následovníci Dharmy a existuje laskavá podpora od druhých včetně duchovních přátel. Gampopa v *Drahokamu osvobození* (*Dam čhö Yizhin Norbu Tarpa Rinpočhé Gyen*) učí, že toto lidské zrození je vzácné ze tří důvodů: je obtížné jej získat, má veliký prospěch a je snadné jej ztratit.\n\n**Gampopa cituje Áčárju Čandragomina**: „Jak veliké jsou jeho prospěšné účinky! Získáním tohoto vzácného lidského života se člověk může osvobodit z oceánu znovuzrození a také zasít semeno nejvyššího osvícení. Tento samotný lidský život má větší kvality než klenot splňující přání... Cesta, kterou mohou lidé získat velkou sílu mysli, nemůže být získána bohy ani nagové, ani polobohy, garudové, vidjadhárové, kinnarové nebo urakové.\" Toto lidské zrození poskytuje tři úrovně schopností: **nižší schopnost** vede k dosažení lidské nebo božské říše bez pádu do nižších říší, **střední schopnost** umožňuje dosáhnout klidu a štěstí osvobozením se ze samsáry, a **nejvyšší schopnost** vede k buddhovství ve prospěch všech cítících bytostí.\n\nKontemplativní praxe začíná rozpoznáním vzácnosti: denně ráno uvažovat o osmnácti podmínkách a kontrolovat, které z nich jsou přítomny. 17. Karmapa učí, že v jednadvacátém století musíme rozpoznat také globální propojenost – většina z nás se narodila do relativně komfortních podmínek, zatímco v mnoha částech světa lidé nemají ani základní potřeby. Tato vzájemná závislost znamená, že naše štěstí a utrpení závisí na nespočetných jiných bytostech – dokonce naše oblečení a jídlo existuje díky práci tisíců lidí. **Pochopení propojení přináší odpovědnost za druhé**, což je jádrem bodhičitty. Meditace spočívá v kontemplaci těchto bodů, dokud se význam této příležitosti neprojeví jasně, a pak nechat mysl spočinout v přirozeném, nekoncepčním stavu. Prakticky to znamená nastavit si připomínky během dne: v pozitivních situacích rozpoznat příležitost pro pozitivní činy, v obtížích si připomenout svobodu zvolit reakci. Gampopa radí myslet na toto tělo jako na loď pro překonání oceánu samsáry, jako na koně pro útěk z nebezpečné propasti utrpení, nebo jako na sluhu ctnosti.\n\n## Nestálost nás probouzí z iluze permanence\n\nDruhá myšlenka učí o pomíjivosti a smrti (*chi wa mi tak pa*), která se dělí na hrubou a jemnou nestálost. **Hrubá nestálost** zahrnuje smrt a zánik, zatímco **jemná nestálost** odkazuje na momentální změnu všeho podmíněného. Gampopa v Drahokamu osvobození popisuje vnější nestálost: „Od tohoto kosmického kruhu větru až do čtvrtého stádia meditativní koncentrace není nic, co má povahu trvalosti nebo stálosti. Někdy je vše od první úrovně meditativní koncentrace a níže zničeno ohněm. Někdy je vše od druhé úrovně a níže zničeno vodou. Někdy je vše od třetí úrovně a níže zničeno větrem.\" Když je svět zničen ohněm, nezůstane ani popel jako olej spotřebovaný ohněm; vodou nezůstane žádný sediment jako sůl rozpuštěná ve vodě; větrem nezůstane ani drobná částice jako hromada prachu rozmetaná silným větrem.\n\nVnitřní nestálost cítících bytostí učí *Sútra veršů řečených záměrně*: „Výsledkem všeho hromadění je rozptýlení. Výsledkem veškeré výstavby je pád. Všichni, kdo se setkají společně, se oddělí. Konec života je smrt.\" Jemná momentální nestálost se projevuje v sezónních změnách – na jaře se země zjemní, barvy se stanou červenavými, tráva, stromy a zelenina začnou klíčit, to vše jsou znaky změny způsobené nestálostí. V létě je země vlhká, barvy jsou zelené. Během dne je vnější svět jasný a bílý, v noci se stává temným. „První okamžik tohoto světa neexistuje ve druhém okamžiku. Každý okamžik je podobný a kvůli podobnosti jsme klamáni a vnímáme je jako stejné, jako proudění řeky.\"\n\nDevítibodová meditace o smrti (*nge pa dgu*) tvoří systematickou kontemplaci strukturovanou jako tři kořeny, devět důvodů a tři závěry. **První kořen: smrt je jistá**. Tři důvody: (1) nikdo z minulosti nežije – dokonce velcí mudrcové s pěti druhy jasnozřivosti nemohli najít místo, kde nikdo neumírá, Ušlechtilé bytosti včetně Arhatů nakonec musely opustit své tělo, a dokonce Buddhovo Nirmanakájové tělo s velkými a malými znaky také opustilo tělo; (2) toto tělo je složené a všechny složené jevy jsou pomíjivé – protože tělo je složené, musí být pomíjivé a smrt je definitivní; (3) život se vyčerpává v každém okamžiku – jako šíp vystřelený zručným lučištníkem nezastaví v prostoru ani na okamžik, dokud nedorazí k cíli, tak náš život nezůstává na jednom místě ani na chvíli a rychle se blíží ke smrti. **Závěr prvního kořene: musím praktikovat Dharmu nyní**.\n\n**Druhý kořen: čas smrti je nejistý**. Tři důvody: (1) délka života je neurčitá – některé bytosti umírají v lůně, jiné v okamžiku narození, některé při plazení, některé zemřou staré, některé mladé, některé v plné síle mládí; (2) tělo nemá esenci – skládá se pouze z třiceti šesti nečistých komponent, jako říká *Vstup do chování bódhisattvů*: „Nejprve mentálně oddělte vrstvy kůže od masa a pak skalpelem rozlišování oddělte maso od kostry... Při zkoumání se ptejte sami sebe: ‚Kde je esence?'\"; (3) existuje mnoho příčin smrti – *Dopis příteli*: „Tento život má mnoho nebezpečí; je křehčí než bublina vyfukovaná větrem. Je velkým zázrakem mít čas žít: vdechnout a vydechnout a probudit se ze spánku.\" **Závěr druhého kořene: musím praktikovat Dharmu NYNÍ (s naléhavostí)**.\n\n**Třetí kořen: v době smrti nemůže pomoci nic kromě praktikování Dharmy**. Tři důvody: (1) nemůžeme být pomoženi naším bohatstvím – i když můžeme žít šťastně dlouhou dobu získáváním velkého materiálního bohatství, odejdeme s prázdnýma rukama a chudí jako bychom byli okradeni zlodějem; (2) nemůžeme být pomoženi našimi příbuznými nebo přáteli – když přijde čas smrti, vaše děti se nemohou stát útočištěm, ani váš otec, matka nebo přátelé; kromě toho, že nám neprospívají, příbuzní nám škodí tím, že vytvářejí připoutání, které nás vrhá do nižších říší; (3) nemůžeme být pomoženi vlastním tělem – tělo, které je dobře udržováno jídlem a oblečením hromaděným s velkými obtížemi, nás nedoprovodí, ale bude sežráno ptáky nebo psy, nebo bude spáleno v planoucím ohni, nebo bude hnít pod vodou, nebo bude pohřbeno pod zemí. **Závěr třetího kořene: musím praktikovat Dharmu čistě (bez rozptýlení)**.\n\n17. Karmapa učí o pozitivním rámování nestálosti: „Nestálost znamená, že věci se mění okamžik od okamžiku. To naznačuje, že s každým okamžikem máme novou příležitost. Pokud jsme v našem životě udělali něco negativního, je možné se změnit. Milárepa je klasickým příkladem; viděl možnost transformace svého života a využil ji.\" Prakticky to znamená každé ráno kontemplovat jistotu smrti ale nejistotu jejího času, během dne všímat si změn – počasí, ročních období, lidí přicházejících a odcházejících – jako připomínek nestálosti, večer se ptát: „Co jsem dnes udělal, co opravdu záleží? Mohu najít něco smysluplného?\" a před spaním reflektovat, že spánek je jako malá smrt a možná se neprobudíme. Atíša učil: „Pokud nekontemplujete smrt ráno, ráno je promrháno. Pokud nekontemplujete smrt odpoledne, odpoledne je promrháno.\"\n\n## Karma je spolehlivý zákon příčiny a následku\n\nTřetí myšlenka učí o karmě (*lé* nebo *las*) jako o spolehlivém zákonu příčiny a následku, který prostupuje celým vesmírem napříč nespočetnými životy. **Gampopa cituje *Pokladnici Abhidharmy***: „Co způsobuje utrpení? Měli bychom vědět, že přichází z karmy potížené činnosti. Karma je karma mysli a karma myšlenky.\" Karma se skládá ze dvou typů: karma vědomí samého a karma vytvořená myslí, která se manifestuje skrze sílu mysli jako karma těla a řeči. 17. Karmapa učí, že karmu bychom měli zvažovat v širokém měřítku: „Protože jsme všichni vzájemně závislí, vše, co dělám, ovlivňuje nejen mě samého, mou rodinu nebo lidi blízké mně, ale má účinek na celý svět. Je proto velmi důležité, abychom všichni převzali odpovědnost za naše činy.\"\n\n**Deset ctnostných činů** (*gé wa chu*) představuje opaky deseti nectnostných činů: ochrana života druhých, praktikování velké štědrosti, udržování morální etiky (tři těla); mluvení pravdy, harmonizace těch, kdo nejsou přátelští, mluvení mírně a zdvořile, mluvení smysluplně (čtyři řeči); praktikování snížení připoutání a rozvoje spokojenosti, praktikování láskyplné laskavosti, zapojení se do dokonalého významu (tři mysli).\n\n**Deset nectnostných činů** (*mi gé wa chu*) zahrnuje tři těla, čtyři řeči a tři mysli. *Tři činů těla*: (1) zabíjení (*gsod pa*) – které může být motivováno touhou po mase, sportu nebo bohatství; nenávistí z urážky nebo soutěžení; nevědomostí skrze oběti; (2) krádež (*ma byin par len pa*) – zabírání silou, tajně nebo podvodem; (3) sexuální pochybení (*log g.yem*) – s chráněnými rodinou, majitelem nebo Dharmou (nevhodné části, místo, čas, počet, chování). *Čtyři činy řeči*: (4) lhaní (*rdzun du smra ba*) – duchovní lži o kvalitách, velké lži způsobující škodu nebo prospěch, malé lži bez podstatného účinku; (5) rozdělující řeč (*phra ma*) – rozdělování silou, nepřímo nebo tajně; (6) drsná slova (*tshig rtsub*) – přímé vytahování chyb, okliční sarkasmus, nepřímé skrze příbuzné; (7) prázdná řeč (*ngag 'khyal*) – nepravdivá jako heretické texty, světská jako zbytečné žvásty, pravdivá ale nevhodná jako vyučování nevhodných studentů. *Tři činy mysli*: (8) chtivost (*'dod chags*) – týkající se vlastního, cizího nebo ani jednoho; (9) škodlivá myšlenka (*gnod sems*) – z nenávisti, žárlivosti nebo nelibosti; (10) mylné názory (*log lta*) – mylný názor na příčinu a následek, na pravdu, na Tři klenoty.\n\n**Čtyři charakteristiky karmy** definují její fungování: (1) **jistota** (*nges pa*) – když zažíváme neštěstí, je jisté, že pocházelo z destruktivních činů, když zažíváme štěstí, je jisté, že pocházelo z konstruktivního chování; (2) **růst z malého** (*rgyas 'phel ba*) – malé příčiny mohou vyrůst ve velké výsledky, malé semeno může vyprodukovat rostlinu s mnoha plody, proto by se měly vyvarovat nebo očistit i malé negativní činy a kultivovat i malé ctnostné činy; (3) **žádné setkání bez příčiny** (*phrad med na 'byung ba med*) – nesetkáme se s karmickými výsledky, aniž bychom shromáždili jejich příčiny, cokoliv zažíváme nemůže vzniknout bez příčiny; (4) **činy nezmizí** (*byas pa cud mi za ba*) – jakmile jsou vytvořeny, karmické potenciály a tendence se určitě dozrají, pokud nebudou očištěny (pro negativní karmu) nebo narušeny mylnými názory či hněvem (pro pozitivní karmu). Schopnost karmických dedictví dávat výsledky se nezhorší ani po milionech životů.\n\nKarma se dělí na černou, bílou a smíšenou. **Černá karma** (*nag po'i las*) je nezasloužilá karma vznikající z deseti nectnostných činů, vedená znepokojujícími emocemi a vedoucí k utrpení. **Bílá karma** (*dkar po'i las*) je zasloužilá karma sestávající z deseti ctností a života v souladu s ctnostnou činností, vedoucí ke znovuzrození v lidských nebo božských říších. **Smíšená karma** (*dkar nag 'dres pa'i las*) jsou činy částečně škodlivé a částečně prospěšné. Gampopa učí: „Touha, odpor, nevědomost a karma tím vytvořená jsou nectnosti. Všechna utrpení pocházejí z nectnosti, stejně jako nižší říše. Nepřipoutání, neagrese, nezakrytá mysl a karma tím vytvořená jsou ctnosti. Všechny vyšší říše pocházejí z ctnosti, stejně jako klid a radost ve všech ostatních životech.\"\n\nExistují čtyři typy karmických výsledků: (1) **plně dozrálý účinek** (*rnam smin gyi 'bras bu*) určuje říši znovuzrození – úplné negativní činy vedou k nižším říším, úplné pozitivní činy k vyšším; (2) **účinek podobný příčině** (*rgyu mthun gyi 'bras bu*) má dva aspekty – zkušenostní (i když se narodíme jako lidé, zažíváme podobné okolnosti jako krátký život z zabíjení) a zvykový (mít predispozici ke stejným činům); (3) **environmentální účinek** (*bdag po'i 'bras bu*) – negativní čin formuje vnější prostředí, kde se člověk narodí; (4) **proliferující účinek** – neustálé opakování bývalých činů, které nás udržuje v nekonečném putování v samsáře.\n\nPraktická meditace na karmu začíná reflexí o příčině a následku: když pozitivní činy převládají, zažíváme radostné výsledky; když negativní činy převládají, hlavně zažíváme utrpení. Systematicky projděte deset nectnostných činů: vzpomeňte si, kdy jste se v každém z nich zapojili, prozkoumejte svůj mentální stav v té době, zvažte, co jste doufali získat, reflektujte, jak jste se potom cítili, a plánujte, co udělat, pokud nastanou podobné situace v budoucnosti. **Lama Rod Owens učí**: „Karma je běžně špatně pochopena a zneužívána v naší společnosti. Jednoduše řečeno, karma je chápána jako příčina a následek: něco uděláme a tento čin má následek. Ale jak chápeme tuto pravdu jako přímou zkušenost a jako cítěný náhled, spíše než jen uvíznout a zůstat na této intelektuální úrovni porozumění?\" Když zažíváme štěstí nebo utrpení, vystopujte to zpět k jeho karmickým příčinám. Když byla vytvořena negativní karma, lze ji očistit čtyřmi silami: silou lítosti (skutečná lítost nad činem), silou spoléhání (brání útočiště v Třech klenotách, generování bodhičitty), silou protilátky (praxe Vadžrasattvy, vyznání, prostrace, mandalové obětiny) a silou rozhodnutí (slib neopakovat čin).\n\n## Poznání nedostatků samsáry vytváří pravé zřeknutí se\n\nČtvrtá myšlenka učí o nedostatcích samsáry (*khor wä nye mik* nebo *'khor ba'i nyes dmigs*), která je prostoupena třemi typy utrpení: (1) **všudypřítomné utrpení** (*khyab pa 'du byed kyi sdug bsngal*) prostupuje od okamžiku, kdy existují potížené skandhy – obyčejní lidé jej necítí (jako vlas na dlani), ale ušlechtilé bytosti jej vnímají jasně (jako vlas v oku); (2) **utrpení změny** (*gyur ba'i sdug bsngal*) znamená, že všechno samsárické potěšení se nakonec mění v utrpení, protože jeho základní povaha je utrpení; (3) **utrpení utrpení** (*sdug bsngal gyi sdug bsngal*) je zjevné utrpení navíc k prostupujícímu utrpení – hrubá utrpení každé říše.\n\n**Šest říší existence** (*rik druk*) zahrnuje pekla, hladové duchy, zvířata, lidi, žárlivé bohy a bohy. *Pekelné říše* (*nyel wa*) se dělí na osm horkých pekl, osm studených pekl a příležitostná pekla. **Osm horkých pekl** se nachází 20 000 jodžan pod Džambudvípou: (1) *Oživující peklo* (*yang sos*) – bytosti se navzájem řežou a zabíjejí, studený vítr je oživí k opakování utrpení, délka života 500 let (1,62 bilionu lidských let); (2) *Peklo černé nitě* (*thig nag*) – těla označena černou nití, pak rozřezána planoucími meči nebo sekerami; (3) *Drtící peklo* (*bsdus 'joms*) – bytosti drceny mezi horami nebo lisovány mezi železnými deskami, dokud krev neteče jako řeky; (4) *Kvílící peklo* (*ngu 'bod*) – bytosti vydávají vyděšené výkřiky z hoření; (5) *Velké kvílící peklo* (*ngu 'bod chen po*) – větší utrpení s více vyděšenými výkřiky; (6) *Ohřívající peklo* (*tsha ba*) – roztavený bronz litý do těla, probodený trnitými zbraněmi; (7) *Intenzivně ohřívající peklo* (*rab tu tsha ba*) – roztavený bronz spaluje celé nitro, plameny z devíti otvorů; (8) *Peklo neustálého utrpení* (*mnar med*, Avíči) – planoucí kovový dům vysoký 20 000 jodžan, bytosti vařeny v bronzovém kotli, oheň ze čtyř směrů, žádná přestávka v utrpení, délka života jeden mezilehlý kalpa.\n\n**Osm studených pekl** vedle horkých: (1) *Arbuda* (*chu bur*) – puchýře pokrývají tělo, délka života odpovídá vyprázdnění zásobárny s 80 měřicemi hořčičných semen, odebíráním jednoho semena za sto let; (2) *Nirarbuda* (*chu bur rdol ba*) – puchýře praskají, délka života 20× Arbuda; (3) *Atata* (*a chu zer ba*) – zuby chrastí zimou; (4) *Hahava* (*ki hud zer ba*) – pláč „A-chu\"; (5) *Huhuva* (*kyi hud zer ba*) – silné naříkání; (6) *Utpala* (*ut pa la ltar gas pa*) – kůže praská jako okvětní lístky utpaly (5-6 kusů); (7) *Padma* (*pad ma ltar gas pa*) – červené trhliny jako okvětní lístky lotosu (10+ kusů); (8) *Mahápádma* (*pad ma chen po ltar gas pa*) – tmavší červená, praská na 100+ kusů.\n\n*Říše hladových duchů* (*yi dwak*) se nachází 500 jodžan pod králem Jamou, s rozptýlenými hladovými duchy v suchých místech. **Utrpení zahrnuje vnější obscurity** – vidí jídlo a pití jako hnis a krev, nebo druzí to střeží a brání přístupu; **vnitřní obscurity** – nemohou jíst nebo pít, i když je dostupné: „Někteří trpí hladem – jejich břicha jsou jako hory a jejich ústa jsou tak malá jako oči v jehlách. Nemají schopnost hledat ani malé množství nečistého jídla\"; **obecné obscurity** – jako ohnivý věnec (žaludky hoří při jídle/pití) nebo požírač špíny (mohou jíst pouze výkaly, pít moč nebo jíst vlastní maso). Délka života je 500 let v jejich termínech (jeden lidský měsíc = jeden den pro ně).\n\n*Zvířecí říše* (*dü dro*) zahrnuje mnoho nohou, čtyři nohy, dvě nohy, beznoží. Tři utrpení: **být používán** – domácí zvířata pod lidskou mocí, mučena, zotročována; **být zabíjena** – někteří umírají pro perly, vlnu, kosti, krev, maso a kůži; **vzájemné požírání** – zvláště v oceánech: „Jedí cokoliv spadne do jejich úst.\" Délka života je neurčitá; nejdelší je jedna čtvrtina kalpy.\n\n*Lidská říše a její utrpení* zahrnuje osm hlavních: (1) **narození** (*skye ba'i sdug bsngal*) – rozsáhlé utrpení v mezistavu, v lůně (38 týdnů nepohodlí, jako být vařen v horkém kotli, stisknuto jako v pekle, temnota, pach, uvěznění), při porodu jako být vytahován železnými dráty a hozený na trní; (2) **stáří** (*rga ba'i sdug bsngal*) – deset nepředstavitelných změn: tělo se stává zakřiveným a závislým na holi, vlasy šednou a vypadávají, kůže ztlustne a zvrásní, pleť zbledne jako zvadlý květ, schopnosti se ztrácejí, důstojnost se ztrácí (neúcta, zahanbení rodiny), bohatství se zmenšuje, nemoci se hromadí, mysl se mění (zapomínání, zmatek), čas se blíží k smrti; (3) **nemoc** (*na ba'i sdug bsngal*) – velká bolest, drsné operace, horké/hořké léky, zastavení od jídla/pití tužeb, potěšování lékařů, snižování bohatství, strach ze smrti; (4) **smrt** (*'chi ba'i sdug bsngal*) – oddělení od arogance, žádné útočiště, žádný ochránce, žádná podpora, mučení nemocí, suchá ústa, změna tváře, krátký dech, zastavení dechu, ústa a nos se otevřou, vstoupení do velké temnoty a pád z velkého útesu; (5) **oddělení od milovaných** – bezmezné utrpení v nářku, truchlení, pláči, kvílení, když zemřou připoutané bytosti; (6) **setkání s těmi, které nemáme rádi** – utrpení setkání s nenáviděnými nepřáteli vedoucí k boji, hádkám, bití; (7) **nenalezení toho, co si přejeme** – neschopnost získat to, co chceme, navzdory úsilí; (8) **pět agregátů / ochrana toho, co máme** – bolest ochrany majetků a těla; pět potížených skand samotných je utrpení.\n\n*Žárliví bohové/asurové* (*lha min*) mají podobná utrpení jako bohové, ale s dalšími problémy: **mentální utrpení skrze žárlivost** na slávu bohů, **neustálé boje** s bohy, ale vždy prohrávají, **arogance** brání klidu, neschopnost být uspokojeni navzdory potěšením. *Božská říše* (*lha*) obsahuje šest tříd bohů říší touhy, sedmnáct říší forem a čtyři beztvaré říše. **Bohové říší touhy** trpí bojem s polobožskými, nespokojeností s potěšeními, ponížením, řezáním, zabíjením, roztrhání, vyhnanstvím a zejména **přenosem smrti**: pět známek se objeví sedm dní před smrtí (oblečení se poskvrní nečistotami, věnce květů zvadnou, pot ze dvou podpaží, odporný zápach z těla, nelíbí se jim jejich vlastní sedadla), sedm božských dní utrpení (= sedm lidských let) vidění budoucího znovuzrození v nižších říších, a pak pád do nižších říší. **Bohové říší forem** dosažení skrze meditativní koncentraci stále podléhají přenosu smrti, nemají nezávislost v znovuzrození, připoutání k meditativnímu blaženosti vede zpět do samsáry, nakonec vyčerpáním dobré karmy padají do nižších říší. **Bohové beztvarých říší** (Nekonečný prostor, Nekonečné vědomí, Nicota, Ani vnímání ani nevnímání) mají extrémně dlouhé délky života, ale stále jsou pomíjivé, žádná praxe Dharmy během těchto stavů, pád do nižších říší po vyčerpání zásluh.\n\n**Všudypřítomné utrpení podmíněné existence** znamená, že tento stav samsáry je povahy velkého utrpení, „jako dům planoucího ohně\". *Sútra vstupu do lůna* vyhlašuje: „Běda, oceán samsáry plane – planouce, extrémně planouce, nejvyšší planouce a nejvyšší extrémně planouce. Proto není jediná cítící bytost, která by jím nebyla mučena. Jaký druh ohně plane tak veliký? Je to oheň touhy, odporu a nevědomosti. Oheň narození, stáří a smrti. Tyto planou a hoří neustále ohněm utrpení, nářku, strádání a konfliktu. Proto od nich nikdo není svobodný.\" Áčárja Nárgárdžuna uzavírá: „Samsára je takto: nejsou žádná dobrá znovuzrození mezi bohy, lidmi, pekelními bytostmi, hladovými duchy a zvířaty. Pochopte, že narození je nádobou mnoha utrpení.\"\n\nMeditace zahrnuje systematickou kontemplaci šesti říší: vizualizujte každou říši živě používajíc tradiční popisy, představte si sebe zažívajícího tato utrpení, vytvořte soucit pro bytosti tam uvězněné, rozpoznejte svůj vlastní potenciál být tam znovuzrozen, vytvořte odhodlání uniknout ze samsáry. Praktikujte rozpoznávání všudypřítomného utrpení v každém podmíněném okamžiku, utrpení změny v potěšeních, která vadnou, a utrpení utrpení ve zjevných bolestivých zkušenostech. 17. Karmapa učí: „Pravé štěstí znamená být osvobozený od znepokojujících emocí. Pokud jsme pod vlivem negativních činů nebo tří jedů [nevědomosti, nenávisti a připoutání], je obtížné být svobodní a nezávislí. Být pod mocí těchto znepokojujících emocí je všudypřítomné utrpení.\" Během dne reflektujte příklady utrpení, které pozorujete, kontemplujte: „Já jsem také stejné esenciální povahy, ve stejné podmínce a mám stejný charakter. Nejsem za touto realitou,\" a vytvořte zřeknutí se – pravé přání být svobodní od samsáry.\n\n## Praktické aspekty a znaky úspěšné kontemplace\n\nPro **vzácné lidské zrození** znamená úspěšná kontemplace, že nikdy nejste líní, přirozená píle vzniká, vše potřebné pro meditaci přichází přirozeně, hluboké ocenění bez nucení. Pro **nestálost** se smysl naléhavosti stává hmatatelným, přirozená motivace praktikovat, snížená zaměstnanost světskými cíli, ocenění čerstvosti každého okamžiku. Pro **karmu** před jednáním přirozeně ptát se na důsledky, spolehlivá příručka pro myšlenky, slova, činy, převzetí odpovědnosti za všechny činy. Pro **nedostatky samsáry** pravé zřeknutí se (ne nucené), snížené uchopování komfortu, vidění skrze dočasná potěšení, přirozené obracení se k osvobození.\n\nTradiční doporučení zahrnují praxi každé myšlenky, dokud se neobjeví přímá zkušenost – mohlo by to strávit celý život na jedné. 8. Karmapa učil flexibilitu: někteří nemusí realizovat první myšlenku a stanou se odrazeni, ale mohli by realizovat nestálost (druhou) a síla tohoto by pomohla realizovat první. Lama Ole Nydahl doporučuje tři týdny kontemplace na každé ze čtyř myšlenek. V tibetské tradici mnoho praktikuje ngöndro 20-25 krát během života. 17. Karmapa naznačuje použít čas na dovolené pro intenzivní praxi nebo praktikovat pilně jeden měsíc.\n\n**Běžné překážky** zahrnují pýchu a aroganci – řešením je Milárepův příklad ignorování Gampopy dva týdny, aby vyfoukl pýchu; připoutání ke komfortu – řešením je opakovaná kontemplace utrpení a nestálosti; netrpělivost s očekáváním okamžitých výsledků – řešením jsou realistická očekávání; nesprávné porozumění prázdnoty, která padá do nihilismu – řešením je Milárepovo učení: „Bez ohledu na to, kolik mačkáte písek, nikdy nedostanete olej\"; příliš mnoho koncepční meditace vedoucí ke stavům beztvaré říše bez moudrosti – řešením je potřeba klíčových instrukcí a cesty prostředků (tummo, prána).\n\n**Propojení s ngöndro a mahámudrou** je zásadní. Struktura ngöndro zahrnuje společné (obvyklé) předběžné praktiky = Čtyři myšlenky, které otáčejí mysl k dharmě, vytvářejí správnou motivaci a zakládají základy. Netradič\n\nní (neobyčejné) předběžné praktiky (4 × 111 111) zahrnují (1) útočiště a bodhičittu s prostracemi pro očištění energetických kanálů, budování síly a důvěry; (2) Vadžrasattvu pro očištění obscurací a negativní karmy; (3) mandalovou obětinu pro hromadění zásluh a moudrosti; (4) guru jógu pro přijímání požehnání a sjednocení s myslí učitele. 17. Karmapa učí: „Je důležité praktikovat tyto čtyři, dokud se v našem bytí neobjeví přímá zkušenost; jinak následující praktiky nebudou mít účinek.\"\n\n9. Karmapa Wangčhuk Dordže složil „Vůz pro cestování po ušlechtilé cestě\" – standardní text Karma Kagjü ngöndro. Progresivní cesta vede od Čtyř myšlenek (otáčejí mysl k dharmě, rozvíjejí zřeknutí se) přes Netradič\n\nní předběžné praktiky (očišťují, hromadí, přijímají požehnání) k praxi jidama (transformují vnímání) a nakonec k mahámudře (rozpoznávají povahu mysli přímo). Gampopa integroval postupnou cestu Kadampa s mahámudrou přímého uvedení, vytvářejíc systematický přístup jedinečný pro Dagpo Kagjü – „Sjednocení Kadampy a mahámudry\". Čtyři Dharmy Gampopy ukazují progresivní prohlubování: (1) „Udělejte požehnání, aby se má mysl obrátila k dharmě\", (2) „Udělejte požehnání, aby dharma postupovala podél cesty\", (3) „Udělejte požehnání, aby cesta rozptýlila zmatek\", (4) „Udělejte požehnání, aby se zmatek objevil jako moudrost.\"\n\n## Příběhy a příklady z života mistrů linie Kagjü\n\n**Milárepa** představuje nejvyšší příklad transformace skrze tyto kontemplace. Po spáchání vražd černou magií zažil nesnesitelnou lítost (realizace vzácného lidského života a karmy). Naléhavost z nestálosti řídila intenzivní praxi. Snášel extrémní obtíže očistit karmu a dosáhl osvícení v jednom životě. Jeho konečné učení Gampopovi ukazovalo zadek pokrytý mozoly jako zvířecí kopyta z sezení na kameni bez polštáře: „Neexistuje hlubší učení než toto. Nyní si můžete představit obtíže, kterými jsem prošel. Mé dosažení velkého realizace přišlo z tohoto. **Vy také potřebujete ‚pracovat se až na kost' a mít čirou odhodlanou rozhodnost, když meditujete.**\"\n\n**Gampopa** (1079-1153) byl úspěšným lékařem, šťastně ženatým s dětmi, ale jeho manželka a děti zemřely při epidemii – nestálost realizována viscerálně. Stal se mnichem ve věku 24 (používající vzácné lidské zrození), studoval s Kadampskými mistry, ale cítil něco chybí navzdory blaženosti a jasnosti. Když tři žebráci diskutovali přání – první chtěl jídlo a bohatství, druhý chtěl být narozen jako král, třetí chtěl být jako Milárepa, svobodný od smrti, krmený dakiní – když Gampopa slyšel Milárepovo jméno: „Dostal husí kůži a začal vzlykat slzami. Myslel ‚Musím jít, kdybych nešel, bylo by to špatné.'\" Cesta byla tak naléhavá, že sotva jedl nebo spal, zkolaboval z vyčerpání. Milárepa používal různé výukové metody: vyfouknutí pýchy ignorováním ho dva týdny, když se Gampopa cítil výjimečný; odmítnutí zlata: „Zlato nesouhlasí s myslí tohoto starého muže\"; přímý přenos Čakrasamvary, Vadžavarahi, tummo praxe. Výsledek: strávil 13 měsíců s Milárepou, obdržel úplné Kagjü instrukce, založil kláštery, učil tisíce, založil všechny větve Dagpo Kagjü.\n\n**16. Karmapa Rangdžung Rigpe Dordže** (1924-1981) přinesl tibetský buddhismus na Západ, založil dharma centra po celém světě, byl znám jako „Král joginů\". Jeho učení zdůrazňovalo propojenost všech bytostí, meditaci jako prostředek transformace zkušenosti, důležitost převzetí odpovědnosti za své činy, soucit jako jazyk bódhisattvy. Když byl požádán shrnout buddhismus v jedné větě na Americkém kongresu, řekl: „Vše se mění.\" Odmítl léky na bolest během konečné nemoci, tělo zanechané tři dny v nemocnici (tradiční praxe ukazující realizaci), personál nemocnice poznamenal jeho péči o jejich blaho nad jeho vlastním.\n\n**17. Karmapa Orgjen Trinle Dordže** (současnost) učí o vzácném lidském zrození: „Můžeme se sami sebe ptát: Jak je to, že mám tento vynikající soubor okolností? Měli bychom učinit naše životy smysluplné.\" O nestálosti osobní příklad: „Když mi bylo sedm let, pátrací skupina řekla mým rodičům, že jsem Karmapa... Najednou jsem byl osoba, před kterou jsme se prostrovali. Nevěděl jsem úplně, co dělat.\" Zpřístupňuje praxi: navrhl, že pokud zaneprázdněný rozvrh brání dokončení ngöndro, použijte speciální dny, kdy jsou účinky zvýšeny 100 000× (jako Sagadawa), nebo praktikujte pilně jeden měsíc bez počítání.\n\n**Kalu Rinpočhe** (1905-1989), jeden z největších meditačních mistrů 20. století, dokončil několik tříletých retreat. O integraci: „Kdykoli si uvědomíte, že nemeditujete, pak byste měli meditovat.\" Současný Kalu Rinpočhe (Jangsi) pokračuje v linii zdůrazňováním poctivosti a integrity v praxi.\n\n## Propojení s vyššími naukami a závěr\n\nČtyři myšlenky netvoří pouhé preliminární cvičení – jsou životní praxí, ke které se vracíme znovu a znovu. Džogčhen Rinpočhe, Kjabdže Dilgo Khyentse, udržoval ngöndro jako denní praxi až do konce svého života. Patrul Rinpočhe učil: „Tyto čtyři připomínky jsou řečeny být hlavním základem kontemplace. Kontemplováním je meditátor skutečně schopen zůstat bez fabrikace.\" Čhogjam Trungpa používal učení draka držícího čtyři perly – pokud je i jedna upuštěna, drak se zřítí. Musíme mít na paměti všechny čtyři myšlenky.\n\n17. Karmapa učí: „Předběžné praktiky nejsou jen něco, co děláme jednou; jsou základy, ke kterým se vracíme znovu a znovu během naší praxe.\" Tři myšlenky pracují synergicky: první myšlenka o vzácném lidském zrození a druhá myšlenka o smrti a nestálosti spolu souvisejí – máme inteligenci vidět, že náš lidský život je vzácný a že bychom jej měli učinit smysluplným, a vědouce, že to není vždy možné, využíváme okamžiku. Tímto způsobem můžeme reflektovat nad našimi životy a vynaložit se dát jim hlubší význam. Rozpoznání vzácného lidského zrození nám dává ocenění příležitosti, zatímco kontemplace nestálosti nám dává naléhavost ji moudře použít. Třetí myšlenka o karmě ukazuje, že vytváříme naše vlastní zkušenosti skrze činy, a čtvrtá myšlenka o nedostatcích samsáry ukazuje, že i pozitivní znovuzrození nakonec vedou k utrpení.\n\nSpolečně tyto čtyři kontemplace oslovují čtyři překážky bránící osvícení: připoutání k aktivitám tohoto života (náprava meditací nestálosti), připoutání k samsárickému potěšení (náprava reflexí o chybách samsáry a karmě), připoutání ke klidu (Hínajánový cíl, náprava láskyplnou laskavostí a soucitem), neporozumění metodě (náprava kultivováním bodhičitty). Jak učí *Sútra setkání otce a syna*: „Když člověk vidí chyby samsáry, vyvine veliký pocit smutku. Když se člověk bojí vězení tří říší, vynaloží úsilí jim vyhnout se.\"\n\nLinie Karma Kagjü, pojmenovaná po jejím důrazu na karmu (činnost buddhů), umísťuje tyto kontemplace do srdce předběžných praxí, chápajíc, že bez tohoto základu je osvobození nemožné. Pouze hlubokým pochopením jak fungování karmy, tak prostupující povahy utrpení samsáry, může vzniknout pravé zřeknutí se a bodhičitta – nezbytné předpoklady pro realizaci mahámudry a úplné osvícení.\n\nLama Norlha Rinpočhe učí: „Čtyři myšlenky jsou jako stavění základů vašeho domu. Pokud jste tyto myšlenky skutečně nevinternalizovali, vaše Dharma praxe nebude nikdy skutečně stabilní.\" Jak uzavírá 17. Karmapa: „Jako obyčejní lidé můžeme mít neobyčejnou bodhičittu a s touto můžeme určitě prospět druhým. Měli bychom věnovat naše tělo, řeč a mysl prospívání druhým a to nám určitě dovolí pomáhat.\" V tom je esence těchto čtyř myšlenek – nejen obrátit naši vlastní mysl k osvobození, ale kultivovat soucit a moudrost k prospěchu všech cítících bytostí putujících v oceánu samsáry.",
  "tags": [
    "Budhismus"
  ],
  "category": "BU",
  "metadata": {
    "readingTime": "20 min"
  },
  "id": "article-1761335261173",
  "title.en": "Four basic ideas",
  "description.en": "The four basic thoughts (the four general preparations) are like keys that open the door to true motivation on the path of dharma. In the Karma Kagyu lineage, they are called the four thoughts that turn the mind to dharma—because they literally turn our attention from the superficial things of the world toward that which is permanent and real.",
  "markdown.en": "# The Four Fundamental Thoughts That Turn the Mind to the Dharma\n\nThe Four Fundamental Thoughts (Tibetan *blo ldog rnam bzhi*, Czech: lo jong ngöndro) represent the most important preparation for any authentic practice in the Karma Kagyu lineage. **Without their true understanding and integration into our being, even decades of meditation remain an empty shell**, only strengthening our attachment to cyclic existence and the hardness of our heart. Kalu Rinpoche taught that if these four thoughts are not integrated into our consciousness, it does not matter how many years we practice - nothing substantial will happen. These contemplations systematically turn our minds away from samsaric concerns and toward liberation by (1) recognizing the rarity of the present opportunity, (2) realizing its impermanence, (3) understanding the law of cause and effect, and (4) seeing the inherent unsatisfactoriness of conditioned existence. These four thoughts constitute the common preliminary practices (*thun mong gi sngon 'gro*) that must precede the non-traditional preliminary practices—111,000 prostrations, Vajrasattva, mandala offerings, and guru yoga—and finally the practice of Mahamudra itself.\n\n## The Rarity of Human Birth Opens the Door to Liberation\n\nThe first thought teaches the Eight Freedoms (*dal wa gyé*) and the Ten Auspicious Conditions (*jor wa chu*), which together constitute the eighteen circumstances of a rare human birth (*dal jor chobgyé*). These conditions are so rare that the Buddha used the metaphor of a blind turtle living at the bottom of a vast ocean that surfaces once every hundred years—the probability of its head passing through a wooden yoke floating on the surface is greater than the probability of obtaining a rare human birth. Modern calculations confirm this intuition: the ratio of the surface area of ​​the oceans to the area of ​​the hole in the yoke comes out to be approximately 7.2 × 10^-16, which corresponds to Buddhist cosmological calculations of the probability of human rebirth.\n\n**The eight freedoms mean that we are not born** in hellish realms, where constant suffering makes any practice impossible; in the world of hungry ghosts (*yi dwak*), where mental burning and constant hunger consume all attention; in the animal kingdom (*dü dro*), where stupidity and absence of virtue prevent understanding; among long-lived gods who remain in non-conceptual states without mental activity; in barbaric lands where the Dharma is not available; with wrong views that prevent understanding the relationship between virtue and rebirth; at a time when the Buddha had not appeared; or with physical or mental handicaps that prevent understanding the teachings.\n\nThe ten auspicious conditions are divided into five personal advantages (*rang jor nga*) and five environmental advantages (*gzhan jor nga*). Personal advantages include human birth with functional organs, birth in a land where the teachings are available, intact sensory faculties, not turning to severe negative actions, and faith in the teachings. Environmental advantages mean that the Buddha appeared in this world, taught the Dharma, the teachings still exist, there are followers of the Dharma, and there is kind support from others, including spiritual friends. Gampopa teaches in *The Gem of Liberation* (*Dam cho Yizhin Norbu Tarpa Rinpoche Gyen*) that this human birth is rare for three reasons: it is difficult to obtain, it has great benefit, and it is easy to lose.\n\n**Gampopa quotes Acharya Chandragomin**: \"How great are its beneficial effects! By acquiring this precious human life, one can be liberated from the ocean of rebirth and also sow the seed of supreme enlightenment. This human life itself has greater qualities than a wish-fulfilling jewel... The path by which people can acquire great mental power cannot be acquired by gods or nagas or demigods, garudas, vidyadharas, kinnaras or urakas.\" This human birth provides three levels of ability: **the lower ability** leads to attaining the human or divine realm without falling into the lower realms, **the middle ability** enables one to attain peace and happiness by liberation from samsara, and **the highest ability** leads to Buddhahood for the benefit of all sentient beings.\n\nContemplative practice begins with the recognition of preciousness: daily morning contemplation of the eighteen conditions and checking which of them are present. The 17th Karmapa teaches that in the twenty-first century we must also recognize global interconnectedness—most of us were born into relatively comfortable conditions, while in many parts of the world people lack even the most basic necessities. This interdependence means that our happiness and suffering depend on countless other beings—even our clothes and food are the work of thousands of people. **Understanding interconnectedness brings responsibility for others**, which is the core of bodhicitta. Meditation consists of contemplating these points until the meaning of the occasion becomes clear, and then letting the mind rest in a natural, non-conceptual state. In practice, this means setting reminders throughout the day: in positive situations, recognizing the opportunity for positive action, in difficulties, reminding ourselves of the freedom to choose our response. Gampopa advises thinking of this body as a boat to cross the ocean of samsara, as a steed to escape the dangerous abyss of suffering, or as a servant of virtue.\n\n## Impermanence awakens us from the illusion of permanence\n\nThe second thought teaches about impermanence and death (*chi wa mi tak pa*), which are divided into gross and subtle impermanence. **Gross impermanence** includes death and extinction, while **subtle impermanence** refers to the momentary change of all conditioned things. Gampopa describes external impermanence in the Gem of Liberation: \"From this cosmic circle of wind down to the fourth stage of meditative concentration, there is nothing that has the nature of permanence or permanence. Sometimes everything from the first level of meditative concentration and below is destroyed by fire. Sometimes everything from the second level and below is destroyed by water. Sometimes everything from the third level and below is destroyed by wind.\" When the world is destroyed by fire, not even ashes remain like oil consumed by fire; no sediment remains like salt dissolved in water; no tiny particle remains like a pile of dust scattered by a strong wind.\n\nThe inner impermanence of sentient beings is taught by the *Sutra of Intentionally Spoken Verses*: “The result of all accumulation is dispersion. The result of all construction is fall. All who come together are separated. The end of life is death.” Subtle momentary impermanence is manifested in seasonal changes—in spring the earth softens, the colors become reddish, the grass, trees, and vegetables begin to sprout, all of which are signs of change caused by impermanence. In summer the earth is moist, the colors are green. During the day the external world is bright and white, but at night it becomes dark. “The first moment of this world does not exist in the second moment. Every moment is similar, and because of the similarity we are deceived into perceiving them as the same, like the flow of a river.”\n\nThe Nine-Point Meditation on Death (*nge pa dgu*) is a systematic contemplation structured as three roots, nine reasons, and three conclusions. **First root: death is certain**. Three reasons: (1) no one from the past lives – even great sages with five kinds of clairvoyance could not find a place where no one dies, Noble Beings including Arhats eventually had to leave their bodies, and even the Buddha’s Nirmanakaya body with large and small signs also left the body; (2) this body is composite and all composite phenomena are impermanent – ​​since the body is composite, it must be impermanent and death is final; (3) life is exhausted at every moment – ​​just as an arrow shot by a skilled archer does not stop in space for a moment until it reaches its target, so our life does not stay in one place for a moment and is rapidly approaching death. **Conclusion of the first root: I must practice the Dharma now**.\n\n**Second root: the time of death is uncertain**. Three reasons: (1) the length of life is indefinite—some beings die in the womb, some at birth, some while crawling, some die old, some young, some in the prime of youth; (2) the body has no essence—it consists only of thirty-six impure components, as the *Entry into the Conduct of Bodhisattvas* says: “First mentally separate the layers of skin from the flesh, and then with the scalpel of discernment separate the flesh from the skeleton... As you examine, ask yourself: ‘Where is the essence?’”; (3) there are many causes of death—*Letter to a Friend*: “This life has many dangers; it is more fragile than a bubble blown by the wind. It is a great miracle to have time to live: to breathe in and out and to wake up from sleep.” **Conclusion of the second root: I must practice the Dharma NOW (with urgency)**.\n\n**Third root: At the time of death, nothing can help except practicing the Dharma**. Three reasons: (1) we cannot be helped by our wealth – even if we can live happily for a long time by acquiring great material wealth, we will leave empty-handed and poor as if robbed by a thief; (2) we cannot be helped by our relatives or friends – when the time of death comes, your children cannot become a refuge, nor your father, mother or friends; besides not benefiting us, relatives harm us by creating attachments that throw us into the lower realms; (3) we cannot be helped by our own body – a body that is well maintained with food and clothing accumulated with great difficulty will not accompany us, but will be eaten by birds or dogs, or burned in a blazing fire, or rotted under water, or buried underground. **Conclusion of the third root: I must practice the Dharma purely (without distractions)**.\n\nThe 17th Karmapa teaches about positively framing impermanence: “Impermanence means that things change moment by moment. This suggests that with each moment we have a new opportunity. If we have done something negative in our lives, it is possible to change. Milarepa is a classic example; he saw the opportunity to transform his life and seized it.” Practically, this means contemplating the certainty of death but the uncertainty of its timing every morning, noting the changes throughout the day—the weather, the seasons, people coming and going—as reminders of impermanence, asking in the evening, “What have I done today that really matters? Can I find something meaningful?” and reflecting before going to bed that sleep is like a small death and we may not wake up. Atisha taught, “If you do not contemplate death in the morning, the morning is wasted. If you do not contemplate death in the afternoon, the afternoon is wasted.”\n\n## Karma is a reliable law of cause and effect\n\nThe third thought teaches about karma (*lé* or *las*) as a reliable law of cause and effect that pervades the entire universe across countless lives. **Gampopa quotes the *Treasury of Abhidharma***: “What causes suffering? We should know that it comes from the karma of troublesome action. Karma is the karma of mind and the karma of thought.” Karma is of two types: the karma of consciousness itself and the karma created by the mind, which manifests through the power of mind as the karma of body and speech. The 17th Karmapa teaches that we should consider karma on a broad scale: “Because we are all interdependent, everything I do affects not only myself, my family, or people close to me, but has an effect on the entire world. It is therefore very important that we all take responsibility for our actions.”\n\n**The Ten Virtuous Acts** (*gé wa chu*) represent the opposites of the Ten Unvirtuous Acts: protecting the lives of others, practicing great generosity, maintaining moral ethics (three bodies); speaking the truth, harmonizing those who are unfriendly, speaking gently and politely, speaking meaningfully (four speeches); practicing the reduction of attachment and the development of contentment, practicing loving-kindness, engaging in perfect meaning (three minds).\n\n**The Ten Unvirtuous Acts** (*mi gé wa chu*) involve the three bodies, four speeches, and three minds. *Three acts of the body*: (1) killing (*gsod pa*) – which may be motivated by desire for meat, sport, or wealth; hatred from insult or competition; ignorance through sacrifice; (2) stealing (*ma byin par len pa*) – taking by force, stealth, or fraud; (3) sexual misconduct (*log g.yem*) – with those protected by family, owner or Dharma (unsuitable parts, place, time, number, behavior). *Four speech acts*: (4) lying (*rdzun du smra ba*) – spiritual lies about qualities, big lies causing harm or benefit, small lies without substantial effect; (5) divisive speech (*phra ma*) – division by force, indirectly or secretly; (6) harsh words (*tshig rtsub*) – direct fault-finding, circumstantial sarcasm, indirect through relatives; (7) empty speech (*ngag 'khyal*) – untrue as heretical texts, worldly as useless chatter, true but inappropriate as teaching unsuitable students. *Three acts of mind*: (8) covetousness (*'dod chags*) – concerning one's own, another's or neither; (9) harmful thought (*gnod sems*) – from hatred, jealousy or resentment; (10) wrong views (*log lta*) – wrong views on cause and effect, on truth, on the Three Jewels.\n\n**The four characteristics of karma** define its workings: (1) **certainty** (*nges pa*) – when we experience misfortune, it is certain that it came from destructive actions, when we experience happiness, it is certain that it came from constructive behavior; (2) **growth from small** (*rgyas 'phel ba*) – small causes can grow into large results, a small seed can produce a plant with many fruits, therefore even small negative actions should be avoided or purified and even small virtuous actions should be cultivated; (3) **no encounter without a cause** (*phrad med na 'byung ba med*) – we do not encounter karmic results without gathering their causes, whatever we experience cannot arise without a cause; (4) **actions do not disappear** (*byas pa cud mi za ba*) – once created, karmic potentials and tendencies are sure to ripen unless they are purified (for negative karma) or disturbed by wrong views or anger (for positive karma). The ability of karmic legacies to produce results does not deteriorate even after millions of lives.\n\nKarma is divided into black, white and mixed. **Black karma** (*nag po'i las*) is undeserved karma arising from ten unwholesome actions, guided by disturbing emotions and leading to suffering. **White karma** (*dkar po'i las*) is meritorious karma consisting of the ten virtues and a life in accordance with virtuous action, leading to rebirth in human or divine realms. **Mixed karma** (*dkar nag 'dres pa'i las*) are actions that are partly harmful and partly wholesome. Gampopa teaches: \"Desire, aversion, ignorance, and the karma created by them are vices. All suffering comes from vice, as do the lower realms. Non-attachment, non-aggression, uncovered mind, and the karma created by them are virtues. All higher realms come from virtue, as do peace and joy in all other lives.\"\n\nThere are four types of karmic results: (1) **fully ripened effect** (*rnam smin gyi 'bras bu*) determines the realm of rebirth—completely negative actions lead to the lower realms, completely positive actions to the higher; (2) **effect similar to cause** (*rgyu mthun gyi 'bras bu*) has two aspects – experiential (even when we are born as humans, we experience similar circumstances such as a short life of killing) and habitual (having a predisposition to the same actions); (3) **environmental effect** (*bdag po'i 'bras bu*) – negative action shapes the external environment where one is born; (4) **proliferating effect** – the constant repetition of past actions that keeps us in an endless wandering in samsara.\n\nA practical meditation on karma begins with reflection on cause and effect: when positive actions predominate, we experience joyful results; when negative actions predominate, we experience mainly suffering. Systematically go through the ten unwholesome actions: remember when you engaged in each one, examine your mental state at the time, consider what you hoped to gain, reflect on how you felt afterward, and plan what to do if similar situations arise in the future. **Lama Rod Owens teaches**: “Karma is commonly misunderstood and misused in our society. Simply put, karma is understood as cause and effect: we do something, and that action has a consequence. But how do we grasp this truth as a direct experience and as a felt insight, rather than just getting stuck and remaining at this intellectual level of understanding?” When we experience happiness or suffering, trace it back to its karmic causes. When negative karma has been created, it can be purified by four powers: the power of remorse (genuine regret for the action), the power of reliance (taking refuge in the Three Jewels, generating bodhicitta), the power of antidote (Vajrasattva practice, confession, prostration, mandala offerings), and the power of resolution (a vow not to repeat the action).\n\n## Knowing the Defects of Samsara Creates True Renunciation\n\nThe fourth thought teaches about the defects of Samsara (*khor wä nye mik* or *'khor ba'i nyes dmigs*), which is permeated by three types of suffering: (1) **pervasive suffering** (*khyab pa 'du byed kyi sdug bsngal*) pervades from the moment the troublesome skandhas exist—ordinary people do not feel it (like a hair on the palm of their hand), but noble beings perceive it clearly (like a hair in the eye); (2) **suffering of change** (*gyur ba'i sdug bsngal*) means that all samsaric pleasure ultimately turns into suffering because its essential nature is suffering; (3) **suffering of suffering** (*sdug bsngal gyi sdug bsngal*) is the apparent suffering in addition to the pervading suffering—the gross sufferings of each realm.\n\n**The Six Realms of Existence** (*rik druk*) include hells, hungry ghosts, animals, humans, jealous gods, and gods. The *Hell Realms* (*nyel wa*) are divided into eight hot hells, eight cold hells, and occasional hells. The **Eight Hot Hells** are located 20,000 yojanas below Jambudvipa: (1) *Reviving Hell* (*yang sos*) – beings cut and kill each other, cold winds revive them to repeat the suffering, lifespan 500 years (1.62 trillion human years); (2) *Black Thread Hell* (*thig nag*) – bodies marked with black thread, then cut open with flaming swords or axes; (3) *Crushing Hell* (*bsdus 'joms*) – beings crushed between mountains or pressed between iron plates until blood flows like rivers; (4) *Howling Hell* (*ngu 'bod*) – beings utter terrified cries from burning; (5) *Great Howling Hell* (*ngu 'bod chen po*) – greater suffering with more terrified cries; (6) *Heating Hell* (*tsha ba*) – molten bronze poured into the body, pierced with thorny weapons; (7) *Intensely Heating Hell* (*rab tu tsha ba*) – molten bronze burns the entire inside, flames from nine openings; (8) *Hell of Continuous Suffering* (*mnar med*, Avichi) – blazing metal house 20,000 yojanas high, beings boiled in a bronze cauldron, fire from the four directions, no break in suffering, lifespan one intermediate kalpa.\n\n**Eight cold hells** in addition to the hot ones: (1) *Arbuda* (*chu bur*) – blisters cover the body, lifespan is equivalent to emptying a storehouse of 80 measures of mustard seeds, taking one seed every hundred years; (2) *Nirarbuda* (*chu bur rdol ba*) – blisters burst, lifespan 20× Arbuda; (3) *Atata* (*a chu zer ba*) – teeth chattering with cold; (4) *Hahava* (*ki hud zer ba*) – crying “A-chu”; (5) *Huhuva* (*kyi hud zer ba*) – loud wailing; (6) *Utpala* (*ut pa la ltar gas pa*) – skin bursts like utpala petals (5-6 pieces); (7) *Padma* (*pad ma ltar gas pa*) – red cracks like lotus petals (10+ pieces); (8) *Mahapadma* (*pad ma chen po ltar gas pa*) – darker red, bursts into 100+ pieces.\n\n*The realm of hungry ghosts* (*yi dwak*) is located 500 yojanas below King Yama, with hungry ghosts scattered in dry places. **Suffering includes external obscurations** – they see food and drink as pus and blood, or others guard it and prevent access; **internal obscurations** – they cannot eat or drink even when it is available: \"Some suffer from hunger – their bellies are like mountains and their mouths are as small as the eyes of needles. They have no ability to seek out even a small amount of impure food\"; **general obscurations** – such as the fiery wreath (stomachs burn when eating/drinking) or the filth eater (they can only eat feces, drink urine, or eat their own flesh). Life span is 500 years in their terms (one human month = one day for them).\n\n*Animal kingdom* (*dü dro*) includes many-legged, four-legged, two-legged, legless. Three sufferings: **being used** – domesticated animals under human power, tortured, enslaved; **being killed** – some die for pearls, wool, bones, blood, flesh and skin; **mutual consumption** – especially in the oceans: \"They eat whatever falls into their mouths.\" Life span is indefinite; the longest is one-fourth of a kalpa.\n\n*The human realm and its suffering* includes eight main ones: (1) **birth** (*skye ba'i sdug bsngal*) – extensive suffering in the intermediate state, in the womb (38 weeks of discomfort, like being boiled in a hot cauldron, pressed as in hell, darkness, smell, confinement), at birth like being pulled out with iron wires and thrown on thorns; (2) **old age** (*rga ba'i sdug bsngal*) – ten unimaginable changes: the body becomes curved and dependent on a stick, the hair turns gray and falls out, the skin thickens and wrinkled, the complexion turns pale like a wilted flower, abilities are lost, dignity is lost (disrespect, shame of the family), wealth diminishes, diseases accumulate, the mind changes (forgetfulness, confusion), the time of death approaches; (3) **illness** (*na ba'i sdug bsngal*) – great pain, harsh operations, hot/bitter medicines, stopping from eating/drinking desires, pleasing doctors, diminishing wealth, fear of death; (4) **death** (*'chi ba'i sdug bsngal*) – separation from arrogance, no refuge, no protector, no support, tormented by diseases, dry mouth, change of face, shortness of breath, cessation of breath, mouth and nose open, entering great darkness and falling from a great cliff; (5) **separation from loved ones** – boundless suffering in lamentation, mourning, crying, wailing when attached beings die; (6) **meeting with those we do not like** – suffering of meeting hated enemies leading to fighting, quarreling, beating; (7) **not finding what we desire** – inability to obtain what we want despite effort; (8) **five aggregates/protection of what we have** – pain of protecting possessions and body; the five troublesome skandhas themselves are suffering.\n\n*Jealous gods/asuras* (*lha min*) have similar sufferings as gods, but with additional problems: **mental suffering through jealousy** of the glory of gods, **constant fighting** with gods but always losing, **arrogance** prevents peace, inability to be satisfied despite pleasures. The *divine realm* (*lha*) contains six classes of gods, the realms of desire, seventeen realms of form, and four formless realms. **Gods of the realm of desire** suffer from struggle with demigods, dissatisfaction with pleasures, humiliation, cutting, killing, tearing, exile, and especially **death transfer**: five signs appear seven days before death (clothes become soiled with impurities, garlands of flowers wither, sweat from both armpits, foul body odor, they do not like their own seats), seven divine days of suffering (= seven human years), vision of future rebirth in lower realms, and then fall to lower realms. **Gods of the realm of form** attaining through meditative concentration are still subject to death transfer, have no independence in rebirth, attachment to meditative bliss leads back to samsara, finally, by exhausting good karma, they fall to lower realms. **The gods of the formless realms** (Infinite Space, Infinite Consciousness, Nothingness, Neither Perception nor Non-Perception) have extremely long lifespans, but are still transient, no Dharma practice during these states, fall to lower realms upon exhaustion of merit.\n\n**The omnipresent suffering of conditioned existence** means that this state of samsara is of the nature of great suffering, \"like a house of blazing fire\". The *Womb Entry Sutra* declares: \"Alas, the ocean of samsara is burning—blazing, extremely blazing, supremely blazing, and supremely extremely blazing. Therefore, there is not a single sentient being who is not tormented by it. What kind of fire burns so great? It is the fire of desire, aversion, and ignorance. The fire of birth, old age, and death. These burn and burn continually with the fire of suffering, lamentation, hardship, and conflict. Therefore, no one is free from them.\" Acharya Naragarjuna concludes: \"Samsara is like this: there are no good rebirths among gods, humans, hell beings, hungry ghosts, and animals. Understand that birth is a vessel of much suffering.\"\n\nThe meditation involves systematic contemplation of the six realms: visualize each realm vividly using traditional descriptions, imagine yourself experiencing these sufferings, develop compassion for beings trapped there, recognize your own potential to be reborn there, and develop the determination to escape samsara. Practice recognizing the omnipresent suffering in every conditioned moment, the suffering of change in pleasures that fade, and the suffering of suffering in apparent painful experiences. The 17th Karmapa teaches: “True happiness means being free from disturbing emotions. If we are under the influence of negative actions or the three poisons [ignorance, hatred, and attachment], it is difficult to be free and independent. Being under the power of these disturbing emotions is all-pervading suffering.” Throughout the day, reflect on the examples of suffering you observe, contemplate: “I am also of the same essential nature, in the same condition, and have the same character. I am not beyond this reality,” and create renunciation—the true desire to be free from samsara.\n\n## Practical aspects and signs of successful contemplation\n\nFor **rare human birth**, successful contemplation means that you are never lazy, natural diligence arises, everything needed for meditation comes naturally, deep appreciation without coercion. For **impermanence**, a sense of urgency becomes tangible, natural motivation to practice, reduced preoccupation with worldly goals, appreciation of the freshness of each moment. For **karma**, naturally asking about consequences before acting, reliable guide for thoughts, words, actions, taking responsibility for all actions. For **deficiencies of samsara**, true renunciation (not forced), reduced grasping for comfort, seeing through temporary pleasures, natural turning to liberation.\n\nTraditional recommendations include practicing each thought until direct experience emerges – it could take a lifetime to spend one. The 8th Karmapa taught flexibility: some may not realize the first thought and become discouraged, but they might realize impermanence (the second) and the power of this would help realize the first. Lama Ole Nydahl recommends three weeks of contemplation on each of the four thoughts. In the Tibetan tradition, many practice ngöndro 20-25 times in their lifetime. The 17th Karmapa suggests using vacation time for intensive practice or practicing diligently for a month.\n\n**Common obstacles** include pride and arrogance – the solution is Milarepa’s example of ignoring Gampopa for two weeks to deflate pride; attachment to comfort – the solution is repeated contemplation of suffering and impermanence; impatience with expecting immediate results – the solution is realistic expectations; a misunderstanding of emptiness that falls into nihilism – the solution is Milarepa’s teaching: “No matter how much you squeeze sand, you will never get oil”; too much conceptual meditation leading to states of formless realm without wisdom - the solution is the need for key instructions and the path of means (tummo, prana).\n\n**The connection with ngöndro and mahámudra** is essential. The structure of ngöndro includes common (usual) preliminary practices = Four thoughts that turn the mind to the dharma, create right motivation and establish the foundation. Non-conventional\n\n(unusual) preliminary practices (4 × 111 111) include (1) refuge and bodhicitta with prostrations to cleanse the energy channels, build strength and confidence; (2) Vajrasattva to cleanse obscurations and negative karma; (3) mandala offering to accumulate merit and wisdom; (4) guru yoga to receive blessings and unite with the mind of the teacher. The 17th Karmapa teaches: \"It is important to practice these four until direct experience arises in our being; otherwise the following practices will have no effect.\"\n\nThe 9th Karmapa Wangchuk Dorje composed \"The Vehicle for Traveling the Noble Path\"—the standard text of the Karma Kagyu Ngondro. The progressive path leads from the Four Thoughts (turning the mind to the Dharma, developing renunciation) through the Non-Traditional\n\nPreliminary Practices (purifying, accumulating, receiving blessings) to the practice of yidam (transforming perceptions) and finally to mahamudra (recognizing the nature of the mind directly). Gampopa integrated the Kadampa gradual path with the mahamudra of direct introduction, creating a systematic approach unique to the Dagpo Kagyu—\"The Unification of Kadampa and Mahamudra.\" Gampopa's Four Dharmas show progressive deepening: (1) \"Make a blessing that my mind may turn to the dharma\", (2) \"Make a blessing that the dharma may advance along the path\", (3) \"Make a blessing that the path may dispel confusion\", (4) \"Make a blessing that confusion may emerge as wisdom.\"\n\n## Stories and Examples from the Lives of Kagyu Masters\n\n**Milárepa** represents the ultimate example of transformation through these contemplations. After committing murders by black magic, he experienced unbearable remorse (realization of precious human life and karma). The urgency of impermanence drove intense practice. He endured extreme hardship to purify his karma and attained enlightenment in one lifetime. His final teaching to Gampopa showed his buttocks covered in calluses like animal hooves from sitting on a stone without a cushion: \"There is no deeper teaching than this. Now you can imagine the hardships I went through. My attainment of great realization came from this. **You also need to 'work yourself to the bone' and have a clear, determined resolve when you meditate.**\"\n\n**Gampopa** (1079-1153) was a successful physician, happily married with children, but his wife and children died in an epidemic—impermanence realized viscerally. He became a monk at the age of 24 (using a rare human birth), studied with Kadamp masters, but felt something was missing despite his bliss and clarity. When three mendicants were discussing wishes—the first wanted food and wealth, the second wanted to be born as a king, the third wanted to be like Milarepa, free from death, fed by dakinis—when Gampopa heard Milarepa's name: \"He got goosebumps and started sobbing tears. He thought, 'I must go, if I don't go it will be bad.'\" The journey was so urgent that he barely ate or slept, collapsing from exhaustion. Milarepa used various teaching methods: deflating his pride by ignoring him for two weeks when Gampopa felt special; rejecting gold: \"Gold does not agree with this old man's mind\"; direct transmission of the Chakrasamvara, Vajavarahi, tummo practices. Result: spent 13 months with Milarepa, received full Kagyu instruction, founded monasteries, taught thousands, founded all branches of the Dagpo Kagyu.\n\n**16th Karmapa Rangjung Rigpe Dorje** (1924-1981) brought Tibetan Buddhism to the West, established dharma centers around the world, was known as the \"King of Yogis\". His teachings emphasized the interconnectedness of all beings, meditation as a means of transforming experience, the importance of taking responsibility for one's actions, compassion as the language of the bodhisattva. When asked to summarize Buddhism in one sentence at the U.S. Congress, he said, \"Everything changes.\" He refused pain medication during his terminal illness, his body left in the hospital for three days (a traditional practice indicating realization), and the hospital staff noted his concern for their well-being over his own.\n\n**17. Karmapa Orgyen Trinle Dorje** (present) teaches about the rare human birth: “We can ask ourselves: How is it that I have this excellent set of circumstances? We should make our lives meaningful.” On impermanence, a personal example: “When I was seven years old, a search party told my parents that I was the Karmapa... Suddenly I was the person we were prostrating to. I didn’t quite know what to do.” Makes the practice accessible: He suggested that if a busy schedule prevents completing the ngöndro, use special days when the effects are magnified 100,000x (like Sagadawa), or practice diligently for one month without counting.\n\n**Kalu Rinpoche** (1905-1989), one of the greatest meditation masters of the 20th century, completed several three-year retreats. On integration: “Whenever you realize that you are not meditating, then you should meditate.” The current Kalu Rinpoche (Jangsi) continues the lineage by emphasizing honesty and integrity in practice.\n\n## Connections to Higher Teachings and Conclusion\n\nThe Four Thoughts are not just preliminary exercises—they are a lifelong practice that we return to again and again. Dzogchen Rinpoche, Kyabje Dilgo Khyentse, maintained ngöndro as a daily practice until the end of his life. Patrul Rinpoche taught, “These four reminders are said to be the main foundation of contemplation. By contemplating, the meditator is truly able to remain without fabrication.” Chogyam Trungpa used the teaching of the dragon holding four pearls—if even one is dropped, the dragon will collapse. We must keep all four thoughts in mind.\n\nThe 17th Karmapa teaches, “The preliminary practices are not just something we do once; they are the foundations that we return to again and again throughout our practice.” The three ideas work synergistically: the first idea about the rarity of human birth and the second idea about death and impermanence are related—we have the intelligence to see that our human life is precious and that we should make it meaningful, and knowing that this is not always possible, we seize the moment. In this way, we can reflect on our lives and strive to give them deeper meaning. Recognizing the rarity of human birth gives us an appreciation of the opportunity, while contemplating impermanence gives us the urgency to use it wisely. The third idea about karma shows that we create our own experiences through actions, and the fourth idea about the shortcomings of samsara shows that even positive rebirths ultimately lead to suffering.\n\nTogether, these four contemplations address the four obstacles to enlightenment: attachment to the activities of this life (correction through meditation on impermanence), attachment to samsaric pleasure (correction through reflection on the faults of samsara and karma), attachment to peace (the Hinayana goal, correction through loving-kindness and compassion), and misunderstanding of the method (correction through the cultivation of bodhicitta). As the *Father-Son Meeting Sutra* teaches: “When one sees the faults of samsara, one develops a great sense of sorrow. When one fears the imprisonment of the three realms, one makes an effort to avoid them.”\n\nThe Karma Kagyu lineage, named for its emphasis on karma (the actions of the Buddhas), places these contemplations at the heart of the preliminary practices, understanding that without this foundation, liberation is impossible. Only by deeply understanding both the workings of karma and the pervasive nature of samsara’s suffering can true renunciation and bodhicitta arise—the necessary prerequisites for the realization of mahamudra and complete enlightenment.\n\nLama Norlha Rinpoche teaches: “The four thoughts are like building the foundation of your house. If you have not truly internalized these thoughts, your Dharma practice will never be truly stable.” As the 17th Karmapa concludes: “As ordinary people, we can have extraordinary bodhicitta, and with this we can certainly benefit others. We should devote our body, speech, and mind to benefiting others, and this will certainly allow us to help.” That is the essence of these four thoughts—not only turning our own minds to liberation, but cultivating compassion and wisdom for the benefit of all sentient beings wandering in the ocean of samsara.",
  "tags.en": [
    "buddhism"
  ],
  "date": "2025-10-24"
}