{
  "title": "Pomíjivost",
  "description": "Pomíjivost z pohledu tibetského buddhismu linie Karma Kagju",
  "markdown": "# Pomíjivost z pohledu tibetského buddhismu linie Karma Kagju\n\n## 1. Úvod\n\nVítejte na dnešní přednášce o pomíjivosti, jednom z nejzákladnějších učení buddhismu. V tibetštině se pomíjivost nazývá *mi tag pa* (མི་རྟག་པ་), což doslova znamená \"to, co není trvalé\". Toto učení není jen filozofickým konceptem, ale živou praxí, která může fundamentálně proměnit náš způsob života.\n\nV linii Karma Kagju, jedné ze čtyř hlavních škol tibetského buddhismu, se klade mimořádný důraz na přímou zkušenost pomíjivosti skrze meditaci. Nejde jen o intelektuální pochopení, ale o hluboké prožití této pravdy v každém okamžiku našeho života. Jak učil sám Buddha Šákjamuni před více než 2500 lety: \"Vše podmíněné se rodí, mění a zaniká.\" Toto jednoduché konstatování obsahuje klíč k osvobození od utrpení.\n\nLinie Kagju, známá jako \"linie ústního předávání\", vznikla v Tibetu v 11. století. Její zakladatelé – Marpa, Milarepa a Gampopa – všichni hluboce prožívali pravdu pomíjivosti ve svých životech. Marpa ztratil svého syna, Milarepa viděl smrt své rodiny, Gampopa přišel o manželku a děti během epidemie. Právě tyto zkušenosti je přivedly k hlubokému duchovnímu hledání a nakonec k realizaci pravé povahy mysli, která je za všemi změnami.\n\n## 2. Tři znamení existence (*mtshan nyid gsum*)\n\nBuddha identifikoval tři základní charakteristiky veškeré podmíněné existence, které v tibetštině nazýváme *mtshan nyid gsum* (མཚན་ཉིད་གསུམ་). Těmito třemi znameními jsou:\n\n**Pomíjivost (*mi tag pa*)** – Nic v podmíněném světě není trvalé. Od nejmenšího atomu po největší galaxie, vše je v neustálém pohybu a změně. Naše těla stárnou, myšlenky přicházejí a odcházejí, vztahy se mění, civilizace vznikají a zanikají. Tato pomíjivost není chyba nebo nedokonalost světa – je to jeho přirozená povaha.\n\n**Utrpení nebo neuspokojivost (*sdug bsngal* – དུཿཁ་བསྔལ་)** – Protože se vše mění, nemůžeme najít trvalé uspokojení v ničem podmíněném. I ty nejkrásnější okamžiky pominou, nejsilnější radost se vytratí. To neznamená, že život je jen utrpení, ale že žádný podmíněný stav nemůže poskytnout trvalé naplnění.\n\n**Absence trvalého já (*bdag med* – བདག་མེད་)** – Neexistuje žádné pevné, neměnné já nebo duše. To, co považujeme za \"já\", je jen proud neustále se měnících tělesných a mentálních procesů. Toto učení o ne-já je jedinečným přínosem buddhismu.\n\nPomíjivost je často označována jako brána k pochopení zbylých dvou charakteristik. Když skutečně vidíme a prožíváme pomíjivost všech věcí, přirozeně chápeme, proč lpění přináší utrpení a proč neexistuje žádné pevné já, na kterém bychom mohli lpět. Jak říkal Gampopa: \"Pochopení pomíjivosti je počátkem všech realizací.\"\n\n## 3. Čtyři připomínky (*blo ldog rnam bzhi*)\n\nV tradici Kagju praktikujeme \"čtyři myšlenky, které obracejí mysl k dharmě\" (*lo dok nam ži* – བློ་ལྡོག་རྣམ་བཞི་). Tyto čtyři připomínky jsou považovány za základ veškeré duchovní praxe a pomáhají nám jasně se rozhodovat v životě.\n\n### První připomínka: Vzácné lidské zrození\n\nNarodit se jako člověk s příležitostí praktikovat dharmu je vzácnější než to, aby slepá želva prostrčila hlavu otvorem jha plovoucího po nekonečném oceánu jednou za sto let – tak zní tradiční přirovnání. Máme neuvěřitelnou příležitost: jsme obdařeni inteligencí, schopností rozlišovat mezi prospěšným a škodlivým, a máme přístup k učení. Toto vzácné lidské tělo je naším vozidlem k osvícení.\n\n### Druhá připomínka: Pomíjivost a smrt\n\nJak říká tradiční text, který používáte v meditaci: \"Vnější svět a bytosti jsou pomíjivé. Zejména délka života bytosti se podobá vzduchové bublině na vodě. Není jisté, kdy zemřu. V okamžiku smrti ze mě bude mrtvola. Protože pak jsou užitečná jenom Buddhova učení, měl bych je aktivně praktikovat.\"\n\nSmrt je jediná jistota v životě. Nevíme kdy přijde – může to být za padesát let, za rok, zítra nebo dokonce dnes. Tibetská tradice učí, že existuje nesčetné množství příčin smrti, ale jen málo toho, co podporuje život. Naše tělo je křehké jako bublina – stačí malá nemoc, nehoda nebo prostě vyčerpání životní síly, a tento vzácný život skončí. Džigme Rinpočhe ve své knize zdůrazňuje: \"Kvůli pomíjivosti nemůžeme praktiku odkládat donekonečna. Čas se pro nikoho z nás nezastaví.\"\n\n### Třetí připomínka: Karma – zákon příčiny a následku\n\nNaše činy zanechávají stopy (*bag chags* – བག་ཆགས་) v proudu naší mysli. Každá myšlenka, každé slovo, každý skutek vytváří otisk, který dozraje v budoucí zkušenost. Prospěšné činy vedou ke štěstí, škodlivé k utrpení. Tento zákon funguje neomylně jako přírodní zákon – není to trest nebo odměna od nějaké vnější síly, ale přirozený důsledek našich činů.\n\n### Čtvrtá připomínka: Neuspokojivost samsáry (následky karmy)\n\nŽádný stav v cyklické existenci není trvale uspokojivý. I bohové v nebeských říších nakonec vyčerpají svou dobrou karmu a spadnou do nižších stavů. Bohatství se může změnit v chudobu, zdraví v nemoc, sláva v hanbu. Jak učí Gampopa v *Ozdobném klenotu vysvobození*: \"Samsára znamená cyklickou existenci. Je to existence zapletená do nekonečných cyklů narození, stárnutí a smrti.\"\n\nDžigme Rinpočhe vysvětluje význam pravidelného přemýšlení o těchto čtyřech myšlenkách: \"Uvažujeme o tom, jak pomíjivost funguje v našich každodenních zkušenostech. Jsme si jí vědomi a ve vztahu k ní nemáme strach, nepřekvapuje nás, ani se kvůli ní nemusíme vymlouvat. Přijímáme ji jako normální součást života.\"\n\n## 4. Hlubší vhled: Mahámudra a povaha mysli\n\nV učení mahámudry (*phyag rgya chen po* – ཕྱག་རྒྱ་ཆེན་པོ་), které je srdcem praxe linie Kagju, se pomíjivost chápe na mnohem hlubší úrovni. Nejde jen o to, že věci zanikají – jde o pochopení samotné povahy reality jako nepřetržitého proudu okamžiků bez jakékoli pevné podstaty.\n\n### Mysl jako obloha\n\nV mahámudře používáme klasickou metaforu: myšlenky, emoce a vjemy jsou jako mraky na obloze. Mraky se objevují, mění tvar, pohybují se a nakonec se rozplynou. Ale obloha sama – čistá, prostorná, nezasažená – zůstává. Tato obloha je naše pravá povaha mysli (*sem nyid* – སེམས་ཉིད་), která je za všemi změnami.\n\nKdyž sedíme v meditaci a pozorujeme svou mysl, vidíme nekonečný proud myšlenek a pocitů. Jedna myšlenka vzniká, trvá krátký okamžik a pak zmizí, aby udělala místo další. Tento proces nikdy nekončí. Ale to, co si všímá těchto změn – samotné uvědomění – je stálé a neměnné.\n\n### Jednota prázdnoty a projevu\n\nVšechny jevy jsou současně prázdné (*stong pa* – སྟོང་པ་) své vlastní podstaty a přesto se živě projevují. Tato paradoxní jednota prázdnoty a projevu je srdcem mahámudry. Právě proto, že věci nemají pevnou podstatu, mohou se měnit a projevovat. Kdyby měly trvalou, neměnnou esenci, žádná změna by nebyla možná.\n\nMilarepa, největší jogín linie Kagju, zpíval: \"Všechny jevy jsou jako duha – jasně se objevují, ale když je zkoumáš, nenajdeš nic pevného.\" Strávil celý život meditací v jeskyních tibetských hor s hlubokým vědomím, že každý okamžik může být jeho poslední. Toto vědomí pomíjivosti nevedlo k depresi nebo nihilismu, ale k nesmírné radosti a svobodě. Ve svých písních často vyjadřoval, jak pomíjivost všech věcí odhaluje jejich pravou krásu.\n\n### Praxe mahámudry\n\nV praxi mahámudry se učíme spočívat v přirozené mysli (*tha mal gyi shes pa* – ཐ་མལ་གྱི་ཤེས་པ་). Nesažíme se zastavit myšlenky ani je udržet – prostě je necháváme přirozeně vznikat a zanikat jako vlny v oceánu. Postupně rozpoznáváme, že samotná pomíjivost myšlenek a jevů ukazuje na to, co je za nimi – na neměnnou, jasnou a prostornou povahu mysli.\n\n## 5. Praktické dopady pochopení pomíjivosti\n\nPochopení pomíjivosti není jen filozofickou záležitostí – má hluboké praktické důsledky pro náš každodenní život.\n\n### Přijetí smrti jako přirozeného přechodu\n\nV tibetské tradici není smrt vnímána jako tragédie, ale jako přirozený přechod. Džigme Rinpočhe vysvětluje: \"Přechod ze současného života do dalšího života je přirozený a automatický proces. Období mezi nimi je známé jako bardo. Mysl v bardu přijme nové zrození.\"\n\nKdyž skutečně přijmeme realitu smrti, paradoxně to osvobodí náš život. Přestaneme žít v popírání a strachu. Můžeme se připravit na smrt prostřednictvím praxe, zejména meditací powa (*'pho ba* – འཕོ་བ་), přenosu vědomí v okamžiku smrti. Tato příprava nám dává důvěru a klid tváří v tvář nevyhnutelnému.\n\n### Uvolnění lpění\n\nKdyž víme, že vše, co milujeme, jednou ztratíme, můžeme se učit milovat bez lpění. To neznamená, že se staneme lhostejnými nebo chladnými. Naopak – láska bez lpění je čistší a silnější. Je to láska, která dává svobodu, ne láska, která svazuje a omezuje.\n\nGampopa učil: \"Veškerá samsára je jako včerejší sen.\" Když se probudíme ze snu, všechny radosti a strasti snu zmizí. Podobně všechno, o co se tak staráme v tomto životě, jednou zmizí jako ranní rosa. To nás osvobozuje od přílišného lpění na dočasných věcech.\n\n### Ocenění přítomného okamžiku\n\nParadoxně, když skutečně pochopíme pomíjivost, každý okamžik se stává vzácným. Tradiční tibetské přirovnání říká: \"Život je jako kapka rosy na stéble trávy – krásná, ale brzy zmizí.\" Právě proto, že rosa brzy zmizí, je tak krásná. Každý úsvit, každý západ slunce, každé setkání s přítelem může být poslední. Toto vědomí dodává životu hloubku a intenzitu.\n\nV praxi to znamená být plně přítomný. Když jíme, skutečně jíme. Když mluvíme s přítelem, jsme tam celí. Když meditujeme, jsme plně v meditaci. Pomíjivost nás učí neplýtvat časem na zbytečnosti a plně prožívat to, co je před námi.\n\n### Inspirace k okamžité praxi\n\nDžigme Rinpočhe zdůrazňuje urgentnost praxe: \"Musíme se snažit získat větší jasnost mysli, pokud jsme tady. To nám pomůže v bardu, časovém období poté, kdy opustíme tento život, a před tím, než se znovu zrodíme.\"\n\nMnoho praktikujících odkládá seriózní praxi na \"později\" – až budou mít více času, až vyřeší své problémy, až budou v důchodu. Ale pochopení pomíjivosti nám ukazuje, že \"později\" nemusí nikdy přijít. Jediný čas, který máme, je teď. Každý den, který promarníme, je den, který už se nevrátí.\n\n## 6. Příklady a obrazy z tradice\n\nLinie Kagyu je bohatá na příklady mistrů, kteří hluboce pochopili a žili pravdu pomíjivosti.\n\n### Marpa Překladatel\n\nMarpa (1012-1097) byl laický praktikující, který měl rodinu a majetek. Když jeho milovaný syn Darma Dodé tragicky zemřel, Marpa prožil obrovskou bolest. Ale tato zkušenost ho přivedla k ještě hlubšímu pochopení dharmy. Učil, že právě skrze plné prožití bolesti ze ztráty můžeme realizovat pravou povahu mysli, která je za všemi ztrátami a zisky.\n\n### Milarepa, jogín hor\n\nMilarepa (1040-1123) je možná nejslavnější postavou tibetského buddhismu. Po tom, co v mládí způsobil smrt mnoha lidí černou magií, hluboce litoval a hledal očistu. Jeho učitel Marpa mu dal nesmírně těžké úkoly, včetně stavění a bourání kamenných věží. Milarepa pochopil, že stejně jako tyto věže, i náš život je dočasnou stavbou.\n\nPo letech tvrdé praxe dosáhl osvícení a strávil zbytek života meditací v jeskyních. Zpíval: \"V jeskyni na hoře sedím sám, ale nejsem osamělý – mým společníkem je pomíjivost všech věcí.\" Jeho písně často vyjadřují radost z pochopení pomíjivosti: \"Když vidím, jak všechno pomíjí, mé srdce tančí jako dítě.\"\n\n### Gampopa, mnich-lékař\n\nGampopa (1079-1153) byl původně lékař s manželkou a dětmi. Když jeho rodina zemřela během epidemie, byl zdrcený. Ale tato tragédie ho přivedla k dharmě. Stal se mnichem a později žákem Milarepy. Ve svém díle *Ozdobný klenot vysvobození* systematicky vyložil cestu k osvícení, začínající právě pochopením pomíjivosti.\n\nGampopa učil: \"Být si vědomý znamená být vědomý, bdělý. To znamená, že si musíme být vědomi svých myšlenek, řeči a jednání, co nejvíc to dokážeme a pravidelně.\" Toto vědomí pomíjivosti se musí stát naší druhou přirozeností, ne něčím, o čem jen intelektuálně víme.\n\n### Tradiční obrazy a přirovnání\n\nTibetská tradice používá mnoho krásných přirovnání pro pomíjivost:\n\n- **Bublina na vodě** – objeví se, chvíli trvá a pak praskne. Takový je náš život.\n- **Blesk v noci** – na okamžik osvítí temnotu a pak zmizí. Takové jsou naše okamžiky štěstí.\n- **Ranní rosa** – třpytí se v prvních paprscích slunce, ale jakmile slunce vystoupí výš, vypaří se.\n- **Sen** – může se zdát velmi skutečný, ale při probuzení zjistíme, že to byla jen hra mysli.\n- **Divadelní představení** – herci hrají své role, ale když spadne opona, vše končí.\n- **Ozvěna v horách** – zdá se skutečná, ale je to jen odraz zvuku, bez vlastní podstaty.\n\n## 7. Integrace pomíjivosti do každodenního života\n\nJak můžeme prakticky integrovat pochopení pomíjivosti do našeho každodenního života? Džigme Rinpočhe nabízí cennou radu: \"Ačkoli o pomíjivosti už víme, nebereme ji jako samozřejmost. Snažíme se pomalu si na tento pohled zvyknout, takže se stane návykem mysli, tendencí mysli, tibetsky *bag chags*.\"\n\n### Ranní připomínka\n\nKaždé ráno, když se probudíme, můžeme si připomenout: \"Probudil jsem se. Mnoho bytostí včera zemřelo a už se neprobudilo. Mám další den života – jak ho využiji?\" Tato jednoduchá připomínka nastaví tón celého dne.\n\n### Večerní reflexe  \n\nVečer před spaním můžeme reflektovat: \"Další den mého života skončil a už se nikdy nevrátí. Využil jsem ho smysluplně? Co jsem se naučil? Jak jsem pomohl druhým?\" A pak: \"Možná se ráno neprobudím. Jsem připravený?\"\n\n### Meditace na pomíjivost\n\nBěhem formální meditace můžeme pozorovat pomíjivost přímo:\n- Sledujeme dech – každý nádech a výdech je jedinečný a nikdy se neopakuje\n- Pozorujeme myšlenky – vznikají z prázdnoty a do prázdnoty se vracejí\n- Vnímáme tělesné pocity – neustále se mění, nikdy nezůstávají stejné\n\n### Připomínky v běžných situacích\n\n- Když vidíme krásný západ slunce, uvědomíme si, že za chvíli bude tma\n- Když se setkáme s přítelem, víme, že jednou se rozloučíme naposledy  \n- Když něco získáme, pamatujeme, že to jednou ztratíme\n- Když něco ztratíme, chápeme, že to je přirozený běh věcí\n\n### Transformace obtížných emocí\n\nKdyž prožíváme hněv, smutek nebo strach, můžeme si připomenout jejich pomíjivost. Tyto emoce jsou jako mraky – přijdou, na chvíli zakryjí jasnou oblohu mysli, ale nakonec odejdou. Nemusíme s nimi bojovat ani je potlačovat – stačí je pozorovat s vědomím jejich dočasnosti.\n\n## 8. Překážky v pochopení pomíjivosti\n\nNa cestě k hlubokému pochopení pomíjivosti často narážíme na překážky:\n\n### Intelektuální pochopení bez prožitku\n\nMnoho praktikujících rozumí pomíjivosti intelektuálně, ale nemá hluboký prožitek. Džigme Rinpočhe varuje: \"Nemusíme se nutit stále pomíjivost hledat. Jenom se snažíme pomalu si na tento pohled zvyknout.\" Jde o postupný proces, ne o náhlé pochopení.\n\n### Strach ze smrti\n\nPřirozená reakce na uvědomění pomíjivosti je strach. Ale tento strach postupně mizí, jak se prohlubuje naše praxe a pochopení. Realizujeme, že to, co skutečně jsme – povaha naší mysli – je za narozením a smrtí.\n\n### Nihilismus a deprese\n\nNěkteří lidé reagují na pomíjivost nihilismem: \"Když všechno pomíjí, nic nemá smysl.\" To je nesprávné pochopení. Právě proto, že věci pomíjejí, jsou vzácné. Právě proto, že máme omezený čas, je důležité, jak ho využijeme.\n\n### Příliš mnoho přemýšlení\n\nParadoxně, příliš mnoho intelektuálního přemýšlení o pomíjivosti může být překážkou. Potřebujeme rovnováhu mezi kontemplací a přímým prožitkem v meditaci.\n\n## 9. Pomíjivost jako cesta k osvícení\n\nV tradici Kagju není pomíjivost jen předběžnou praxí – je to cesta sama. Jak učil velký mistr 19. století Jamgön Kongtrul: \"Meditace na pomíjivost je nejlepší ze všech meditací.\"\n\n### Od hrubé k jemné pomíjivosti\n\nZačínáme pozorováním hrubé pomíjivosti – smrti, změn ročních období, stárnutí. Postupně se naše vnímání zjemňuje a vidíme pomíjivost v každém okamžiku – každá myšlenka, každý pocit, každý vjem vzniká a zaniká v každém okamžiku.\n\n### Realizace přirozené mysli\n\nKdyž skutečně vidíme pomíjivost všech jevů, přirozeně se ptáme: \"Co je to, co vnímá všechny tyto změny?\" Tato otázka nás vede k realizaci přirozené mysli (*rigpa* – རིག་པ་), která je za všemi změnami. Tato mysl je jako zrcadlo – odráží všechny jevy, ale samo zůstává nezasažené.\n\n### Soucit vznikající z pomíjivosti\n\nKdyž vidíme, že všechny bytosti podléhají pomíjivosti – rodí se, trpí, stárnou a umírají – přirozeně vzniká soucit. Uvědomujeme si, že všichni jsme na stejné lodi. Tento soucit není sentimentální, ale je založený na hlubokém pochopení reality.\n\nPráh linie Kagju učí rozvíjet *bodhičittu* (བྱང་ཆུབ་ཀྱི་སེམས་) – osvícenskou mysl, která si přeje dosáhnout osvícení pro prospěch všech bytostí. Tato motivace transformuje naše pochopení pomíjivosti z něčeho, co může vést k depresi, na něco, co nás inspiruje k praxi pro dobro všech.\n\n## 10. Závěr: Žít s vědomím pomíjivosti\n\nPomíjivost není důvod ke strachu nebo smutku – je to připomínka nesmírné hodnoty našeho života a důležitosti duchovní praxe. Jak říká Džigme Rinpočhe: \"Určitým způsobem pomíjivost také znamená kontinuitu. Věci nezůstávají stejné, stále se mění, stále se vyvíjejí.\"\n\nV linii Kagju je důraz vždy na přímé zkušenosti. Nestačí jen číst nebo přemýšlet o pomíjivosti – musíme ji vidět, cítit a žít každý den. Jak učí tradiční text: \"Protože v okamžiku smrti jsou užitečná jenom Buddhova učení, měl bych je aktivně praktikovat.\"\n\n### Praktické kroky\n\nPro integraci tohoto učení do vašeho života doporučuji:\n\n1. **Každodenní kontemplaci** – Věnujte alespoň 5 minut denně přemýšlení o pomíjivosti. Můžete použít tradiční čtyři připomínky nebo jednoduše pozorovat změny kolem sebe.\n\n2. **Pravidelnou meditaci** – V meditaci přímo pozorujte pomíjivost myšlenek, pocitů a vjemů. Začněte s 10-15 minutami denně a postupně prodlužujte.\n\n3. **Studium textů** – Čtěte klasické texty jako Gampopův *Ozdobný klenot vysvobození* nebo Patrula Rinpočeho *Slova mého dokonalého učitele*, které hluboce pojednávají o pomíjivosti.\n\n4. **Nalezení učitele** – Pokud je to možné, najděte kvalifikovaného učitele v linii Kagju, který vás může vést v praxi mahámudry.\n\n5. **Aplikaci v každodenním životě** – Používejte vědomí pomíjivosti k transformaci svých vztahů, práce a všech aktivit. Ptejte se: \"Pokud bych věděl, že zemřu za rok, jak bych žil? Za měsíc? Za týden?\"\n\n### Závěrečná slova\n\nMilarepa jednou řekl svým žákům: \"Moje náboženství je žít – a umřít – bez lítosti.\" Když skutečně pochopíme a přijmeme pomíjivost, můžeme žít plně, autenticky a bez lítosti. Každý okamžik se stává drahocenným darem, každé setkání posvátným, každý den příležitostí k probuzení.\n\nPomíjivost nás učí, že nic nemůžeme udržet, ale také že nic nemusíme nést věčně. Naše chyby, naše utrpení, naše omezení – to vše také pomíjí. V každém okamžiku máme novou příležitost začít znovu, s čerstvou myslí a otevřeným srdcem.\n\nJak učí současní mistři linie Kagju: \"Spočiňte v tom, co se nemění – v přirozené mysli – zatímco všechno ostatní přichází a odchází jako vlny v oceánu.\" Toto je pozvání k hlubokému klidu uprostřed neustálé změny, k nalezení toho, co je věčné v srdci pomíjivosti.\n\nNakonec, jak říká Džigme Rinpočhe: \"Praktická rada: vzpomenout si na pomíjivost každý den → promění to způsob, jak žijeme, jak milujeme, jak praktikujeme.\" Není to jen filozofie nebo teorie – je to živá praxe, která může transformovat každý aspekt našeho života.\n\nAť vám toto učení o pomíjivosti přinese hluboký klid, jasnost a inspiraci k praxi. Ať realizujete pravou povahu mysli, která je za všemi změnami, a ať tato realizace přinese prospěch všem cítícím bytostem.\n\n*Sarva mangalam* – Ať je vše příznivé!\n\n---\n\n*Tato přednáška byla připravena na základě tradičních učení linie Karma Kagju tibetského buddhismu. Pro hlubší studium jsou doporučeny původní texty a osobní vedení kvalifikovaného učitele.*",
  "tags": [
    "budhismus"
  ],
  "category": "BU",
  "metadata": {
    "readingTime": "20 min"
  },
  "id": "article-1758915461515",
  "date": "2025-09-26",
  "filename": "articles/article-1758915461515.json",
  "title.en": "Transience",
  "description.en": "Transience from the perspective of Tibetan Buddhism of the Karma Kagyu lineage",
  "tags.en": [
    "buddhismus"
  ],
  "markdown.en": "# Transience from the Perspective of Tibetan Buddhism of the Karma Kagyu Lineage\n\n## 1. Introduction\n\nWelcome to today's lecture on transience, one of the most fundamental teachings of Buddhism. In Tibetan, transience is called *mi tag pa* (Xr\u000bbB\u000bT\u000b), which literally means \"that which is not permanent.\" This teaching is not merely a philosophical concept, but a living practice that can fundamentally transform our way of life.\n\nIn the Karma Kagyu lineage, one of the four main schools of Tibetan Buddhism, extraordinary emphasis is placed on the direct experience of transience through meditation. It's not just about intellectual understanding, but about deeply experiencing this truth in every moment of our lives. As Buddha Shakyamuni himself taught more than 2500 years ago: \"All conditioned things are born, change, and perish.\" This simple statement contains the key to liberation from suffering.\n\nThe Kagyu lineage, known as the \"lineage of oral transmission,\" was established in Tibet in the 11th century. Its founders \u0013 Marpa, Milarepa, and Gampopa \u0013 all deeply experienced the truth of transience in their lives. Marpa lost his son, Milarepa witnessed the death of his family, Gampopa lost his wife and children during an epidemic. It was precisely these experiences that led them to deep spiritual seeking and ultimately to the realization of the true nature of mind, which lies beyond all changes.\n\n## 2. The Three Marks of Existence (*mtshan nyid gsum*)\n\nBuddha identified three fundamental characteristics of all conditioned existence, which we call in Tibetan *mtshan nyid gsum* (XZS\u000bIrQ\u000bBftX\u000b). These three marks are:\n\n**Transience (*mi tag pa*)** \u0013 Nothing in the conditioned world is permanent. From the smallest atom to the largest galaxies, everything is in constant motion and change. Our bodies age, thoughts come and go, relationships change, civilizations rise and fall. This transience is not a flaw or imperfection of the world \u0013 it is its natural nature.\n\n**Suffering or dissatisfaction (*sdug bsngal* \u0013 QtA\u000bVfc\u000b)** \u0013 Because everything changes, we cannot find permanent satisfaction in anything conditioned. Even the most beautiful moments pass, the strongest joy fades away. This doesn't mean life is only suffering, but that no conditioned state can provide lasting fulfillment.\n\n**Absence of a permanent self (*bdag med* \u0013 VQB\u000bXzQ\u000b)** \u0013 There exists no fixed, unchanging self or soul. What we consider to be \"I\" is just a stream of constantly changing bodily and mental processes. This teaching of non-self is Buddhism's unique contribution.\n\nTransience is often described as the gateway to understanding the remaining two characteristics. When we truly see and experience the transience of all things, we naturally understand why attachment brings suffering and why there exists no fixed self to cling to. As Gampopa said: \"Understanding transience is the beginning of all realizations.\"\n\n## 3. The Four Thoughts (*blo ldog rnam bzhi*)\n\nIn the Kagyu tradition, we practice \"the four thoughts that turn the mind to dharma\" (*lo dok nam ~i* \u0013 V³|\u000bc¡|B\u000bb£X\u000bV^r\u000b). These four reminders are considered the foundation of all spiritual practice and help us make clear decisions in life.\n\n### First Reminder: Precious Human Birth\n\nTo be born as a human with the opportunity to practice dharma is rarer than a blind turtle sticking its head through the hole of a yoke floating on an infinite ocean once every hundred years \u0013 so goes the traditional comparison. We have an incredible opportunity: we are endowed with intelligence, the ability to distinguish between beneficial and harmful, and we have access to teachings. This precious human body is our vehicle to enlightenment.\n\n### Second Reminder: Transience and Death\n\nAs the traditional text you use in meditation says: \"The outer world and beings are transient. Especially the lifespan of a being resembles an air bubble on water. It is uncertain when I will die. At the moment of death, I will become a corpse. Since then only Buddha's teachings are useful, I should actively practice them.\"\n\nDeath is the only certainty in life. We don't know when it will come \u0013 it could be in fifty years, in a year, tomorrow, or even today. Tibetan tradition teaches that there are countless causes of death, but only a few things that support life. Our body is as fragile as a bubble \u0013 a small illness, accident, or simply the exhaustion of life force is enough, and this precious life ends. Jigme Rinpoche emphasizes in his book: \"Due to transience, we cannot postpone practice indefinitely. Time doesn't stop for any of us.\"\n\n### Third Reminder: Karma \u0013 The Law of Cause and Effect\n\nOur actions leave traces (*bag chags* \u0013 VB\u000bFBf\u000b) in the stream of our mind. Every thought, every word, every deed creates an imprint that will ripen into future experience. Beneficial actions lead to happiness, harmful ones to suffering. This law functions infallibly like a natural law \u0013 it's not punishment or reward from some external force, but the natural consequence of our actions.\n\n### Fourth Reminder: The Dissatisfaction of Samsara (Consequences of Karma)\n\nNo state in cyclic existence is permanently satisfying. Even gods in heavenly realms eventually exhaust their good karma and fall into lower states. Wealth can turn into poverty, health into illness, fame into disgrace. As Gampopa teaches in the *Jewel Ornament of Liberation*: \"Samsara means cyclic existence. It is existence entangled in endless cycles of birth, aging, and death.\"\n\nJigme Rinpoche explains the significance of regularly contemplating these four thoughts: \"We think about how transience functions in our daily experiences. We are aware of it and in relation to it we have no fear, it doesn't surprise us, nor do we need to make excuses because of it. We accept it as a normal part of life.\"\n\n## 4. Deeper Insight: Mahamudra and the Nature of Mind\n\nIn the teaching of mahamudra (*phyag rgya chen po* \u0013 U±B\u000bb±\u000bFzS\u000bT|\u000b), which is the heart of Kagyu lineage practice, transience is understood at a much deeper level. It's not just that things perish \u0013 it's about understanding the very nature of reality as a continuous stream of moments without any solid substance.\n\n### Mind as Sky\n\nIn mahamudra, we use the classic metaphor: thoughts, emotions, and perceptions are like clouds in the sky. Clouds appear, change shape, move, and eventually dissolve. But the sky itself \u0013 clear, spacious, unaffected \u0013 remains. This sky is our true nature of mind (*sem nyid* \u0013 fzXf\u000bIrQ\u000b), which lies beyond all changes.\n\nWhen we sit in meditation and observe our mind, we see an endless stream of thoughts and feelings. One thought arises, lasts for a brief moment, and then disappears to make room for the next. This process never ends. But that which notices these changes \u0013 awareness itself \u0013 is constant and unchanging.\n\n### Unity of Emptiness and Manifestation\n\nAll phenomena are simultaneously empty (*stong pa* \u0013 f|D\u000bT\u000b) of their own essence and yet vividly manifest. This paradoxical unity of emptiness and manifestation is the heart of mahamudra. It is precisely because things have no solid essence that they can change and manifest. If they had a permanent, unchanging essence, no change would be possible.\n\nMilarepa, the greatest yogi of the Kagyu lineage, sang: \"All phenomena are like a rainbow \u0013 they clearly appear, but when you examine them, you find nothing solid.\" He spent his entire life meditating in caves of the Tibetan mountains with deep awareness that each moment could be his last. This awareness of transience did not lead to depression or nihilism, but to immense joy and freedom. In his songs, he often expressed how the transience of all things reveals their true beauty.\n\n### Practice of Mahamudra\n\nIn mahamudra practice, we learn to rest in natural mind (*tha mal gyi shes pa* \u0013 P\u000bXc\u000bB±r\u000bdzf\u000bT\u000b). We don't try to stop thoughts or maintain them \u0013 we simply let them naturally arise and cease like waves in the ocean. Gradually we recognize that the very transience of thoughts and phenomena points to what lies beyond them \u0013 to the unchanging, clear, and spacious nature of mind.\n\n## 5. Practical Implications of Understanding Transience\n\nUnderstanding transience is not just a philosophical matter \u0013 it has profound practical consequences for our daily life.\n\n### Accepting Death as Natural Transition\n\nIn Tibetan tradition, death is not perceived as a tragedy, but as a natural transition. Jigme Rinpoche explains: \"The transition from the current life to the next life is a natural and automatic process. The period between them is known as bardo. The mind in bardo will take a new birth.\"\n\nWhen we truly accept the reality of death, paradoxically it liberates our life. We stop living in denial and fear. We can prepare for death through practice, especially through powa meditation (*'pho ba* \u0013 `U|\u000bV\u000b), consciousness transference at the moment of death. This preparation gives us confidence and peace in the face of the inevitable.\n\n### Release of Attachment\n\nWhen we know that everything we love will one day be lost, we can learn to love without attachment. This doesn't mean we become indifferent or cold. On the contrary \u0013 love without attachment is purer and stronger. It is love that gives freedom, not love that binds and restricts.\n\nGampopa taught: \"All samsara is like yesterday's dream.\" When we wake up from a dream, all the joys and sorrows of the dream disappear. Similarly, everything we care so much about in this life will one day vanish like morning dew. This frees us from excessive attachment to temporary things.\n\n### Appreciation of the Present Moment\n\nParadoxically, when we truly understand transience, every moment becomes precious. A traditional Tibetan comparison says: \"Life is like a dewdrop on a blade of grass \u0013 beautiful, but it will soon disappear.\" It is precisely because the dew will soon vanish that it is so beautiful. Every sunrise, every sunset, every meeting with a friend could be the last. This awareness gives life depth and intensity.\n\nIn practice, this means being fully present. When we eat, we truly eat. When we speak with a friend, we are completely there. When we meditate, we are fully in meditation. Transience teaches us not to waste time on trivialities and to fully experience what is before us.\n\n### Inspiration for Immediate Practice\n\nJigme Rinpoche emphasizes the urgency of practice: \"We must try to gain greater clarity of mind while we are here. This will help us in bardo, the time period after we leave this life, and before we are reborn again.\"\n\nMany practitioners postpone serious practice for \"later\" \u0013 when they have more time, when they solve their problems, when they retire. But understanding transience shows us that \"later\" may never come. The only time we have is now. Every day we waste is a day that will never return.\n\n## 6. Examples and Images from the Tradition\n\nThe Kagyu lineage is rich with examples of masters who deeply understood and lived the truth of transience.\n\n### Marpa the Translator\n\nMarpa (1012-1097) was a lay practitioner who had a family and possessions. When his beloved son Darma Dodé died tragically, Marpa experienced enormous pain. But this experience led him to an even deeper understanding of dharma. He taught that it is precisely through fully experiencing the pain of loss that we can realize the true nature of mind, which lies beyond all losses and gains.\n\n### Milarepa, Yogi of the Mountains\n\nMilarepa (1040-1123) is perhaps the most famous figure in Tibetan Buddhism. After causing the death of many people with black magic in his youth, he deeply regretted it and sought purification. His teacher Marpa gave him incredibly difficult tasks, including building and tearing down stone towers. Milarepa understood that just like these towers, our life is also a temporary construction.\n\nAfter years of hard practice, he attained enlightenment and spent the rest of his life meditating in caves. He sang: \"In the cave on the mountain I sit alone, but I am not lonely \u0013 my companion is the transience of all things.\" His songs often express joy from understanding transience: \"When I see how everything passes away, my heart dances like a child.\"\n\n### Gampopa, the Monk-Doctor\n\nGampopa (1079-1153) was originally a doctor with a wife and children. When his family died during an epidemic, he was devastated. But this tragedy led him to dharma. He became a monk and later a student of Milarepa. In his work *Jewel Ornament of Liberation*, he systematically explained the path to enlightenment, beginning precisely with understanding transience.\n\nGampopa taught: \"Being aware means being conscious, alert. This means we must be aware of our thoughts, speech, and actions as much as we can and regularly.\" This awareness of transience must become our second nature, not something we only know intellectually.\n\n### Traditional Images and Comparisons\n\nThe Tibetan tradition uses many beautiful comparisons for transience:\n\n- **Bubble on water** \u0013 appears, lasts for a while, and then bursts. Such is our life.\n- **Lightning in the night** \u0013 illuminates the darkness for a moment and then disappears. Such are our moments of happiness.\n- **Morning dew** \u0013 sparkles in the first rays of sun, but as soon as the sun rises higher, it evaporates.\n- **Dream** \u0013 may seem very real, but upon awakening we find it was just a play of mind.\n- **Theater performance** \u0013 actors play their roles, but when the curtain falls, everything ends.\n- **Echo in the mountains** \u0013 seems real, but it's just a reflection of sound, without its own substance.\n\n## 7. Integrating Transience into Daily Life\n\nHow can we practically integrate understanding of transience into our daily life? Jigme Rinpoche offers valuable advice: \"Although we already know about transience, we don't take it for granted. We try to slowly get used to this view, so it becomes a habit of mind, a tendency of mind, in Tibetan *bag chags*.\"\n\n### Morning Reminder\n\nEvery morning when we wake up, we can remind ourselves: \"I have awakened. Many beings died yesterday and will not wake up again. I have another day of life \u0013 how will I use it?\" This simple reminder sets the tone for the entire day.\n\n### Evening Reflection\n\nIn the evening before sleep, we can reflect: \"Another day of my life has ended and will never return. Did I use it meaningfully? What did I learn? How did I help others?\" And then: \"Maybe I won't wake up in the morning. Am I prepared?\"\n\n### Meditation on Transience\n\nDuring formal meditation, we can observe transience directly:\n- We follow the breath \u0013 every inhalation and exhalation is unique and never repeats\n- We observe thoughts \u0013 they arise from emptiness and return to emptiness\n- We perceive bodily sensations \u0013 they constantly change, never remain the same\n\n### Reminders in Ordinary Situations\n\n- When we see a beautiful sunset, we realize that darkness will come soon\n- When we meet a friend, we know that one day we will say goodbye for the last time\n- When we gain something, we remember that we will one day lose it\n- When we lose something, we understand that this is the natural course of things\n\n### Transformation of Difficult Emotions\n\nWhen we experience anger, sadness, or fear, we can remind ourselves of their transience. These emotions are like clouds \u0013 they come, briefly cover the clear sky of mind, but eventually leave. We don't need to fight them or suppress them \u0013 it's enough to observe them with awareness of their temporariness.\n\n## 8. Obstacles to Understanding Transience\n\nOn the path to deep understanding of transience, we often encounter obstacles:\n\n### Intellectual Understanding Without Experience\n\nMany practitioners understand transience intellectually but lack deep experience. Jigme Rinpoche warns: \"We don't need to force ourselves to constantly seek transience. We just try to slowly get used to this view.\" It's a gradual process, not sudden understanding.\n\n### Fear of Death\n\nA natural reaction to realizing transience is fear. But this fear gradually disappears as our practice and understanding deepen. We realize that what we truly are \u0013 the nature of our mind \u0013 is beyond birth and death.\n\n### Nihilism and Depression\n\nSome people react to transience with nihilism: \"If everything passes away, nothing has meaning.\" This is an incorrect understanding. It is precisely because things pass away that they are precious. It is precisely because we have limited time that it matters how we use it.\n\n### Too Much Thinking\n\nParadoxically, too much intellectual thinking about transience can be an obstacle. We need balance between contemplation and direct experience in meditation.\n\n## 9. Transience as a Path to Enlightenment\n\nIn the Kagyu tradition, transience is not just a preliminary practice \u0013 it is the path itself. As the great 19th-century master Jamgön Kongtrul taught: \"Meditation on transience is the best of all meditations.\"\n\n### From Gross to Subtle Transience\n\nWe begin by observing gross transience \u0013 death, seasonal changes, aging. Gradually our perception becomes more refined and we see transience in every moment \u0013 every thought, every feeling, every perception arises and ceases in each moment.\n\n### Realization of Natural Mind\n\nWhen we truly see the transience of all phenomena, we naturally ask: \"What is it that perceives all these changes?\" This question leads us to the realization of natural mind (*rigpa* \u0013 brB\u000bT\u000b), which lies beyond all changes. This mind is like a mirror \u0013 it reflects all phenomena but itself remains unaffected.\n\n### Compassion Arising from Transience\n\nWhen we see that all beings are subject to transience \u0013 they are born, suffer, age, and die \u0013 compassion naturally arises. We realize that we are all in the same boat. This compassion is not sentimental but is based on deep understanding of reality.\n\nMasters of the Kagyu lineage teach developing *bodhicitta* (V±D\u000bFtV\u000b@±r\u000bfzXf\u000b) \u0013 the enlightened mind that wishes to attain enlightenment for the benefit of all beings. This motivation transforms our understanding of transience from something that might lead to depression into something that inspires us to practice for the good of all.\n\n## 10. Conclusion: Living with Awareness of Transience\n\nTransience is not a reason for fear or sadness \u0013 it is a reminder of the immense value of our life and the importance of spiritual practice. As Jigme Rinpoche says: \"In a certain way, transience also means continuity. Things don't remain the same, they constantly change, constantly evolve.\"\n\nIn the Kagyu lineage, emphasis is always on direct experience. It's not enough to just read or think about transience \u0013 we must see it, feel it, and live it every day. As the traditional text teaches: \"Since at the moment of death only Buddha's teachings are useful, I should actively practice them.\"\n\n### Practical Steps\n\nFor integrating this teaching into your life, I recommend:\n\n1. **Daily contemplation** \u0013 Spend at least 5 minutes daily thinking about transience. You can use the traditional four reminders or simply observe changes around you.\n\n2. **Regular meditation** \u0013 In meditation, directly observe the transience of thoughts, feelings, and perceptions. Start with 10-15 minutes daily and gradually extend.\n\n3. **Study of texts** \u0013 Read classical texts like Gampopa's *Jewel Ornament of Liberation* or Patrul Rinpoche's *Words of My Perfect Teacher*, which deeply discuss transience.\n\n4. **Finding a teacher** \u0013 If possible, find a qualified teacher in the Kagyu lineage who can guide you in mahamudra practice.\n\n5. **Application in daily life** \u0013 Use awareness of transience to transform your relationships, work, and all activities. Ask yourself: \"If I knew I would die in a year, how would I live? In a month? In a week?\"\n\n### Final Words\n\nMilarepa once told his students: \"My religion is to live \u0013 and die \u0013 without regret.\" When we truly understand and accept transience, we can live fully, authentically, and without regret. Every moment becomes a precious gift, every encounter sacred, every day an opportunity for awakening.\n\nTransience teaches us that we cannot hold onto anything, but also that we don't need to carry anything forever. Our mistakes, our suffering, our limitations \u0013 all of this also passes. In every moment we have a new opportunity to begin again, with a fresh mind and open heart.\n\nAs current masters of the Kagyu lineage teach: \"Rest in what doesn't change \u0013 in natural mind \u0013 while everything else comes and goes like waves in the ocean.\" This is an invitation to deep peace in the midst of constant change, to finding what is eternal in the heart of transience.\n\nFinally, as Jigme Rinpoche says: \"Practical advice: remember transience every day  it will transform the way we live, how we love, how we practice.\" It's not just philosophy or theory \u0013 it's a living practice that can transform every aspect of our life.\n\nMay this teaching on transience bring you deep peace, clarity, and inspiration for practice. May you realize the true nature of mind that lies beyond all changes, and may this realization bring benefit to all sentient beings.\n\n*Sarva mangalam* \u0013 May all be auspicious!\n\n---\n\n*This lecture was prepared based on traditional teachings of the Karma Kagyu lineage of Tibetan Buddhism. For deeper study, original texts and personal guidance from a qualified teacher are recommended.*"
}