{
  "title": "Karma",
  "description": "Zákon příčiny a následku v buddhistické praxi",
  "markdown": "# Karma: Zákon příčiny a následku v buddhistické praxi\n\n## Úvod: Pochopení karmy jako cesty k osvobození\n\nKarma představuje **jeden z nejzásadnějších principů buddhismu**, bez jehož pochopení nemůžeme skutečně porozumět cestě k osvobození. Třetí ze čtyř myšlenek, které odvracejí mysl od samsáry, nás učí, že každý čin má své následky a že my sami jsme tvůrci vlastního osudu. Jak učil Buddha: „Jsme dědici svých činů, naše karma je lůno, ze kterého jsme zrozeni.\"\n\nV tibetském buddhismu je karma vysvětlována neobyčejně praktickým způsobem. Nejde o složitou filosofii, ale o každodenní realitu, se kterou můžeme pracovat. **Karma znamená příčinu a následek, akci a výsledek**. Je to zcela přírodní zákon – když jednáme pozitivně, výsledek bude dobrý; když jednáme škodlivě, výsledek nebude dobrý. Karma povstává z naší mysli, z naší řeči a z našich činů.\n\nTato přednáška vás provede komplexním pochopením karmy od základních definic přes mechanismy jejího působení až po praktické metody, jak s karmou pracovat v denním životě a nakonec se od ní osvobodit.\n\n## Co je karma? Základní buddhistické pojetí\n\n### Etymologie a základní definice\n\nSlovo **karma** (sanskrt: कर्म) nebo **kamma** (pálí) doslova znamená „akce\" nebo „čin\". Buddha však přinesl revoluční pochopení – **karma není samotný fyzický čin, ale především ÚMYSL** (cetanā), který za ním stojí. V Anguttara Nikáya Buddha říká: „Úmysl, mnichové, nazývám karmou. Maje úmysl, člověk jedná karmicky tělem, řečí a myslí.\"\n\nTento psychologický posun od pouhé akce k intenci představoval převratnou změnu oproti brahmanskému pojetí. Karma již nebyla spojena s kastou nebo vnějším rituálem, ale se **stavem mysli**. Každý člověk tak má rovnou možnost k osvobození bez ohledu na své zrození.\n\n### Karma jako tok mysli\n\nPodle tibetského buddhismu: „Buddha nám řekl, že je to mysl, která se reinkarnuje. Každá lidská bytost má mysl, tělo a jméno. Mysl se identifikuje s tělem a jménem a myslí si, že existuje já – ‚Jsem ten a ten.' Dharma vysvětluje, že právě kvůli našim názykovým tendencím cítíme, že existuje ‚já'.\"\n\n**Mysl není pevná substance**, ale proud energie připodobněný k vzduchu – bez formy, ale s kapacitou nést různé obsahy. Tento proud pokračuje z jednoho života do druhého a právě **karma určuje, kam tento proud poplyne**.\n\n### Dva aspekty mysli\n\nV tibetském buddhismu se učí, že mysl funguje ve dvou aspektech:\n- **Jäšä** (yeshe) – moudrost, úplná jasnost\n- **Ňurmon** (nyurmon) – rozptýlení, matění\n\nNaše mysl může fungovat buď skrze moudrost, nebo skrze rozptýlené vlivy negativních emocí. Karma je výsledkem toho, z kterého aspektu jednáme.\n\n## Zákon příčiny a následku: Jak karma funguje\n\n### Základní princip\n\nBuddhistický zákon karmy říká: „**Když toto je, tamto je. Ze vzniku tohoto vzchází tamto. Když toto není, tamto není. Ze zastavení tohoto přestává tamto.**\" (Samyutta Nikáya) Tento princip se nazývá **pratítjasamutpáda** (vzájemně závislý vznik) a představuje jádro buddhistického chápání příčinnosti.\n\nJak Buddha učil: „Jak zasadíš semeno, takovou sklidíš plodinu.\" Činy motivované chamtivostí, nenávistí nebo nevědomostí zasévají semena utrpení. Činy motivované štědrostí, láskou nebo moudrostí vytvářejí podmínky pro štěstí.\n\n### Nepředurčenost karmy\n\n**Karma není fatalismus ani osud.** Toto je zásadně důležité pochopit. Thanissaro Bhikkhu zdůrazňuje: „Raně buddhistická karma NENÍ fatalistická. Není nevysvětlitelnou, neměnnou silou. Naopak zdůrazňuje osvobozující potenciál toho, co mysl dělá v každém okamžiku.\"\n\nV tibetském učení se používá krásná metafora **smíchaného písku**: „Karma může být negativní nebo pozitivní. Například pokud máte písek ve dvou barvách – bílý a černý – když je smícháte dohromady, máte šedou. Odstín šedé, tmavší či světlejší, závisí na množství černého nebo bílého v směsi. Je-li více černého písku, směs je tmavší. Přidáte-li bílý písek, odstín šedé se rozjasní.\"\n\n**Praktický závěr:** I když máte minulou negativní karmu, pokud budete jednat pozitivněji, pozitivní karma se stane silnější. Tímto způsobem říkáme, že **negativní karma může být změněna přirozeně prostřednictvím našich běžných pozitivních činů**.\n\n### Tři časové rámce dozrávání karmy\n\nKarmické výsledky se projevují ve třech časových úrovních:\n1. **Okamžité** – prožívané v přítomném okamžiku\n2. **Pozdější** – během tohoto života\n3. **Budoucí** – v následujících životech\n\n## Tři typy karmy: Kušála, akušála a neutrální\n\n### 1. Kušála karma – Prospěšná, obratná karma\n\n**Etymologie:** Z „ku\" (kilesa/zla) + „sala\" (zbavit se). Kušála znamená doslova „zbavování se zel\".\n\n**Tři kořeny kušála karmy:**\n- **Alobha** – nečhamtivost, štědrost\n- **Adósa** – nenávist, laskavost\n- **Amóha** – neomyl, moudrost\n\n**Deset prospěšných činů (dasa kušála kamma):**\n\n*Tělem (3):*\n1. Zdržování se zabíjení živých bytostí\n2. Zdržování se krádeže\n3. Zdržování se sexuálního pochybení\n\n*Řečí (4):*\n4. Zdržování se lži\n5. Zdržování se rozdvojující řeči\n6. Zdržování se hrubé řeči\n7. Zdržování se prázdného tlachání\n\n*Myslí (3):*\n8. Nezávistivost\n9. Nezlomyslnost (dobrá vůle)\n10. Správný pohled (sammā-diṭṭhi)\n\n**Účinky kušála karmy:** Snižuje znečištění mysli, vede k osvobození a výsledkem je znovuzrození v příznivých oblastech (lidé, dévové, brahmové).\n\n### 2. Akušála karma – Neprospěšná, neobratná karma\n\n**Tři kořeny akušála karmy (tři jedy mysli):**\n- **Lobha** – chamtivost, touha\n- **Dósa** – nenávist, odpor\n- **Móha** – nevědomost, omyl\n\n**Deset neprospěšných činů (dasa akušála kamma):**\n\n*Tělem (3):*\n1. Zabíjení\n2. Krádež\n3. Sexuální pochybení\n\n*Řečí (4):*\n4. Lhaní\n5. Rozdvojující řeč\n6. Hrubá řeč\n7. Prázdné tlachání\n\n*Myslí (3):*\n8. Závistivost\n9. Zlomyslnost\n10. Nesprávný pohled\n\n**Účinky akušála karmy:** Posiluje znečištění, vytváří energii živící proces znovuzrození a vede k znovuzrození v nižších oblastech (pekla, hladoví duchové, zvířata).\n\n**Nejzávažnější negativní karma:** Pět ánantarika kamma (činy s okamžitým výsledkem vedoucím do pekla): vražda matky, vražda otce, vražda arhata, způsobení Buddhova krvácení se zlým úmyslem, vytvoření rozkolu v sangze.\n\n### 3. Neutrální karma (avjákrta)\n\n**Definice:** „Neurčitá\" – karma, která není ani prospěšná, ani neprospěšná; karmicky neutrální nebo amorální stavy.\n\n**Dva typy:**\n1. **Karmicky neutrální mentální stavy** – stavy bez etické intence, funkční vědomí (kirija-čitta). Například činy arhata nemají karmickou sílu.\n2. **Akce bez morálního úmyslu** – neúmyslné akce bez pozorovatelného karmického účinku, jako čištění zubů nebo nevědomá chůze.\n\nRingu Tulku vysvětluje: „Když je naše motivace lhostejná a naše činy ani škodlivé, ani prospěšné, je to neutrální akce.\"\n\n## Návykové tendence: Síla, která udržuje karmu v pohybu\n\n### Podstata návykových tendencí\n\nV buddhistickém učení se říká: „**Právě kvůli našim názykovým tendencím cítíme, že existuje ‚já'.** Někteří realizovaní učitelé popisovali mysl jako energii, jako vzduch, zcela bez formy.\"\n\n**Návykové tendence (vásaná)** jsou latentní vzorce myšlení, řeči nebo jednání, které jsou vtisknuty do proudu mysli. Termín se často překládá jako „napuštění\", což naznačuje, že **myšlenky a činy „napustí\" mysl svou esencí**.\n\n### Jak vznikají návykové tendence\n\nKdyž provedeme akci motivovanou chamtivostí nebo jinými mentálními stavy, **zasadí to „semeno\" do série jevů, které tvoří naši mysl**. Podle učence Ruperta Gethina: „Takové semeno není věc sama o sobě, ale pouze modifikace nebo ‚napuštění' následného toku dharem vyplývající z akce. Časem tato modifikace dozrává a vydává konkrétní výsledek.\"\n\n### Návykové tendence v meditaci\n\nPodle učení tibetského buddhismu: „Obecně meditovat znamená prostě sedět. Nenecháváme mysl putovat za myšlenkami. Chceme ‚být v přítomnosti'... **Všechny mentální tendence nebo vzorce se objeví jako putující myšlenky.**\"\n\nPrávě proto je meditace tak důležitá – umožňuje nám **vidět naše návykové vzorce v akci** a postupně je měnit. Když neustále cvičíme všímavost a soucit, tyto kvality se stávají názykovými, automatickými.\n\n### Praktický princip\n\n„Podobně jako si ráno dáváme snídani... Je to normální a automatické. **Pokud byste mohli cvičit meditaci jako každodenní věc, něco, co prostě a automaticky děláte, pak se to stane velmi snadné.**\" Tímto způsobem vytváříme **pozitivní návykové tendence**, které nás vedou k osvobození místo k dalšímu utrpení.\n\n## Tři zatemnění: Kořeny negativní karmy\n\n### Základní zatemnění mysli\n\nKaždý má v mysli **silná zatemnění** (ávarana), přičemž hlavními rušivými emocemi jsou:\n\n1. **Ulpívání** (rága) – připoutanost, touha\n2. **Hněv** (dóša) – nenávist, odpor\n3. **Nevědomost** (móha) – omyl, neznalost\n\nPodle učení: „Na jejich základě v naší mysli vzniká velký počet dalších rušivých emocí.\"\n\n### Nevědomost jako základní zatemnění\n\n„Buddha nás seznámil se základním stavem **nevědomosti, nebo marigpa** v tibetštině. Vysvětlil, že jsme vždy v marigpa, což znamená, že **nevidíme správně**. Nevědomost, nebo marigpa, neznamená hloupý. Znamená to, že i když můžete být chytrý a máte moudrost, přesto **nevidíte svou moudrost**. Nevidíte jasně, a proto můžete jednat nesprávně.\"\n\n### Jak zatemnění zakalují mysl\n\n„Rušivé emoce jsou připoutanost, pýcha, žárlivost, nenávist, očekávání a hněv. **Jsou vaší vlastní myslí.** Když si jich jste vědomi, uvidíte, jak vás takové emoce rozrušují a podmínky, které způsobují jejich vznik. Poznáte, že vám přinášejí velké obtíže – zkrátka utrpení.\"\n\n### Zatemnění jako závoje\n\n„Bez překážek, které zakrývají naše vidění jako závoje ve formě vizí a pocitů, pak můžeme proniknout k **skutečnému významu**, který již známe – k mnoha teoriím a učením.\"\n\nPrakticky to znamená: **Když jsou zatemnění aktivní, nemůžeme vidět realitu takovou, jaká je.** Vidíme ji přes filtr svých tužeb, odporu a neznalosti. Meditation pomáhá tyto závoje odhalit a nakonec odstranit.\n\n## Karmické stopy a jejich dozrávání\n\n### Vásaná a bídža: Karmické otisky a semena\n\n**Vásaná** označuje **latentní energii vyplývající z činů**, o níž se říká, že se „vtiskne\" do **álaja-vidžňány** (zásobnicové vědomí). Tyto návykové tendence jsou příčinně účinné předpoklady vtisknuté do proudu mysli jakoukoliv ctnostnou, nectnostnou či neutrální aktivitou těla, řeči nebo mysli. **Mohou se přenášet z jednoho života do druhého.**\n\n**Bídža** doslova znamená „semeno\" a slouží jako metafora pro původ nebo příčinu věcí. Když provedeme akci motivovanou chamtivostí, **zasadí to semeno do série jevů, které tvoří naši mysl**. Takové semeno není věc sama o sobě, ale modifikace následného toku vědomí.\n\n### Tři typy vásaná (podle Čcheng wej-š lun)\n\n1. **Jazyková a konceptuální vásaná** – latentní jazykové podmiňování z termínů a slov\n2. **Vásaná připoutání k já** – falešná připoutanost k semenům „já\" a „moje\" (átma-gráha)\n3. **Bhávanga-vásaná** – karmická semena přenášející se z jednoho proudu bytí do jiného, způsobující znovuzrození ve Třech světech\n\n### Álaja-vidžňána: Zásobnicové vědomí\n\n**Álaja-vidžňána** je osmé vědomí v modelu školy Jogáčára. Slouží jako fundamentální „zásobárna\", kde jsou **všechna karmická semena uložena a skladována, dokud nedozrají**.\n\nThrangu Rinpočhe vysvětluje: „Osmé vědomí se nazývá álaja vidžňána neboli všezákladové vědomí. Je tak nazvané, protože **je základem nebo půdou pro vznik všech ostatních typů vědomí**. Je to ta fundamentální jasnost vědomí neboli kognitivní jasnost, která zde byla od počátku.\"\n\n**Dva aspekty álaja-vidžňány:**\n1. **Aspekt semene** – ukládání nebo zaznamenávání všech návykových vzorců\n2. **Aspekt dozrávání** – poznávání všeho, co se děje v okamžiku ve vědomí\n\n### Proces karmického dozrávání (vipáka)\n\n**Vipáka** doslova znamená „dozrávání\" nebo „zrání\". Odkazuje na proces, kterým **karmická semena uložená v álaja-vidžňáně postupně dozrávají**, dokud se neprojeví jako karmické následky.\n\nPeter Harvey vysvětluje: „Karma je často přirovnávána k semeni a dvě slova pro karmický výsledek, vipáka a phala, znamenají ‚dozrávání' a ‚plod'. **Akce je tedy jako semeno, které dříve či později, jako součást svého přirozeného procesu zrání, vyústí v určité plody připadající konající osobě.**\"\n\n### Okamžité versus oddálené výsledky\n\n**Okamžité výsledky** se projevují u tří kategorií činů:\n1. **Činy s extrémně silnou emocí** – akce provedené s hluboce pociťovaným soucitem nebo intenzivní nenávistí\n2. **Činy týkající se důležitých objektů** – akce směřované k rodičům, učitelům nebo posvátným objektům nesou mnohem větší karmickou váhu\n3. **Opakovaně prováděné akce** – činy opakované znovu a znovu se stávají hluboce zakořeněnými návyky\n\n**Oddálené výsledky:** Většina karmických činů přináší výsledky v budoucích životech. Semena zůstávají latentní v álaja-vidžňáně, dokud nevzniknou vhodné podmínky pro jejich dozrání.\n\n### Čtyři typy karmických výsledků\n\n**1. Dozrálé výsledky (vipáka-phala):**\n- Typ těla, které získáme (člověk, zvíře, bůh atd.)\n- Naše vědomí a jeho kvality\n- Pocity štěstí a neštěstí\n\n**2. Výsledky podobné příčině v chování (nisyanda-phala):**\n- Návykové tendence opakovat podobné akce\n- Pokud jsme v minulém životě zabíjeli, máme přirozený sklon k zabíjení\n- Pokud jsme cvičili štědrost, přirozeně cítíme sklon ke štědrým činům\n\n**3. Výsledky podobné příčině ve zkušenosti:**\n- Zažíváme situace, kdy se nám děje něco podobného našim předchozím činům\n- Pokud jsme někoho zranili, zažíváme zranění od téže bytosti v budoucím životě\n\n**4. Environmentální/vládnoucí výsledky (adhipati-phala):**\n- Určují typ prostředí, společnosti a vnějších okolností\n- Zrození v bohaté či chudé zemi\n- Život v mírumilovné nebo válkou rozervané oblasti\n\n## Karma a znovuzrození: Cesta skrze šest oblastí\n\n### Podstata samsáry\n\n**Samsára** je **bezpočátečný cyklus opakovaného zrození, pozemské existence a opětovného umírání**. Je charakterizována utrpením (dukkha) a udržována nevědomostí (avidja), touhou (tršná) a nenávistí (dvéša), které řídí karmu.\n\nJak Buddha učil: „Pohyb bytostí mezi zrozeními není náhodný proces, ale je **uspořádán a řízen zákonem karmy**, principem, že bytosti se znovu rodí podle povahy a kvality svých minulých činů.\"\n\n### Šest oblastí existence\n\n**Tři vyšší oblasti:**\n\n**1. Oblast bohů (déva):**\nBytosti prožívají dlouhé životy plné požitku, nadpřirozených sil a obrovského bohatství. To je však nepermanentní – jakmile je dobrá karma vyčerpána, bytosti spadají do nižších oblastí. Nebezpečí spočívá v tom, že bohové se stávají samolibými a zapomínají cvičit dharmu.\n\n**2. Oblast polobohů (asura):**\nSilné, mocné bytosti pohlcené žárlivostí a touhou být lepší než ostatní. Neustále bojují s bohy, jejichž postavení závidí. Asurové jsou poznamenáni pýchou, paranoiou a soutěživou agresí.\n\n**3. Lidská oblast:**\n**Nejcennější oblast**, protože nabízí dokonalou rovnováhu mezi utrpením a potěšením, což umožňuje reflexi a praxi dharmy. Pouze v lidské oblasti mohou bytosti účinně praktikovat cestu k osvobození.\n\n**Tři nižší oblasti:**\n\n**4. Zvířecí oblast:**\nBytosti jsou řízeny instinktem, žijí v nevědomosti a hlouposti. Zažívají predaci, domestikaci a postrádají kapacitu pro duchovní praxi.\n\n**5. Oblast hladových duchů (préta):**\nBytosti trpí nenasytnou touhou a žádostivostí. Jsou zobrazovány s obrovskými břichy a maličkými hrdly, neschopné nasytit svůj hlad a žízeň.\n\n**6. Oblast pekel (naraka):**\nBytosti snášejí nepředstavitelné utrpení – oheň, led, rozřezávání na kusy a intenzivní mentální úzkost. Mistři učí: „Největší utrpení v pekle není fyzická bolest, ale mentální lítost a sebetrýzňující trest.\"\n\n### Mechanismus karmického znovuzrození\n\nHnací silou za znovuzrozením je **karma kombinovaná se třemi kořenovými jedy** (chamtivost, nenávist, nevědomost). \n\n**Deset neprospěšných činů vedoucích do nižších oblastí:**\n- Tři tělesné: zabíjení, krádež, sexuální pochybení\n- Čtyři slovní: lhaní, rozdvojující řeč, hrubá řeč, prázdné tlachání\n- Tři mentální: závistivost, zlomyslnost, nesprávné pohledy\n\n**Prospěšné akce vedoucí do vyšších oblastí:**\n- Štědrost, etické chování, meditace\n- Kultivace laskavosti, soucitu a moudrosti\n- Následování Pěti slibů a Deseti ctnostných činů\n\n### Bardo: Mezistav a karmická propulze\n\n**Bardo** (tibetsky: bar do) doslova znamená „mezera\" nebo „mezistav\". Nejběžněji se vztahuje na stav mezi smrtí a znovuzrozením.\n\n**Tři bardy smrti:**\n\n**1. Bolestné bardo umírání (či-kha'i bardo):**\nZačíná, když smrt je nevyhnutelná, a pokračuje, dokud „vnitřní dýchání\" nepřestane. Vědomí se odděluje od těla a prvky se rozpouštějí.\n\n**2. Zářivé bardo dharmatá (čönyi bardo):**\nPo smrti je povaha mysli obnažena – stejná pro každého, ale ne prožívaná stejným způsobem. Pro ty s hlubokou praxí představuje největší příležitost k osvobození.\n\n**3. Karmické bardo stávání se (sidpa bardo):**\nZde karma nejpříměji řídí znovuzrození. Obvykle trvá až 49 dní, ačkoliv období se liší. Bytost zažívá vize určené **zcela minulou karmou** – to, co buddhističtí učitelé popisují jako „větry karmy\", které odvívají vědomí.\n\n**Vstup do lůna:**\nPro lidské znovuzrození vědomí vidí své budoucí rodiče při milování. Podle učení:\n- Pro mužské zrození: agrese vůči otci, připoutanost k matce\n- Pro ženské zrození: agrese vůči matce, připoutanost k otci\n\nKdyž se vajíčko a spermie spojí, vědomí vstupuje a začíne nový život.\n\n## Praktické příklady karmy v denním životě\n\n### Vztahy a komunikace\n\n**Rozdvojující řeč:** Negativní mluvení o ostatních jejich přátelům vytváří karmu vedoucí k rozpadům vztahů a odchodu přátel.\n\n**Vykořisťování:** Brát/používat věci druhých bez dovolení vytváří karmu chudoby a zažívání krádeže.\n\n**Laskavost:** Jednání s opravdovým soucitem zasévá semena pro harmonické vztahy a podporu, když je potřebujeme.\n\n**Klíčový vhled:** Vaše karma nekontroluje reakce druhých (to je jejich karma), ale **vytváří váš nutkání vstoupit do situací, kde se vám dějí podobné věci**.\n\n### Řeč a její karmické účinky\n\nUčení vysvětluje: „**Jsme vždy nevědomě následující způsoby druhých, vzájemně se ovlivňující.** Takže pokud jednám neeticky při následování svých vlastních negativních emocí, nějak budou i jiní lidé jednat, jak jednám já.\"\n\n**Praxe pauzy:** Všimněte si prostoru mezi pocitem, že chcete něco říci, a nutkáním to skutečně říci. To umožňuje rozlišující všímavosti rozhodnout, zda mluvení pomůže nebo uškodí.\n\n### Mentální stavy a karmické důsledky\n\n**Mentální karma je reálná.** Funguje skrze tělo, řeč A mysl:\n- **Destruktivní:** kompulzivní starosti, plánování škody, zášť\n- **Konstruktivní:** plánování laskavosti, kontemplace moudrosti, kultivace soucitu\n- **Neutrální:** stává se karmickou, když je naplněna specifickou intencí\n\n**Karma jako nutkání:** Karma je **kompulzivní mentální faktor, který vás pohání k myšlení/mluvení/jednání** – NENÍ to akce sama, ale pohon za ní. Tato nutkání vznikají z návyků vybudovaných časem.\n\n### Transformace každodenních činností\n\nPodle učení: „**Cesta meditace vytváří výsledky, které můžeme používat neustále.** Jsem vždy dostupný, vždy přítomný, jak na emocionální, tak na fyzické úrovni... Díky tomu je mnohem snazší aplikovat soucit a být otevření vůči druhým.\"\n\n**Praktické metody:**\n- Naplňte neutrální akce všímavostí (chůze s vědomím, jedění s vděčností)\n- Cvičte všímavost vznikajících mentálních stavů před tím, než se stanou akcemi\n- Rozvíjejte vyrovnanost: „Někdy šťastný, někdy nešťastný – nic zvláštního\"\n\n## Lodžong: Trénink mysli a práce s karmou\n\n### Bodhičitta jako základ\n\nPodle učení: „Když jdeme přijímat dharmu nebo když praktikujeme dharmu, **neděláme to pouze ku prospěchu sebe samých**. Je přirozené, že dharmu zpočátku hledáme pro své vlastní dobro. Ale musíme zároveň začít se učit být znepokojeným i o ostatní bytosti.\"\n\n**Bodhičitta** – **probuzená mysl** – je otevřená a opravdová altruistická péče a zájem o druhé. Když praktikujeme motivování bodhičittou, naše praxe bude stále účinnější.\n\n### Čtyři nezměrné\n\nZákladní přání obsahující čtyři myšlenkové linie – základní přání pro každou bytost bez výjimky:\n1. **Kéž všechny bytosti dosáhnou štěstí a jeho příčiny**\n2. **Kéž jsou osvobozeny od utrpení a jeho příčiny**\n3. **Kéž nejsou odděleny od štěstí bez utrpení**\n4. **Kéž spočívají ve vyrovnanosti prosté připoutanosti a odporu**\n\n### Soucit a porozumění\n\n„Aplikujte mahájánovou myšlenku, že **musíme myslet na druhé – ne pouze výlučně na sebe**. Pokud můžeme spojit s touto myšlenkou, kdykoli cítíme negativitu, pak jsme skutečně dosáhli bodu obratu. Pochopíme fakt, že negativita neslouží žádnému dobru.\"\n\n**Praktický soucit:** „I v případě, kdy druhá osoba udělala chybu, **pochopíme, že je to kvůli její nevědomosti nebo jejímu nevidění**. Nebudeme se cítit tak zraněni... Je to tento druh pečujícího pocitu, který nám umožňuje sdílet a pomáhat těm, kdo nejednají zcela správně.\"\n\n### Využívání negativních zkušeností na cestě\n\nJakýkoli negativní čin nebo prožitek nás samotných nebo jiných lidí má také potenciál přivést nás na cestu bódhičitty, pokud dokážeme vidět a chápat, jak se vztahuje k fungování mysli. Kdykoli nás potká něco nepříjemného, není správné ztrácet kontrolu a jednat, jak se nám zlíbí. Místo toho se díváme do sebe a snažíme se pochopit, co se s námi děje. Využíváme tak situace, aby nám pomohla dosáhnout hlubšího porozumění.\n\n### Věnování zásluh druhým\n\nKdykoli máme dobré myšlenky, uděláme dobrý čin nebo dobrou praxi, můžeme ostatním bytostem věnovat všechny pozitivní výsledky, které jsme mohli vytvořit. To zmenšuje naše lpění na egu a mysl se více zaměřuje na ostatní. Užitek věnování je očividně dvojí. Prospíváme jak sobě, tak ostatním. Je to záměna postojů sebestřednosti za zájem o ostatní, tím se dostáváme blíž k vysvobození z ulpívání na já.\n\n## Vysvobození od lpění na egu\n\n### Pochopení iluze já\n\nBuddhistické učení zdůrazňuje základní pravdu: „**Mysl se identifikuje s tělem a jménem a myslí si, že existuje já – ‚Jsem ten a ten.'** Dharma vysvětluje, že právě kvůli našim názykovým tendencím cítíme, že existuje ‚já'.\"\n\n### Lpění na egu a utrpení\n\n„V důsledku toho **ztrácíme naši vyrovnanost a nemůžeme již nic dělat správně kvůli našemu lpění na já**. Samozřejmě si myslíme, že je to normální. Lpění je pro nás nyní normální. Avšak **mysl může být mnohem pohodlnější s menším utrpením v nepřítomnosti lpění**.\"\n\n### Proces pohledu dovnitř\n\n„Když se díváte do své mysli, je to velmi jednoduché. **Není co dělat. Prostě seďte.** Nejprve prostě sedíte bez dělání čehokoli. Pak čas od času pohleďte na svou vlastní povahu. Dívejte se na sebe.\"\n\n**Praktická instrukce:** „Prostě se pokuste dívat na já. Skutečně máte **mnoho schopností**. Pokud se opravdu pokusíte zaměřit, můžete porozumět všemu. Máte tento potenciál... **Je ve vás laskavost, soucit a láska. Jsou tam zcela přirozeně.**\"\n\n### Moudrost versus iluze\n\n„**Vše závisí na naší mysli.** Pokud si nejsme vědomi našeho vnitřního fungování a prostě následujeme podle toho, jak se cítíme, pak se říká, že jednáme **pod zmatkem**. Ale pokud jsme si vědomi a můžeme sami vidět, pak je **porozumění**. Porozumění nás povede správným směrem.\"\n\n### Postupné osvobození skrze praxi\n\n„Tento druh změny nelze dosáhnout za jeden nebo dva dny, jeden nebo dva měsíce. Je to docela obtížné. **Změna, o které zde mluvíme, přijde později, za jeden nebo dva roky.** Během této doby se změna děje jako pohyb hodin. Pohybuje se jen velmi mírně a stěží postřehnutelně.\"\n\n### Uvolnit lpění není tak snadné\n\nJedna věc, které jsme se už dříve dotkli, je lpění. Je to choulostivá záležitost. Kdykoli meditujeme, pozorujeme svou mysl nebo ji analyzujeme, je zde nějaké lpění. Snažíme se je pustit, ale je to těžké. Když se pokoušíme najít význam lpění, vidět objekt lpění, účinek lpění a tak dále a když začneme se zkoumáním, zjistíme, že zbavovat se lpění a stát se přirozeným je velice pomalý proces.\n\n## Očišťování negativní karmy: Metody transformace\n\n### Dobrá kvalita karmy\n\nZatímco negativní karma vede k utrpení, její „dobrá kvalita\" spočívá v tom, že **může být očištěna**. To odlišuje buddhismus od deterministických pohledů – nejsme bezmocně vázáni minulými činy.\n\n### Čtyři oponentské síly\n\nTyto tvoří základ všech očišťujících praxí:\n\n**1. Síla základu (opory):**\nBrání útočiště ve Třech klenotech (Buddha, Dharma, Sangha) a generování bodhičitty. To poskytuje základnu – svědka, před kterým se vyznáváme, a zdroj očišťující síly.\n\n**2. Síla lítosti:**\nNe zaměňovat s vinou. Jde o **rozpoznání našich negativních činů s jasným porozuměním**, jako někdo, kdo si uvědomí, že snědl jed. Uznáváme chybu jako chybu, cítíme vhodnou lítost za vytvoření utrpení.\n\n**3. Síla protilátky (léku):**\nZapojení se do ctnostných činů k protiváze negativní karmy:\n- Recitace manter (zejména Vadžrasattvova stoslovná mantra)\n- Prostracje před Třiceti pěti vyznavovacími buddhy\n- Meditace na prázdnotu a bodhičittu\n- Činy štědrosti a soucitu\n\n**4. Síla rozhodnutí:**\nUpřímný závazek neopakovat negativní akci. I když nemůžeme slíbit „nikdy znovu\" pro všechny negativity, můžeme se zavázat k zdrženlivosti po určitou dobu, postupně posilujíce naše odhodlání.\n\n### Vadžrasattvova praxe: Primární očišťovací metoda\n\n**Vadžrasattvova meditace** je považována za **nejmocnější očišťovací praxi v tibetském buddhismu**. Všechny čtyři školy (Ňingma, Kagjü, Sakja, Gelug) ji zahrnují jako základní praxi, vyžadující 100 000 recitací mantry v předběžných praxích (ngöndro).\n\n**Praxe:**\n\n*Vizualizace:*\n- Vadžrasattva se objevuje nad vaší korunou, zářivě bílý, vytvořený ze světla\n- Drží vadžru a zvon symbolizující metodu a moudrost\n- Z jeho srdce proudí očišťující bílý nektar\n\n*Recitace mantry:*\nStoslovná mantra je recitována (nebo kratší šestislabičná verze: OM BENZAR SATTO HUNG).\n\n*Proces očišťování:*\nJak vysvětluje Zasep Tulku Rinpočhe:\n1. Nektar proudí ze srdce Vadžrasattvy do vaší koruny\n2. Nejprve očišťuje tělesné karmy – nemoci, nepříznivé fyzické akce\n3. Zadruhé očišťuje řečové karmy – lži, hrubá slova, klepy\n4. Zatřetí očišťuje mentální karmy – připoutanost, hněv, nevědomost, žárlivost\n\n### Další očišťovací praxe\n\n**Třicet pět vyznavovacích buddhů:**\nProstracje při recitování jmen těchto buddhů. Kjabdže Denmo Lóčo Rinpočhe učil, že **i pět okamžitých negativit může být očištěno touto praxí** prováděnou správně se čtyřmi silami.\n\n**Meditace na prázdnotu:**\nNejhlubší očištění – **přímá realizace prázdné povahy aktéra, akce a objektu minulých negativních činů**. To usekává karmu u jejího kořene.\n\n**Bodhičitta:**\nNejsilnější oponentská síla. Generování opravdové bodhičitty – přání dosáhnout osvícení pro všechny bytosti – očišťuje **obrovské akumulace negativní karmy**.\n\n## Rozdíly mezi buddhistickým a hinduistickým pojetím karmy\n\n### 1. Átman versus anátman: Já nebo ne-já?\n\n**HINDUISMUS – Átman (věčné já):**\n- Věří ve věčnou, neměnnou átman (duši) v každé bytosti\n- Átman je identický s brahmanem (univerzální vědomí/ultimativní realita)\n- Karma se připojuje k této věčné duši napříč zrozeními\n- Osvobození (mókša) = realizace jednoty átmanu s brahmanem\n\n**BUDDHISMUS – Anátman (ne-já):**\n- Učí anátman/anatta – **ŽÁDNÁ permanentní, neměnná esence neexistuje**\n- Žádná duše necestuje z života do života\n- Místo toho: proud vědomí tvarovaný karmou (jako zapalování jedné svíčky od druhé – plamen přechází, ale není stejný plamen)\n- Karma se připojuje k tomuto proudu, ne k duši\n- Osvobození (nirvána) = realizace ne-já, ukončení iluze oddělené existence\n\n**PRAKTICKÝ DŮSLEDEK:**\n- Hinduismus: „Mám věčnou esenci, která se musí sjednotit s Božským\"\n- Buddhismus: „Víra v ‚já' je ta samá iluze způsobující utrpení; prohlédněte jí\"\n\n### 2. Osud versus důraz na změnu\n\n**HINDUISMUS:**\n- Některé školy mají silnější deterministické prvky\n- Prárabdha karma (přidělená karma) = karma již uvedená v pohyb pro tento život\n- Tulsidás: „Náš osud byl formován dávno před tím, než tělo přišlo do bytí\"\n- Většina škol však stále umožňuje jednání skrze dharmu, dobré skutky, duchovní praxi\n\n**BUDDHISMUS:**\n- **EXPLICITNĚ ODMÍTÁ FATALISMUS:** „Pokud by přítomný život byl totálně podmíněn minulými akcemi, karma by se rovnala fatalismu... **Taková fatalistická doktrína NENÍ buddhistický zákon karmy**\"\n- Rozpoznává pět řádů/procesů (nijáma): fyzikální, biologické, psychologické, karmické, dharmické zákony – karma je pouze JEDEN faktor\n- Současné volby hluboce záleží: Vždy vytváříme novou karmu při prožívání minulé karmy\n- I silné karmické momentum může být **PŘESMĚROVÁNO skrze intenci, praxi, vhled**\n\n### 3. Mókša versus nirvána\n\n**MÓKŠA (hinduistická):**\n- Osvobození/propuštění ze samsáry\n- Duše (átman) dosahuje spojení nebo splynutí s brahmanem\n- Různé školy liší se v detailech\n- Cesty: oddanost (bhakti), akce (karma jóga), poznání (džňána jóga), meditace (dhjána)\n- Člověk EXISTUJE v mókše – átman pokračuje v blaženém uvědomění\n\n**NIRVÁNA (buddhistická):**\n- „Zhasnutí\" nebo „utišení\" – zhášení ohňů touhy, odporu, nevědomosti\n- **ŽÁDNÉ permanentní já neexistuje, aby bylo osvobozeno** – nirvána = ukončení iluze já\n- Konec stávání se a utrpení\n- Není to místo, není to odměna, není to spojení s božstvem – UKONČENÍ příčin utrpení\n\n**ZÁKLADNÍ ROZDÍL:**\n- Mókša: „Já se sjednocuje s ultimativní realitou\"\n- Nirvána: „Iluze já je zhášena, odhalující ultimativní realitu\"\n\n### 4. Božský zásah a milost\n\n**HINDUISMUS:**\n- Teistické školy zdůrazňují roli Boha (Íšvara) v administraci karmy\n- Bůh neporušuje zákon karmy, ale poskytuje:\n  - Milost (prasád) na pomoc oddaným\n  - Sílu a odvahu, když je požádán\n  - Zrychlení karmického řešení pro oddané\n\n**BUDDHISMUS:**\n- **ŽÁDNÝ Bůh ani vnější božstvo nekontroluje karmu**\n- Karma je přírodní zákon, jako gravitace – automatický, neosobní\n- I Buddha nemůže odstranit karmu druhých: „Buddha řekl, že ani on nemůže prostě odstranit naši karmu nebo utrpění a že mohou být překonány pouze **praktikováním cesty**\"\n- Žádná božská milost nemůže smazat karmu – musíte ji sami propracovat\n\n**PRAKTICKÝ DŮSLEDEK:**\n- Hinduismus: „Mohu se modlit za božskou pomoc s mým karmickým břemenem\"\n- Buddhismus: „Já sám jsem zodpovědný; nikdo nemůže tuto práci udělat za mě\"\n\n### 5. Důraz na intenci v buddhismu\n\n**REVOLUČNÍ UČENÍ BUDDHISMU:**\n„Prohlašuji, že **volice/intence (četaná) je karma**\" (Anguttara Nikája). Buddha předefinoval karmu z fyzických akcí na **PSYCHOLOGICKÝ PROCES**.\n\nRichard Gombrich: „Buddha definoval karmu jako intenci... **byla to intence sama, která měla morální charakter**: dobrý, špatný nebo neutrální... To byla **velká inovace, která převrací brahmanskou, kastovně vázanou etiku**.\"\n\n**PRAKTICKÝ ROZDÍL:**\n- Buddhismus: Dobře míněná chyba vytváří malou karmu\n- Hinduismus (tradiční): Akce sama má karmickou váhu bez ohledu na intenci\n\n## Závěr: Cesta svobody skrze pochopení karmy\n\n### Integrace učení\n\nPochopení karmy není jen teoretické – je to **praktická cesta k transformaci našich životů**. Karma není osud ani trest, ale **přírodní zákon, se kterým můžeme pracovat**.\n\n### Klíčové body k zapamatování\n\n**1. Karma je intention-based:** Váš úmysl záleží více než akce sama.\n\n**2. Vždy vytváříte karmu:** Každá myšlenka, slovo, čin zasévá semena.\n\n**3. Karma není osud:** Můžete změnit směr skrze všímavost a praxi.\n\n**4. Žádný vnější spasitel:** Musíte udělat práci sami; i Buddha nemůže odstranit vaši karmu.\n\n**5. Žádné permanentní já:** Víra v „já\" je iluze způsobující utrpení.\n\n**6. Soucit, ne soud:** Pro sebe i druhé.\n\n**7. Přítomný okamžik je klíčový:** Co děláte TEĎ, formuje vaši budoucnost.\n\n**8. Osvobození je možné:** Skrze praxi může kdokoli transcendovat karmu úplně.\n\n### Praktická moudrá slova\n\n„**Jak lépe rozumíme, naše akce se stanou lepšími. A stejně tak naše karma. Pokrok nemůže být vynucen. Přijde přirozeně, když používáte metody.**\"\n\n„**Musíte meditovat.** Meditace dává mysli kapacitu stát se jasnější. Proto Buddha řekl, že pro skutečnou integraci dharmy v našich životech je důležité meditovat.\"\n\n„**Cesta nabízená Buddhou spočívá v jasném vidění našich myslí, abychom mohli být svobodnější ve svých volbách.**\"\n\n### Osobní závazek\n\nJako praktikující buddhisté neseme zodpovědnost nejen za své vlastní osvobození, ale za osvobození všech bytostí. Porozumění karmě nám umožňuje:\n\n- **Přijmout odpovědnost** za naše činy bez sebeobviňování\n- **Vidět vzorce** v našich životech a pracovat s nimi\n- **Kultivovat pozitivní návykové tendence** skrze praxi\n- **Očišťovat negativní karmu** skrze čtyři oponentské síly\n- **Rozvíjet bodhičittu** pro prospěch všech\n- **Postupovat k osvobození** krok za krokem\n\nPodle učení: „**Meditace přinese výsledky postupně v čase. Pokrok probíhá krok za krokem.**\" S trpělivostí, vytrvlostí a správným porozuměním můžeme transformovat naši karmu a nakonec dosáhnout úplného osvobození od všeho utrpení.\n\n**Kéž všechny bytosti pochopí karmu.**\n**Kéž všechny bytosti se osvobodí od negativní karmy.**\n**Kéč všechny bytosti dosáhnou dokonalého osvícení.**\n\n*Sarva mangalam* – Kéč je vše příznivé.",
  "tags": [
    "budhismus"
  ],
  "category": "BU",
  "metadata": {
    "readingTime": "20 min"
  },
  "id": "article-1760132182722",
  "date": "2025-10-10",
  "filename": "articles/article-1760132182722.json",
  "title.en": "Karma",
  "description.en": "The Law of Cause and Effect in Buddhist Practice",
  "tags.en": [
    "buddhism"
  ],
  "category.en": null,
  "markdown.en": "# Karma: The Law of Cause and Effect in Buddhist Practice\n\n## Introduction: Understanding Karma as a Path to Liberation\n\nKarma is **one of the most fundamental principles of Buddhism**, without understanding which we cannot truly understand the path to liberation. The third of the four thoughts that turn the mind away from samsara, it teaches us that every action has its consequences and that we ourselves are the creators of our own destiny. As the Buddha taught: \"We are the heirs of our actions, our karma is the womb from which we are born.\"\n\nIn Tibetan Buddhism, karma is explained in an extremely practical way. It is not a complex philosophy, but an everyday reality that we can work with. **Karma means cause and effect, action and result**. It is a completely natural law - if we act positively, the result will be good; if we act harmfully, the result will not be good. Karma arises from our thoughts, our speech, and our actions.\n\nThis lecture will guide you through a comprehensive understanding of karma, from basic definitions to the mechanisms of its action to practical methods for working with karma in daily life and ultimately freeing yourself from it.\n\n## What is karma? Basic Buddhist concept\n\n### Etymology and basic definitions\n\nThe word **karma** (Sanskrit: कर्म) or **kamma** (Pali) literally means \"action\" or \"deed\". However, the Buddha brought a revolutionary understanding - **karma** is not the physical act itself, but primarily the INTENTION** (cetanā) that stands behind it. In the Anguttara Nikáya, the Buddha says: \"Intention, monks, I call karma. Having an intention, a person acts karmically with body, speech and mind.\"\n\nThis psychological shift from mere action to intention represented a revolutionary change from the Brahmanical concept. Karma was no longer associated with caste or external ritual, but with **a state of mind**. Thus, every person has an equal opportunity for liberation, regardless of their birth.\n\n### Karma as a Flow of Mind\n\nAccording to Tibetan Buddhism: \"The Buddha told us that it is the mind that reincarnates. Every human being has a mind, a body and a name. The mind identifies with the body and the name and thinks that there is a self - 'I am this and that.' The Dharma explains that it is because of our self-referential tendencies that we feel that there is a 'self.'\"\n\n**The mind is not a solid substance**, but a flow of energy likened to air - without form, but with the capacity to carry different contents. This flow continues from one life to another, and it is **karma that determines where this flow will flow**.\n\n### Two Aspects of Mind\n\nIn Tibetan Buddhism, it is taught that the mind functions in two aspects:\n- **Yäšä** (yeshe) - wisdom, complete clarity\n- **Nyurmon** (nyurmon) - distraction, confusion\n\nOur mind can function either through wisdom or through the scattered influences of negative emotions. Karma is the result of which aspect we act from.\n\n## The Law of Cause and Effect: How Karma Works\n\n### Basic Principle\n\nThe Buddhist law of karma states: \"**When this is, that is. From the arising of this, that arises. When this is not, that is not. From the cessation of this, that ceases.**\" (Samyutta Nikáya) This principle is called **pratítjasamutpáda** (dependent arising) and is the core of the Buddhist understanding of causation.\n\nAs the Buddha taught, \"As you sow the seed, so shall you reap the harvest.\" Actions motivated by greed, hatred, or ignorance sow the seeds of suffering. Actions motivated by generosity, love, or wisdom create the conditions for happiness.\n\n### The Indeterminacy of Karma\n\n**Karma is not fatalism or destiny.** This is fundamentally important to understand. Thanissaro Bhikkhu emphasizes: “Early Buddhist karma is NOT fatalistic. It is not an inexplicable, unchanging force. On the contrary, it emphasizes the liberating potential of what the mind is doing in each moment.”\n\nTibetan teachings use a beautiful metaphor of **mixed sand**: “Karma can be negative or positive. For example, if you have sand of two colors—white and black—when you mix them together, you get gray. The shade of gray, darker or lighter, depends on the amount of black or white in the mixture. If there is more black sand, the mixture is darker. If you add white sand, the shade of gray will lighten.”\n\n**Practical conclusion:** Even if you have past negative karma, if you act more positively, your positive karma will become stronger. In this way, we say that **negative karma can be changed naturally through our regular positive actions**.\n\n### Three Time Frames of Karmic Ripening\n\nKarmic results manifest in three temporal levels:\n1. **Immediate** – experienced in the present moment\n2. **Later** – during this life\n3. **Future** – in subsequent lives\n\n## Three Types of Karma: Kusala, Akushala and Neutral\n\n### 1. Kusala Karma – Beneficial, skillful karma\n\n**Etymology:** From \"ku\" (kilesa/evil) + \"sala\" (to get rid of). Kusala literally means \"getting rid of evils\".\n\n**Three roots of kusala karma:**\n- **Alobha** – non-greed, generosity\n- **Adosa** – hatred, kindness\n- **Amoh** – non-error, wisdom\n\n**Ten wholesome actions (dasa kusala kamma):**\n\n*By body (3):*\n1. Abstaining from killing living beings\n2. Abstaining from stealing\n3. Abstaining from sexual misconduct\n\n*By speech (4):*\n4. Abstaining from lying\n5. Abstaining from divisive speech\n6. Abstaining from abusive speech\n7. Abstaining from idle chatter\n\n*Thoughts (3):*\n8. Envy\n9. Malice\n10. Wrong view\n\n**Effects of akusala karma:** Increases defilements, creates energy that nourishes the rebirth process, and leads to rebirth in lower realms (hells, hungry ghosts, animals).\n\n**Most serious negative karma:** Five anantarika kamma (actions with immediate results leading to hell): maternal murder, paternal murder, murder of an arhat, causing a Buddha to bleed with malicious intent, creating a schism in the sangha.\n\n### 3. Neutral karma (avyakrta)\n\n**Definition:** \"Indeterminate\" - karma that is neither wholesome nor unwholesome; karmically neutral or amoral states.\n\n**Two types:**\n1. **Karmically neutral mental states** – states without ethical intention, functional consciousness (kiriya-citta). For example, the actions of an arhat have no karmic force.\n2. **Actions without moral intention** – unintentional actions with no observable karmic effect, such as brushing your teeth or walking unconsciously.\n\nRingu Tulku explains: \"When our motivation is indifferent and our actions are neither harmful nor beneficial, it is a neutral action.\"\n\n## Habitual Tendencies: The Force That Keeps Karma Moving\n\n### The Nature of Habitual Tendencies\n\nIn Buddhist teachings, it is said: \"**It is because of our habitual tendencies that we feel that there is a 'I'.** Some realized teachers have described the mind as energy, like air, completely formless.\"\n\n**Habitual tendencies (vasana)** are latent patterns of thought, speech, or action that are imprinted on the mindstream. The term is often translated as \"infusing,\" suggesting that **thoughts and actions \"infuse\" the mind with their essence**.\n\n### How addictive tendencies arise\n\nWhen we perform an action motivated by greed or other mental states, **it plants a \"seed\" in the series of phenomena that make up our mind**. According to scholar Rupert Gethin: \"Such a seed is not a thing in itself, but only a modification or 'infusing' of the subsequent flow of dharmas resulting from the action. Over time, this modification matures and produces a specific result.\"\n\n### Addictive Tendencies in Meditation\n\nAccording to the teachings of Tibetan Buddhism: \"To meditate in general means simply to sit. We do not let the mind wander after thoughts. We want to 'be present'... **All mental tendencies or patterns will appear as wandering thoughts.**\"\n\nThat is why meditation is so important—it allows us to **see our addictive patterns in action** and gradually change them. When we consistently practice mindfulness and compassion, these qualities become habitual, automatic.\n\n### Practical Principle\n\n“Just like we eat breakfast in the morning... It’s normal and automatic. **If you could practice meditation as an everyday thing, something you simply and automatically do, then it becomes very easy.**\" In this way, we create **positive addictive tendencies** that lead us to liberation instead of further suffering.\n\n## Three Obscurations: The Roots of Negative Karma\n\n### Basic Obscurations of the Mind\n\nEveryone has **strong obscurations** (avaranas) in their minds, the main disturbing emotions being:\n\n1. **Clinging** (raga) – attachment, desire\n\n2. **Anger** (dosha) – hatred, aversion\n\n3. **Ignorance** (moha) – delusion, ignorance\n\nAccording to the teachings: \"On their basis, a large number of other disturbing emotions arise in our minds.\"\n\n### Ignorance as the Basic Obscuration\n\n“The Buddha introduced us to the basic state of **ignorance, or marigpa** in Tibetan. He explained that we are always in marigpa, which means **we do not see rightly**. Ignorance, or marigpa, does not mean stupid. It means that even though you may be clever and have wisdom, you still **do not see your wisdom**. You do not see clearly, and therefore you may act wrongly.”\n\n### How Obscurations Cloud the Mind\n\n“The disturbing emotions are attachment, pride, jealousy, hatred, expectation, and anger. **They are your own mind.** When you are aware of them, you will see how such emotions disturb you and the conditions that cause them to arise. You will recognize that they bring you great difficulty—in short, suffering.”\n\n### Obscurations as Veils\n\n\"Without the obstacles that obscure our vision as veils in the form of visions and feelings, we can then penetrate to the **real meaning** that we already know - to the many theories and teachings.\"\n\nPractically, this means: **When obscurations are active, we cannot see reality as it is.** We see it through the filter of our desires, aversions and ignorance. Meditation helps to reveal and eventually remove these veils.\n\n## Karmic Traces and Their Ripening\n\n### Vasana and Bija: Karmic Imprints and Seeds\n\n**Vasana** refers to **the latent energy resulting from actions** that is said to be \"imprinted\" in **alaya-vijnana** (reservoir consciousness). These habitual tendencies are causally effective assumptions imprinted on the mindstream by any virtuous, unvirtuous or neutral activity of body, speech or mind. **They can be carried over from one life to another.**\n\n**Bija** literally means \"seed\" and serves as a metaphor for the origin or cause of things. When we perform an action motivated by greed, **it plants a seed in the series of phenomena that make up our mind**. Such a seed is not a thing in itself, but a modification of the subsequent flow of consciousness.\n\n### Three Types of Vasana (according to Cheng Wei-sh Lun)\n\n1. **Linguistic and Conceptual Vasana** – Latent Linguistic Conditioning from Terms and Words\n\n2. **Vasana of Self-Attachment** – False Attachment to the Seeds of \"I\" and \"Mine\" (Atma-Graha)\n\n3. **Bhavanga-Vasana** – Karmic Seeds Transmitted from One Stream of Being to Another, Causing Rebirth in the Three Worlds\n\n### Alaya-Vijnana: The Reservoir Consciousness\n\n**Alaya-Vijnana** is the eighth consciousness in the Yogacara model. It serves as the fundamental \"reserve\" where **all karmic seeds are stored and stored until they ripen**.\n\nThrangu Rinpoche explains: “The eighth consciousness is called alaya vijnana, or all-ground consciousness. It is so called because **it is the foundation or ground for the emergence of all other types of consciousness**. It is that fundamental clarity of consciousness, or cognitive clarity, that has been there since the beginning.”\n\n**Two aspects of alaya vijnana:**\n1. **Seed aspect** – storing or recording all habit patterns\n2. **Ripe aspect** – knowing everything that is happening in the moment in consciousness\n\n### The process of karmic ripening (vipāka)\n\n**Vipāka** literally means \"ripening\" or \"maturing\". It refers to the process by which **karmic seeds stored in alaya vijnana gradually ripen** until they manifest as karmic consequences.\n\nPeter Harvey explains: \"Karma is often compared to a seed, and the two words for karmic result, vipāka and phala, mean 'ripening' and 'fruit'. **Action is thus like a seed which sooner or later, as part of its natural process of ripening, will result in certain fruits accruing to the doer.**\"\n\n### Immediate versus Delayed Results\n\n**Immediate results** are manifested in three categories of actions:\n1. **Actions of extremely strong emotion** - actions performed with deeply felt compassion or intense hatred\n2. **Actions concerning important objects** - actions directed towards parents, teachers or sacred objects carry much greater karmic weight\n3. **Repeated actions** - actions repeated over and over again become deeply ingrained habits\n\n**Delayed Results:** Most karmic actions produce results in future lives. The seeds remain latent in alaya-vijnana until suitable conditions arise for their maturation.\n\n### Four Types of Karmic Results\n\n**1. Ripe results (vipāka-phala):**\n- The type of body we acquire (human, animal, god, etc.)\n- Our consciousness and its qualities\n- Feelings of happiness and unhappiness\n\n**2. Cause-like results in behavior (nisyanda-phala):**\n- Habitual tendencies to repeat similar actions\n- If we killed in a past life, we have a natural tendency to kill\n- If we practiced generosity, we naturally feel a tendency to do generous acts\n\n**3. Cause-like results in experience:**\n- We experience situations where something similar to our previous actions happens to us\n- If we have hurt someone, we experience hurt from the same being in a future life\n\n**4. Environmental/Governing Results (adhipati-phala):**\n- Determines the type of environment, society, and external circumstances\n- Being born in a rich or poor country\n- Living in a peaceful or war-torn area\n\n## Karma and Rebirth: The Journey Through the Six Realms\n\n### The Nature of Samsara\n\n**Samsara** is the **beginningless cycle of repeated birth, earthly existence, and repeated death**. It is characterized by suffering (dukkha) and is maintained by ignorance (avidya), craving (trasna), and hatred (dvesa), which govern karma.\n\nAs the Buddha taught: \"The movement of beings between births is not a random process, but is **ordered and governed by the law of karma**, the principle that beings are reborn according to the nature and quality of their past actions.\"\n\n### The Six Realms of Existence\n\n**Three Higher Realms:**\n\n**1. The realm of gods (devas):**\nBeings live long lives filled with pleasure, supernatural powers, and immense wealth. However, this is impermanent—once good karma is exhausted, beings fall into the lower realms. The danger is that gods become complacent and forget to practice the dharma.\n\n**2. The realm of demigods (asuras):**\nStrong, powerful beings consumed by jealousy and the desire to be better than others. They constantly fight with gods whose status they envy. Asuras are marked by pride, paranoia, and competitive aggression.\n\n**3. The human realm:**\n**The most valuable realm**, as it offers the perfect balance between suffering and pleasure, allowing for reflection and practice of the dharma. Only in the human realm can beings effectively practice the path to liberation.\n\n**The three lower realms:**\n\n**4. Animal realm:**\nBeings are driven by instinct, living in ignorance and stupidity. They experience predation, domestication and lack the capacity for spiritual practice.\n\n**5. Hungry ghost realm (preta):**\nBeings suffer from insatiable desire and lust. They are depicted with huge bellies and tiny throats, unable to satisfy their hunger and thirst.\n\n**6. Hell realm (naraka):**\nBeings endure unimaginable suffering – fire, ice, being cut to pieces and intense mental anguish. The Masters teach: “The greatest suffering in hell is not physical pain, but mental remorse and self-torturous punishment.”\n\n### Mechanism of Karmic Rebirth\n\nThe driving force behind rebirth is **karma combined with the three root poisons** (greed, hatred, ignorance).\n\n**Ten unwholesome actions leading to the lower realms:**\n- Three bodily: killing, stealing, sexual misconduct\n- Four verbal: lying, divisive speech, abusive speech, idle chatter\n- Three mental: envy, malice, wrong views\n\n**Wholesome actions leading to the higher realms:**\n- Generosity, ethical conduct, meditation\n- Cultivation of kindness, compassion, and wisdom\n- Following the Five Vows and the Ten Virtuous Acts\n\n### Bardo: Intermediate State and Karmic Propulsion\n\n**Bardo** (Tibetan: bar do) literally means \"gap\" or \"intermediate state\". It most commonly refers to the state between death and rebirth.\n\n**Three Bardos of Death:**\n\n**1. The Painful Bardo of Dying (chi-kha'i bardo):**\nIt begins when death is inevitable and continues until the \"inner breathing\" ceases. Consciousness separates from the body and the elements dissolve.\n\n**2. The Radiant Bardo of Dharmata (chönyi bardo):**\nAfter death, the nature of the mind is laid bare - the same for everyone, but not experienced in the same way. For those with deep practice, it represents the greatest opportunity for liberation.\n\n**3. The Karmic Bardo of Becoming (sidpa bardo):**\nHere karma most directly governs rebirth. It usually lasts up to 49 days, although the period varies. The being experiences visions determined by **entirely past karma** - what Buddhist teachers describe as \"winds of karma\" that unfurl consciousness.\n\n**Entering the Womb:**\nFor human rebirth, consciousness sees its future parents making love. According to the teachings:\n- For male birth: aggression towards father, attachment to mother\n- For female birth: aggression towards mother, attachment to father\n\nWhen the egg and sperm unite, consciousness enters and a new life begins.\n\n## Practical Examples of Karma in Daily Life\n\n### Relationships and Communication\n\n**Divergent Speech:** Speaking negatively about others to their friends creates karma leading to relationship breakdowns and friends leaving.\n\n**Exploitation:** Taking/using others' things without permission creates karma of poverty and experiencing theft.\n\n**Kindness:** Acting with genuine compassion sows the seeds for harmonious relationships and support when we need it.\n\n**Key insight:** Your karma does not control the reactions of others (it is their karma), but **creates your urge to enter situations where similar things happen to you**.\n\n### Speech and its karmic effects\n\nThe teaching explains: “**We are always unconsciously following the ways of others, influencing each other.** So if I act unethically in following my own negative emotions, somehow other people will act as I do.”\n\n**Pause practice:** Notice the space between the feeling that you want to say something and the urge to actually say it. This allows discriminating mindfulness to decide whether speaking will help or harm.\n\n### Mental States and Karmic Consequences\n\n**Mental Karma is real.** It operates through the body, speech AND mind:\n- **Destructive:** compulsive worrying, planning harm, grudges\n- **Constructive:** planning kindness, contemplating wisdom, cultivating compassion\n- **Neutral:** becomes karmic when filled with specific intention\n\n**Karma as a compulsion:** Karma is a **compulsive mental factor that drives you to think/speak/act** – it is NOT the action itself, but the drive behind it. These compulsions arise from habits built over time.\n\n### Transforming Everyday Activities\n\nAccording to the teachings: “**The path of meditation creates results that we can use all the time.** I am always available, always present, both on an emotional and physical level... This makes it much easier to apply compassion and be open to others.”\n\n**Practical methods:**\n- Infuse neutral actions with mindfulness (walking mindfully, eating with gratitude)\n- Practice mindfulness of arising mental states before they become actions\n- Develop equanimity: \"Sometimes happy, sometimes unhappy - nothing special\"\n\n## Lojong: Mind Training and Karma Work\n\n### Bodhicitta as the Foundation\n\nAccording to the teachings: \"When we go to receive the Dharma or when we practice the Dharma, **we do not do it only for our own benefit**. It is natural that we initially seek the Dharma for our own good. But we must also begin to learn to be concerned about other beings.\"\n\n**Bodhicitta** – **awakened mind** – is an open and genuine altruistic care and concern for others. As we practice being motivated by bodhicitta, our practice will become increasingly effective.\n\n### Four Immeasurables\n\nA fundamental wish containing four lines of thought – a fundamental wish for every being without exception:\n\n1. **May all beings attain happiness and its causes**\n\n2. **May they be free from suffering and its causes**\n\n3. **May they not be separated from happiness without suffering**\n\n4. **May they abide in equanimity free from attachment and aversion**\n\n### Compassion and Understanding\n\n“Apply the Mahayana thought that **we must think of others – not just exclusively of ourselves**. If we can connect with this thought whenever we feel negativity, then we have truly reached a turning point. We will understand the fact that negativity serves no good.”\n\n**Practical Compassion:** “Even if the other person has made a mistake, **we will understand that it is because of their ignorance or their lack of vision**. We will not feel so hurt... It is this kind of caring feeling that allows us to share and help those who are not doing quite right.”\n\n### Using Negative Experiences on the Path\n\nAny negative action or experience of ourselves or others also has the potential to bring us onto the path of bodhicitta, if we can see and understand how it relates to the functioning of the mind. Whenever something unpleasant happens to us, it is not right to lose control and act as we please. Instead, we look within ourselves and try to understand what is happening to us. In this way, we use the situation to help us achieve a deeper understanding.\n\n### Dedicating Merit to Others\n\nWhenever we have good thoughts, do a good deed, or do a good practice, we can dedicate to other beings all the positive results that we may have created. This reduces our attachment to the ego and the mind becomes more focused on others. The benefits of dedication are obviously twofold. We benefit both ourselves and others. It is the replacement of self-centered attitudes with concern for others that brings us closer to liberation from attachment to the self.\n\n## Liberation from Attachment to the Ego\n\n### Understanding the Illusion of Self\n\nBuddhist teachings emphasize a fundamental truth: “**The mind identifies with the body and name and thinks that there is a self – ‘I am so-and-so.’** The Dharma explains that it is because of our attachment tendencies that we feel that there is a ‘self.’”\n\n### Ego Clinging and Suffering\n\n“As a result, **we lose our composure and can no longer do anything right because of our clinging to self**. Of course we think this is normal. Clinging is now normal for us. However, **the mind can be much more comfortable with less suffering in the absence of clinging**.”\n\n### The Process of Looking Within\n\n“When you look into your mind, it is very simple. **There is nothing to do. Just sit.** First you just sit without doing anything. Then from time to time look at your own nature. Look at yourself.”\n\n**Practical Instruction:** “Just try to look at the self. You really have **many faculties**. If you really try to focus, you can understand everything. You have this potential... **There is kindness, compassion and love within you. They are there quite naturally.**\"\n\n### Wisdom versus illusion\n\n“**Everything depends on our mind.** If we are not aware of our inner workings and we simply follow what we feel, then it is said that we are acting **under confusion**. But if we are aware and can see for ourselves, then there is **understanding**. Understanding will lead us in the right direction.\"\n\n### Gradual Liberation Through Practice\n\n“This kind of change cannot be achieved in one or two days, one or two months. It is quite difficult. **The change we are talking about here will come later, in one or two years.** During this time, the change happens like the movement of a clock. It moves very slowly and hardly perceptibly.\"\n\n### Letting go of attachment is not so easy\n\nOne thing we have touched on before is attachment. It is a delicate matter. Whenever we meditate, observe our mind or analyze it, there is some attachment. We try to let go of it, but it is difficult. When we try to find the meaning of attachment, to see the object of attachment, the effect of attachment, and so on, and when we start to investigate, we find that getting rid of attachment and becoming natural is a very slow process.\n\n## Purifying Negative Karma: Methods of Transformation\n\n### The Good Quality of Karma\n\nWhile negative karma leads to suffering, its \"good quality\" is that it **can be purified**. This is what distinguishes Buddhism from deterministic views—we are not helplessly bound by past actions.\n\n### The Four Opposing Forces\n\nThese form the basis of all purifying practices:\n\n**1. The Power of the Foundation (Support):**\nIt prevents taking refuge in the Three Jewels (Buddha, Dharma, Sangha) and generating bodhicitta. This provides a foundation—a witness to whom we confess, and a source of purifying power.\n\n**2. The Power of Regret:**\nNot to be confused with guilt. It is **recognizing our negative actions with clear understanding**, like someone realizing they have eaten poison. We recognize the mistake as a mistake, feeling appropriate regret for creating suffering.\n\n**3. The power of the antidote (medicine):**\nEngaging in virtuous actions to counteract negative karma:\n- Recitation of mantras (especially the Vajrasattva Hundred-Word Mantra)\n- Prostrations to the Thirty-Five Confessional Buddhas\n- Meditation on Emptiness and Bodhicitta\n- Acts of generosity and compassion\n\n**4. The power of resolution:**\nA sincere commitment not to repeat the negative action. While we cannot promise \"never again\" for all negativities, we can commit to abstinence for a period of time, gradually strengthening our resolve.\n\n### Vajrasattva Practice: Primary Purification Method\n\n**Vajrasattva Meditation** is considered **the most powerful purification practice in Tibetan Buddhism**. All four schools (Nyingma, Kagyu, Sakya, Gelug) include it as a basic practice, requiring 100,000 recitations of the mantra in the preliminary practices (ngöndro).\n\n**Practice:**\n\n*Visualization:*\n- Vajrasattva appears above your crown, radiant white, made of light\n- He holds a vajra and a bell symbolizing method and wisdom\n- From his heart flows a purifying white nectar\n\n*Mantra recitation:*\nA hundred-word mantra is recited (or a shorter six-syllable version: OM BENZAR SATTO HUNG).\n\n*The Purification Process:*\nAs Zasep Tulku Rinpoche explains:\n1. Nectar flows from the heart of Vajrasattva to your crown\n2. First, it purifies bodily karmas – illnesses, adverse physical actions\n3. Second, it purifies speech karmas – lies, harsh words, gossip\n4. Third, it purifies mental karmas – attachment, anger, ignorance, jealousy\n\n### Other Purifying Practices\n\n**Thirty-five Buddhas of Confession:**\nProstrate while reciting the names of these Buddhas. Kyabje Denmo Locho Rinpoche taught that **even the five immediate negativities can be purified by this practice** done correctly with the four powers.\n\n**Meditation on Emptiness:**\nThe deepest purification – **direct realization of the empty nature of the actor, action, and object of past negative actions**. This cuts off karma at its root.\n\n**Bodhicitta:**\nThe most powerful opposing force. Generating true bodhicitta – the wish to achieve enlightenment for all beings – purifies **vast accumulations of negative karma**.\n\n## Differences between Buddhist and Hindu Concepts of Karma\n\n### 1. Atman versus Anatman: Self or Not-Self?\n\n**HINDUISM – Atman (eternal self):**\n- Believes in an eternal, unchanging atman (soul) in every being\n- Atman is identical with Brahman (universal consciousness/ultimate reality)\n- Karma connects to this eternal soul across births\n- Liberation (moksha) = realization of the oneness of atman with Brahman\n\n**BUDDHISM – Anatman (no-self):**\n- Teaches anatman/anatta – **NO permanent, unchanging essence exists**\n- No soul travels from life to life\n- Instead: a stream of consciousness shaped by karma (like lighting one candle from another – the flame passes, but it is not the same flame)\n- Karma connects to this stream, not to the soul\n- Liberation (nirvana) = realization of no-self, ending the illusion of separate existence\n\n**PRACTICAL IMPLICATION:**\n- Hinduism: “I have an eternal essence that must unite with the Divine\"\n- Buddhism: \"Belief in 'I' is the same illusion that causes suffering; see through it\"\n\n### 2. Fate vs. Emphasis on Change\n\n**HINDUISM:**\n- Some schools have stronger deterministic elements\n- Prarabdha karma (assigned karma) = karma already set in motion for this life\n- Tulsidas: \"Our fate was formed long before the body came into being\"\n- Most schools, however, still allow for action through dharma, good deeds, spiritual practice\n\n**BUDDHISM:**\n- **EXPLICITLY REJECTS FATALISM:** \"If the present life were totally conditioned by past actions, karma would amount to fatalism... **Such a fatalistic doctrine is NOT the Buddhist law of karma**\"\n- Recognizes five orders/processes (niyamas): physical, biological, psychological, karmic, dharmic laws – karma is only ONE factor\n- Current choices matter profoundly: We are always creating new karma as we experience past karma\n- Even strong karmic momentum can be **RE-DIRECTED through intention, practice, insight**\n\n### 3. Moksha vs. Nirvana\n\n**MOKSA (Hindu):**\n- Liberation/release from samsara\n- Soul (atman) achieves union or fusion with Brahman\n- Different schools differ in details\n- Paths: devotion (bhakti), action (karma yoga), knowledge (jnana yoga), meditation (dhyana)\n- One EXISTS in moksha – atman continues in blissful awareness\n\n**NIRVANNA (Buddhist):**\n- \"Extinguishing\" or \"silence\" – extinguishing of the fires of desire, aversion, ignorance\n- **NO permanent self exists to be liberated** – nirvana = cessation of the illusion of self\n- The end of becoming and suffering\n- It is not a place, it is not a reward, it is not a union with the deity – the END of the causes of suffering\n\n**FUNDAMENTAL DIFFERENCE:**\n- Moksha: \"The self unites with the ultimate reality\"\n- Nirvana: \"The illusion of self is extinguished, revealing the ultimate reality\"\n\n### 4. Divine intervention and grace\n\n**HINDUISM:**\n- Theistic schools emphasize the role of God (Ishvara) in the administration of karma\n- God does not violate the law of karma, but provides:\n- Grace (prasad) to help devotees\n- Strength and courage when requested\n- Acceleration of karmic resolution for devotees\n\n**BUDDHISM:**\n- **NO God or external deity controls karma**\n- Karma is a natural law, like gravity – automatic, impersonal\n- Even Buddha cannot remove karma of others: \"The Buddha said that even he cannot simply eliminate our karma or suffering and that it can only be overcome by **practicing the path**\"\n- No divine grace can erase karma – you have to work it out yourself\n\n**PRACTICAL IMPLICATION:**\n- Hinduism: \"I can pray for divine help with my karmic burden\"\n- Buddhism: \"I myself am responsible; no one can do this work for me\"\n\n### 5. Emphasis on Intention in Buddhism\n\n**REVOLUTIVE TEACHINGS OF BUDDHISM:**\n\"I declare that **will/intention (read) is karma**\" (Anguttara Nikaya). The Buddha redefined karma from physical actions to **PSYCHOLOGICAL PROCESS**.\n\nRichard Gombrich: \"The Buddha defined karma as intention... **it was intention itself that had a moral character**: good, bad, or neutral... This was **a great innovation that overturned the Brahmanical, caste-bound ethics**.\"\n\n**PRACTICAL DIFFERENCE:**\n- Buddhism: A well-intentioned mistake creates little karma\n- Hinduism (traditional): Action itself carries karmic weight regardless of intention\n\n## Conclusion: The Path to Freedom through Understanding Karma\n\n### Integration of the Teachings\n\nUnderstanding karma is not just theoretical – it is **a practical path to transforming our lives**. Karma is not fate or punishment, but **a natural law we can work with**.\n\n### Key Points to Remember\n\n**1. Karma is intention-based:** Your intention matters more than the action itself.\n\n**2. You are always creating karma:** Every thought, word, and deed sows seeds.\n\n**3. Karma is not fate:** You can change direction through mindfulness and practice.\n\n**4. No external savior:** You have to do the work yourself; even a Buddha cannot remove your karma.\n\n**5. No permanent self:** The belief in \"self\" is an illusion that causes suffering.\n\n**6. Compassion, not judgment:** For yourself and others.\n\n**7. The present moment is key:** What you do NOW shapes your future.\n\n**8. Liberation is possible:** Through practice, anyone can transcend karma completely.\n\n### Practical Words of Wisdom\n\n\"**As we understand better, our actions become better. And so does our karma. Progress cannot be forced. It comes naturally when you use the methods.\"\n\n\"**You must meditate.** Meditation gives the mind the capacity to become clearer. That is why the Buddha said that meditation is essential for truly integrating the dharma into our lives.\"\n\n\"**The path offered by the Buddha is to see our minds clearly so that we can be freer in our choices.**\"\n\n### Personal Commitment\n\nAs practicing Buddhists, we are responsible not only for our own liberation, but for the liberation of all beings. Understanding karma allows us to:\n\n- **Accept responsibility** for our actions without self-blame\n\n- **See patterns** in our lives and work with them\n\n- **Cultivate positive addictive tendencies** through practice\n\n- **Purify negative karma** through the four opposing forces\n\n- **Develop bodhicitta** for the benefit of all\n\n- **Progress towards liberation** step by step\n\nAccording to the teachings: \"**Meditation will bring results gradually over time. Progress occurs step by step.**\" With patience, perseverance, and correct understanding, we can transform our karma and ultimately achieve complete liberation from all suffering.\n\n**May all beings understand karma.**\n**May all beings be freed from negative karma.**\n**May all beings attain perfect enlightenment.**\n\n*Sarva mangalam* – May everything be auspicious."
}