{
  "title": "Poklony",
  "description": "Poklony v tradici Karma Kagyu: Kompletní průvodce praxí a realizací",
  "markdown": "# Poklony v tradici Karma Kagyu: Kompletní průvodce praxí a realizací\n\nPrvní z Čtyř základních cvičení v tradici Karma Kagyu, **prostrace neboli poklony** (tib. *phyag 'tshal ba* / *chaktsal*), představují hlubokou duchovní praxi, která současně zapojuje tělo, řeč a mysl. Prostrace nejsou pouze fyzickým cvičením nebo rituální formalitou, ale sofistikovanou metodou očisty obscurací a akumulace zásluh, která připravuje praktikující na hlubší realizace Mahamudry. V linii přenosu od Vadžradháry přes Tilópu, Narópu, Marpu, Milarépu, Gampópu až po současného 17. Karmapu tvoří prostrace nenahraditelný základ tantricko-buddhiského vzdělávání.\n\n## Doktrinalní význam prostrace v tradici Karma Kagyu\n\n**Sanskritská filozofická základna** prostrace vychází z mahájánového chápání dvou akumulací (tib. *tshogs gnyis*) – akumulace zásluh (*bsod nams kyi tshogs*) a akumulace moudrosti (*ye shes kyi tshogs*), které společně tvoří příčinné podmínky pro osvícení. Prostrace primárně budují akumulaci zásluh, vytvářejíc příznivé podmínky pro duchovní pokrok a schopnost realizovat prázdnotu. Zatímco zásluhy vytvořené s konceptuálním uchopením zůstávají dualistické, jejich kombinace s bódhičittou (touhou po osvícení všech bytostí) je činí nevyčerpatelné.\n\nGampópa (1079-1153), který ve své epochemální syntéze spojil tradici Kadampy zdůrazňující postupnou cestu s přenosem Mahámudry od Milarépy, položil základy strukturovaného přístupu k předběžným praktikám. V textu *Drahokam osvobození* (*Dam chos yid bzhin nor bu thar pa rin po che'i rgyan*) vysvětluje, že prostrace představují klíčový způsob, jakým praktikující vyjadřuje úctu a oddanost duchovnímu mistru: „Oddanost vyjadřujeme poklonami, rychlým vstáváním, pokloněním hlavy, obcházením, projevováním blízkosti ve správný okamžik a nenasyceným pohledem na mistra.\" Tento přístup ilustroval Sudhánou, synem obchodníka, který sloužil svým duchovním mistrům s naprostou oddaností.\n\n**Vývojová pozice v linii přenosu** prostrace získaly v 16. století, kdy 9. Karmapa Wangčhug Dordže (1556-1603) sepsal kanonický text *Pagiam dröpä'i šingta* (*'phags lam bgrod pa'i shing rta*) – „Vůz pro putování vznešenou cestou\". Tento text, který dodnes tvoří standardní praxi Karma Kagyu ngöndrö, přesně popsal strukturu stromu útočiště, vizualizace a techniku provádění prostrace. V 19. století Džamgön Kongtrül Lödro Thayé (1813-1900) vytvořil k tomuto textu autoritativní komentář *Nedon dronme* (*nges don sgron me*) – „Pochodeň jistoty\", který značně zpopularizoval praxi ngöndrö.\n\nSoučasný 17. Karmapa Orgyen Trinle Dordže představil jak aktualizovanou verzi textu 9. Karmapy s novými liniovými prosbami, tak zkrácenou současnou verzi „Ngöndrö pro naši současnou dobu\", která zohledňuje jiné životní podmínky západních a moderních praktikujících. Ve svém učení v Seattlu v roce 2008 vysvětlil: „Klíčovými body všech praktik je shromáždit akumulace a očistit negativní činy a obscurace. Neexistuje praxe, která by nebyla zahrnuta v těchto dvou.\"\n\n## Tři brány očisty prostracemi\n\n**Triádická struktura očisty** (tib. *lus ngag yid gsum* / sku gsung thugs gsum) představuje jádro purifikační mechaniky prostrace. Podle tradiční terminologie *chak* (phyag) znamená „zametat pryč\" škodlivé činy a obscurace, jako když metlou zametáme nečistoty, zatímco *tsal* ('tshal) znamená, že přijímáme požehnání osvíceného těla, řeči a mysli a získáváme všechny siddhí.\n\n**První brána – purifikace těla** (*lus* / *ku*) probíhá fyzickým dotykem koruny hlavy se složenými rukama v mudře modlitby a samotnou prostrací. Tento fyzický akt očišťuje negativní karmu spojenou s tělem – zabíjení, krádež a sexuální miskondukt. Když pět bodů těla (obě kolena, obě ruce a čelo) dotkne země, pět znečišťujících emocí (pět jedů – hněv, touha, ignorance, pýcha, žárlivost) opouští tělo a transformují se v pět moudrosti: hněv v zrcadlovou moudrost, touha v rozlišující moudrost, ignorance v moudrost dharmadhatu, pýcha v moudrost rovnosti a žárlivost v vše-uskutečňující moudrost. Symbolicky praktikující přijímá požehnání vadžrového těla Buddhy a všech objektů útočiště.\n\n**Druhá brána – purifikace řeči** (*ngag* / *sung*) se uskutečňuje dotykem hrdla s modlitební mudrou a recitací útočištné modlitby. Tím se očišťuje negativní karmická síla spojená s řečí – lhaní, roztržitá řeč, hrubá slova a zbytečné tlachání. Praktikující přijímá požehnání vadžrové řeči Buddhy a probouzí kvality osvícené komunikace. Kontinuální recitace útočištné modlitby během tisíců prostrace vytváří hluboké návyky oddanosti a důvěry ve Tři klenoty.\n\n**Třetí brána – purifikace mysli** (*yid* / *thug*) nastává dotykem srdečního centra s modlitební mudrou a udržováním vizualizace s jednobodovou koncentrací. Očišťuje mentální negativní činy – chtivost, špatnou vůli a mylné názory. Kromě toho odstraňuje kognitivní obscurace (*shé-drib*, *jñeyāvaraṇa*), které jsou jemnější než emocionální obscurace a vznikají z uchopování jevů jako skutečně existujících. Praktikující přijímá požehnání vadžrové mysli Buddhy, což vytváří podmínky pro osvícenou moudrost a direct perception prázdnoty.\n\n**Synchronizace tří bran** se považuje za zásadní. Jak učil 17. Karmapa: „Existují tři typy prostrace – fyzické prostrace s tělem, prostrace prostřednictvím řeči, tedy verbální chvála a hold oslavující pozitivní kvality učitele, a prostrace s myslí, což znamená projevení hlubokého respektu a pociťování velkého přesvědčení k osobě, před kterou se prosternujeme. Když provádíme autentickou prostraci, naše mysl je naplněna skutečným respektem.\"\n\n## Místo prostrace v Čtyřech základních praktikách\n\n**Strukturální kontext ngöndrö** (*sngon 'gro*, doslova „to, co jde předem\") zahrnuje vnější a vnitřní předběžné praktiky. Vnější neboli obecné předběžné praktiky, zvané „Čtyři myšlenky, které otáčejí mysl k Dharme\", zahrnují kontemplaci vzácného lidského zrození, smrti a nepermanence, karmy a utrpení samsáry. Tyto kontemplace generují autentické zřeknutí se a vytvářejí motivaci pro praxi.\n\n**Vnitřní neboli zvláštní předběžné praktiky** se skládají ze čtyř hlavních cvičení, každé prováděné tradičně 100 000krát (plus dalších 11 111 pro zajištění správnosti, celkem 111 111):\n\nPrvní praxí je **refuge a prostrace s bódhičittou**, která očišťuje pýchu a egové uchopení. Praktikující se upíná k Třem klenotům (Buddha, Dharma, Sangha) a Třem kořenům (Lama, Yidam, ochránci) a současně generuje aspiraci osvobodit všechny cítící bytosti. Druhá praxe je **recitace stoslabičné mantry Vadžrasattvy** (100 000 opakování), která očišťuje nenávist a averzi a odstraňuje negativní karmu z nepočitatelných minulých životů. Třetí je **mandala obětování** (100 000 opakování), které očišťuje připoutanost mentálním dáváním celého vesmíru jako obětiny. Čtvrtou praxí je **guru jóga** (100 000 opakování mantry Karmapa khyenno), která očišťuje všechny obscurace a otevírá mysl požehnání lineage.\n\n**Sekvencialní logika** těchto praktik je promyšlená. Prostrace zakládají refuge – základní vazbu k objektům útočiště a probouzejí bódhičittu. Tento základ je esenciální pro všechny následující praktiky. Tím, že prostrace pracují primárně s hrubými fyzickými obscuracemi a pýchou, připravují praktikující na hlubší purifikaci emočních a mentálních vzorců prostřednictvím Vadžrasattvy. Jak učila Džetsün Khandró Rinpočhe: „Pokud stále prožíváte pýchu a chybí vám pokora, i když jste provedli 300 000 prostrace, není to dost. Nekonečné opakování praxe ngöndrö bez laskavé motivace by mělo malý efekt.\"\n\nPraktikující nemohou postupovat k Mahámudře nebo tantrickým sadhánám bez dokončení ngöndrö. Jak zdůraznil Šamarpa: „Bylo řečeno, že Předběžné praktiky jsou hlubší a důležitější než hlavní praxe. Je to proto, že Ngöndrö vytváří nezbytné podmínky pro praxi Mahámudry.\" I Tsongkhapa, zakladatel školy Gelug a jeden z největších tibetských učenců, byl instruován Mandžušrím, aby podstoupil intenzivní ngöndrö praktiky k dosažení průlomového pochopení prázdnoty. Příklad Tsonkhapa provedl 3 500 000 prostrace (35 sad po 100 000), což ilustruje, že ngöndrö není „začátečnickou\" praxí, ale základem celé cesty.\n\n## Správná technika podle instrukcí Karma Kagyu\n\n**Vstupní pozice** pro plnou prostraci vyžaduje vzpřímenou postavu s nohama pohromadě a vytvořením modlitební mudry (*añjali mudrā*): dlaně stlačené u základny i na špičkách prstů, prsty natažené směrem nahoru a palce schované dovnitř, čímž vzniká dutý prostor uvnitř symbolizující obětinu. Tato mudra se postupně zvedá lehce nad hlavu a poté se dotýká tří míst podle přesného pořadí.\n\n**Sekvence mudry tří bran** začíná dotykem koruny hlavy nebo čela (symbolizuje tělo Buddhy, požehnání osvíceného těla, očišťování tělesných obscurací), pokračuje k hrdlu (symbolizuje řeč Buddhy, požehnání osvícené řeči, očišťování obscurací řeči) a končí u srdečního centra (symbolizuje mysl Buddhy, požehnání osvícené mysli, očišťování mentálních obscurací). Po dotyku srdce následuje sestup na zem.\n\n**Fyzické provedení plné prostrace** vyžaduje, aby praktikující po dotyku srdce klesl na zem a natáhl se plně ploše s celým tělem nataženým, paže protažené dopředu nad hlavou, dlaně položené na stranách hlavy. Pět bodů musí dotknout země: obě kolena, obě ruce a čelo. **Čelo musí dotknou země** – nedodržení tohoto bodu může podle učení vytvořit negativní karmu. Tělo by mělo být rovné, nezkroucené. Po dotyku čela země by praktikující měl **rychle vstát**, zcela napřímit tělo a vrátit se do stojící pozice s modlitební mudrou. Nedokonalé napřímení mezi prostracemi nebo příliš dlouhé setrvání v poloze leže na zemi se podle tradičních učení považuje za vytváření negativní karmy.\n\n**Krátká neboli poloviční prostrace** využívá stejnou sekvenci mudry (koruna, hrdlo, srdce), ale praktikující klekne, položí čelo na podlahu s dlaněmi plochými po stranách a rychle vstane. Tato varianta se používá při krátkých poklonách při vstupu do chrámů nebo před učiteli.\n\n**Dýchání a rytmus** by měly být přirozené. Typická rychlost je přibližně 400 prostrace za hodinu s přestávkami, což znamená, že každá prostrace trvá 6-8 vteřin. V intenzivním retreatu praktikující obvykle provádějí 3000 prostrace denně (čtyři sezení po 750), což vyžaduje přibližně 8 hodin s přestávkami. V běžném životě je běžné provádět 100-300 prostrace denně, což vede k dokončení 100 000 za 1-3 roky.\n\n**Fyzická ochrana a úpravy**: Pro ochranu kolen a zápěstí se doporučuje používat chrániče kolen a prostracové desky (hladké dřevěné desky pro klouzání). Pro osoby s fyzickými omezeními jsou přijatelné poloviční prostrace z kolen (*kumčhag*), symbolické prostrace s ruční mudrou vsedě, nebo vizualizované prostrace. Lama Zopa Rinpočhe učil, že pokud jsou vizualizované prostrace prováděny správně s představou nespočetných násobených těl provádějících prostrace, mohou generovat dokonce více zásluh než fyzické. Učitelé mohou upravit počty pro studenty, kteří nemohou dokončit 100 000.\n\n## Vizualizace stromu útočiště specifická pro tradici Karma Kagyu\n\n**Základní prostředí vizualizace** se odehrává v krásném parku s měkkými loukami a jemnými zvířaty. V centru je exkvizitní jezerem lotosu (*padma*), z jehož středu vyrůstá zlatý kmen přání-splňujícího stromu (*Pagsam Junshing* / *dpag bsam sbyung shing*). Jeden kmen se rozděluje do pěti hlavních větví, které představují kompletní pole útočiště neboli „pole akumulace\" (*tshogs zhing*) – nejvýše mocný objekt pro generování zásluh.\n\n**Centrální větev** (kmen/střed) nese hlavní postavu – **Vadžradháru** (*Dordže Čhang* / *rdo rje 'chang*) jako Kořenového gurua neboli Lamu. Vadžradháry je hluboké modré barvy, drží vadžru a zvon v překřížených rukou, sedí ve vadžrové pozici na bílém měsíci, mnohobarevném lotosu a lví trůnu. Ztělesňuje všechny Tři klenoty a všechny objekty útočiště. Menší Vadžradháru se objevuje na vrcholu stromu reprezentující zdroj lineage. Kolem centrální postavy jsou **linioví mistři Kagyu** včetně Tilópy, Narópy, Marpy, Milarépy, Gampópy a následných Karmapů, linioví držitelé „naskládaní jeden na druhém\" nebo shromáždění kolem centrální postavy v tom, co se nazývá Zlatý rosary (*gser phreng*) – nepřerušený přenos od Vadžradháry po vlastního osobního učitele.\n\n**Přední/východní větev** (před centrální postavou) nese **yidamy** (meditační božstva/Buddha-postavy) včetně Vadžrajóginy, Heruky Čhakrasamvary a dalších tantrických božstev. Host meditačních božstev všech mandal, každý obklopen svým doprovodem. **Pravá/jižní větev** nese **Buddhy** (*Sangye*) – Buddhy minulosti, přítomnosti a budoucnosti, Buddhy deseti směrů. V centru je Šakjamuni Buddha, červený Amitábha Buddha a modrý Buddha medicíny. Přibližně deset Buddhů reprezentuje deset směrů, obklopeni duhou.\n\n**Zadní/západní větev** (za centrální postavou) reprezentuje **Dharmu** (učení/písma) v podobě svatých textů, „Tři koše\" (*Tripitaka*), čistá dharmová učení jak realizace, tak transmise. **Levá/severní větev** nese **Sanghu** (duchovní komunitu) – osm velkých bódhisattvů s Avalókitéšvarou v centru, včetně Avalókitéšvary, Mandžušrího, Vadžrapániho, Táry atd. Před nimi sedí Šákjamuni dva hlavní učedníci: Šariputra a Maudgaljájána. Dále jsou zde *pratjékabuddhové* (solitérní realizátoři), *šrávakové* (posluchači/arhati), šestnáct starších a Vznešená sangha komunita, obklopeni duhou.\n\n**Pod stromem** (na mracích pod ním) jsou **dharmapalové** (ochránci dharmy) a strážci. Mahákála a další ochránci, v centru **Dordže Bernagčhen** (hlavní ochránce Karma Kagyu). Dakové, dakiny s moudrým okem a oceánem-podobný host ochránců, přibližně jedenáct ochranných božstev na mracích. Jezerem obklopená louka je naplněna množstvím zvířat, ptáků, mnichů a laiků provádějících prostrace a oběti v krásném, mírovém prostředí.\n\n**Kvalita vizualizace**: Všechny postavy jsou transparentní, tvořené ze světla. Pokud praktikující nedokáže vizualizovat jasně, měl by mít víru, že jsou přítomni. Každá skupina je obklopena „oceánem-podobným množstvím\" své vlastní třídy. Celé shromáždění je zářivé a čisté. Jak učil 9. Karmapa ve svém textu, tato vizualizace reprezentuje kompletní transmisní lineage od Vadžradháry po vlastního osobního učitele, ztělesňuje Tři klenoty a Tři kořeny a vytváří supremně mocné pole pro generování zásluh.\n\n## Specifická vizualizace během provádění prostrace\n\n**Počáteční nastavení** vyžaduje, aby praktikující vizualizoval sebe sama v obyčejné formě s mužskými příbuznými po pravici, ženskými příbuznými po levici, stojící v čele jako vůdce obrovského davu zahrnujícího **všechny mateřské cítící bytosti** (matky z minulých životů) – „cítící bytosti tak rozsáhlé jako prostor\" – všichni provádějící prostrace společně.\n\n**Během prostrace** probíhá klíčová purifikační vizualizace: Z pole zásluh (strom útočiště, objekty refugia) **vyzařují bílé nektarové paprsky** a **světla**. Mohou být vizualizovány jako světla emitující ze semenných slabik v srdcích objektů útočiště, proudící z těl všech postav refugia, vytékající z měsíčního disku u srdce Vadžradháry, nebo přicházející z pravého palce centrální postavy.\n\n**Vstup purifikačního světla**: Bílé světlo/nektar vstupuje **korunkovou aperturou** (vrchol hlavy) praktikujícího, proudí dolů shora a úplně vyplňuje celé tělo. **Vylučování obscurací** probíhá současně – negativní karma a obscurace opouští tělo póry kůže a dolními otevřeními (pro pevný a tekutý odpad). Obscurace se jeví jako **černý dehet a saze** (obecná negativita), **tmavá tekutina a tmavý dým** (obscurace), **hnis, krev, hlen, sopel** (nemoc a choroba), **hadi, štíři, pavouci, hmyz** (škodlivé vlivy duchů). Vše se rozpouští do země nebo mizí.\n\n**Vyplnění čistotou**: Tělo se stává úplně vyplněné bílým nektarem a světly, stává se **transparentním a jasným** jako „křišťálová váza naplněná mlékem\", tělo se stává povahou **jasného světla**. Praktikující prožívá úplné očištění. **Absorpce**: Replika pole zásluh (nebo celý strom útočiště) se absorbuje do praktikujícího, roztává se ve světlo a rozpouští se do jeho těla. Praktikující prožívá **jednotu** s objekty útočiště, jeho tělo, řeč a mysl se stávají neoddělitelné od vadžrového těla, řeči a mysli Tří klenotů.\n\n**Transformace pěti jedů**: Když pět bodů dotkne země, pět znečišťujících emocí opouští a rozpouští se v zemi, transformují se v pět moudrosti. Praktikující prožívá úplné očištění prostřednictvím rozpuštění mentálních jedů a přijetí požehnání od Tří klenotů.\n\n**Závěr sezení**: Všechny postavy stromu útočiště se rozpouštějí do centrální postavy (Guru jako Vadžradháru), centrální postava se rozpouští do praktikujícího. Praktikující zůstává v ne-objektifikujícím stavu prázdnoty a jasnosti, nesměrovaném k žádnému extrémnímu modu existence, prožívá úplné očištění a neoddělitelnost od objektů útočiště.\n\n## Refugiová modlitba a mantry\n\n**Plná verze refugiové modlitby** z textu 9. Karmapy, která se recituje během prostrace:\n\n„Já a všechny mateřské cítící bytosti tak rozsáhlé jako prostor / Uplynu k útočišti svatým vznešeným Gurům. / Uplynu k útočišti Yidamům a hostu jejich mandala božstev. / Uplynu k útočišti Požehnaným Buddhům. / Uplynu k útočišti Svaté Dharmě. / Uplynu k útočišti Vznešené Sangze. / Uplynu k útočišti k hostu Dakú, Dakini, Dharmapalů a ochránců, kteří mají oko neposkvrněného uvědomění.\"\n\n**Tibetská transliterace**: *„Dag dang namkhai tar dang nyam pai semchen tamchey chog chu dusum ji deshin shegpa tamchey chi ku sung tug yonten trinlay tamchay chigtu durpai ngowo jurpa...\"*\n\n**Standardní krátká verze**: „K Buddhovi, Dharmě a Sangze uprchám k útočišti až do osvícení. Prostřednictvím zásluh štědrosti a dalších dokonalostí kéž dosáhnu Buddhaství k prospěchu všech bytostí.\"\n\n**Metoda recitace**: Nejběžněji se recituje **jedna refugiová modlitba na jednu prostraci**. Prostrace se počítají: 100 000+ opakování. Někteří učitelé počítají refugiové modlitby místo prostrace. Recitace pokračuje kontinuálně během prostrace, udržuje rytmus: modlitba se dokončí, jak se dokončí jedna prostrace. Lze použít zápěstní málu (27 nebo 29 korálků) pro počítání.\n\n**Mantra Karmapa khyenno** (*Karmapa khyenno* / ཀརྨ་པ་མཁྱེན་ནོ།) znamená „Karmapa, znáš mě\" / „Karmapa, mysli na mě\" / „Karmapa, dbej na mě\". Je to suplikace k ztělesnění všech aktivit Buddhů, volání k guruovi/lineage ze srdce. Vznikla přirozeně z oddanosti tibetského lidu, formalizovaná přibližně v době 8. Karmapy Mikjö Dordže (1507-1554). Předbuddhistický tibetský zvyk volat „Khyenno!\" (Znáš mě!) k božstvům byl transformován v mantru s mocí pravých slov. V ngöndrö se primárně používá v sekci Guru jógy (po prostracích), ale může být recitována jako doplněk, vyvolává požehnání lineage Karmapů, recitována s oddaností 100 000+ krát v plné praxi.\n\n## Prostrace a akumulace zásluh\n\n**Kvantitativní zásluhy** podle súter citovaných v učeních vysvětlují, že každá prostrace generuje zásluhy rovnající se počtu atomů v zemi pokryté tělem praktikujícího. Tyto zásluhy přispívají k budoucímu bohatství, příznivým znovuzrozením a nakonec osvícení. Jedna prostrace vytváří příčiny k znovuzrození jako král otáčející kolem za tolik životů, kolik atomů bylo pokryto. Zásluhy srovnatelné s obětováním obrovského bohatství.\n\n**Kvalitativní zásluhy** se exponenciálně zvyšují, když jsou kombinovány s **motivací bódhičitty** (učí se, že se zvyšují 100 000krát). Obětování jediné prostrace Buddhovi s bódhičittou vytváří více zásluh než obětování rozsáhlého materiálního bohatství. Zásluhy dedikované všem cítícím bytostem se stávají nevyčerpatelnými. Když jsou zakotveny prázdnotou, přibližují se nekonceptuálním zásluhám.\n\n**Mnoho násobící metody** podle vadžrajánových učení zahrnují: Svatá místa (praxe na poutních místech nebo místech uskutečnění zvyšuje zásluhy), Svatý čas (praxe během příznivých dní jako plný měsíc, buddhistické svátky), Bódhičitta (osvícená mysl aspirující k prospěchu všech bytostí exponenciálně zvyšuje zásluhy), Mantry (specifické mantry mohou násobit efekty – např. recitace určitých manter 7x před prostracemi násobí zásluhy 100 000krát), Dedikace (správná dedikace na konci zabraňuje zásluhám být zničeny hněvem nebo negativitou).\n\n17. Karmapa učil: „Úspěšné dokončení ngöndrö není o provedení 100 000 prostrace. Pokud chceme vědět, zda ngöndrö funguje nebo ne, měli bychom zkontrolovat stav našich myslí. Kontrolují negativní emoce stále naši mysl, nebo se zmenšují?\" Tento přístup zdůrazňuje, že **transformace mysli** je konečnou měrou úspěchu, nikoli mechanické dokončení čísla.\n\n## Připojení k Vadžrasattva purifikaci a dalším praktikám\n\n**Sekvencialní purifikační proces** vyžaduje, aby prostrace byly dokončeny před přechodem k Vadžrasattvě, ačkoliv někteří učitelé povolují praktikujícím provádět několik opakování pozdějších praktik při současném primárním zaměření na prostrace. Prostrace purifikují obscurace spojené s tělem a aflikci pýchy. Vadžrasattva purifikuje obscurace spojené s řečí a nenávistí/averzí. Mandala obětování purifikuje obscurace mysli a připoutanosti. Guru jóga purifikuje obscurace všech tří (těla, řeči, mysli).\n\n**Jak prostrace připravují na Vadžrasattvu**: Zakládají refuge foundation – esenciální základ pro všechny následující praktiky. Tím, že adresují hrubší fyzické obscurace prostřednictvím prostrace, připravují praktikující jejich tělo a mysl na hlubší purifikaci praxe Vadžrasattvy. Pokoření ega prostřednictvím prostrace zjemňuje ego, aby mysl byla receptivnější pro rozpoznání negativity v praxi Vadžrasattvy. Dokončení 100 000 prostrace rozvíjí mentální a fyzickou disciplínu potřebnou pro udržitelnou recitaci Vadžrasattvy.\n\n**Vztah k mandala obětování**: Prostrace připravují na mandala obětování kultivací štědrosti – fyzický akt prostrace trénuje vzdání se připoutanosti k tělu a egu. Opakovaným poklonem se praktikující učí opouštět sebe-důležitost, což je připravuje mentálně dávat celý vesmír v mandala praxi. Prostrace začínají proces překonání lakomosti, který je dále rozvíjen v mandala praxi.\n\n**Vztah k guru józe**: Prostrace zakládají fundamenty pro guru jógu rozvíjením oddanosti – prostrace k stromu útočiště (s kořenovým guruem v centru) kultivuje oddanost esenciální pro guru jógu. Vizualizace během prostrace ukazuje gurua jako neoddělitelný od všech buddhů, připravuje na ultimátní sjednocení s myslí gurua v guru józe. Fyzický akt odevzdání připravuje praktikující na hlubší mentální a spirituální odevzdání vyžadované v guru józe.\n\n**Čtyři síly purifikace** (když jsou správně aplikovány během prostrace): Síla podpory/svědka (vizualizace a prostrace k refuge assembly poskytuje mocného svědka k vyznání), Síla lítosti (upřímná lítost nad minulými negativními činy), Síla nápravy (fyzický a mentální akt prostrace slouží jako protiklad), Síla řešení (závazek neopakovat škodlivé činy). Podle učitelů, zatímco karma jednoduše nezmizí, prostrace prováděné se správnou motivací a čtyřmi silami vytvářejí podmínky, kdy negativní karma **nemůže dozrát** nebo dozrává v oslabené formě.\n\n## Citáty a učení od mistrů Karma Kagyu\n\n**17. Karmapa Orgyen Trinle Dordže** o povaze prostrace vysvětlil: „Prostrace (*čhaksal*) v tibetštině má podle orální lineage v první části, *chak* (*phyag*), význam něčeho jako 'zametat pryč' jakékoliv škodlivé činy a obscurace, stejně jako zametáme nečistoty metlou. Pak, *tsal* ('tshal), znamená, že přijímáme požehnání osvíceného těla, řeči a mysli a získáváme všechny siddhí.\"\n\nO roli gurua v praxi učil: „Guru je esenciální: i když někteří lidé si myslí, že mohou praktikovat bez učitele. Možná si myslíme, že víme, jak dělat prostrace, ale je to učitel, kdo nám pomáhá pochopit povahu praxe tak, aby naše praxe transformovala naše mysli... Ultimátně, měřítkem úspěchu naší praxe leží v transformaci našich myslí.\"\n\nV Seattlu 2008 učil o třech typech prostrace a zdůraznil: „Prostrace s naší myslí znamená projevit hluboký respekt a cítit velké přesvědčení k osobě, před kterou se prosternujeme. Když provádíme autentickou prostraci, naše mysl je naplněna skutečným respektem... prostrace fungují jako protiláty; například... prostrace protijedem ke žárlivosti.\"\n\n**Gampopa** v *Drahokamu osvobození* začíná prostrací: „Prosternuji se k vznešenému Mandžušrí v mladistvé formě. Vzdávám hold Vítězným, jejich následovníkům, svaté Dharmě a lamům, kteří jsou jejich základem.\" V kapitole o duchovním mistru vysvětluje: „Oddanost mu 'prostřednictvím respektu' znamená provádění prostrace, rychlé vstávání, pokloněním hlavy, obcházením, vyjadřováním se s pocitem blízkosti ve správný čas, pohledem na něj střídavě bez nasycení, a tak dále. Příkladem je, jak Sudháná, syn obchodníka, sloužil svým duchovním mistrům.\"\n\n**Džamgön Kongtrül Lödro Thayé** napsal *Pochodeň jistoty*, brilantní a detailní komentář k textu 9. Karmapy „Vůz pro putování cestou osvobození\", který je standardním textem ngöndrö Karma Kagyu. Tento text popisuje Čtyři základní praktiky, které všichni praktikující vadžrajánového buddhismu musí dokončit, včetně praxe prostrace kombinované s refuge a bódhičittou. 17. Karmapa specificky vybral učit z tohoto textu během Kagyu Monlamu 2012-2013, protože „tématem Monlamu bylo připomínání lineage Džamgön Kongtruля.\" Tři vynikající současní mistři—Kalu Rinpočhe, Dešung Rinpočhe a Chögjam Trungpa Rinpočhe—všichni poskytli komentáře vysvětlující význam Pochodně jistoty pro současné studenty.\n\n**Milarepa a příběh jeho purifikace** ilustruje principy praxe. Jak učil Lama Zopa Rinpočhe: „Existuje mnoho různých předběžných praktik, sto tisíc toho, sto tisíc tamtoho. Nechat Milarépu stavět věž třikrát sám byl celý předběžnou praxí pro Milarépu. Stavění třikrát obsahovalo mnoho set tisíc prostrace, mnoho set tisíc manter Vadžrasattvy, mandala obětování, všech těchto věcí. Pokaždé, když Marpa pokáral Milarépu, byla to neuvěřitelně mocná purifikace, purifikující Milareputu negativní karmu. Pokaždé, když Marpa udeřil Milarépu, byla to neuvěřitelně mocná, purifikující tolik éonů negativní karmy.\"\n\n**Příběh finálního učení Milarépy Gampópovi** ilustruje důležitost oddané praxe. Když Gampópa dokončil své studium u Milarépy a připravoval se k odchodu, Milarepa řekl: „Mám ještě jedno poslední učení.\" Radostný Gampópa provedl devět prostrace a čekal na instrukce. Milarepa se otočil, zvedl své roucho a ukázal Gampópovi svůj zadek, který měl mozoly, které vypadaly, jako by byly napůl z masa a napůl z kamene. „Vidíš? Takto jsem dosáhl osvícení: sezením a meditací. Pokud to chceš dosáhnout v tomto životě, vynalož stejné úsilí. Toto je mé finální učení. Nemám co víc přidat.\"\n\n**Thrangu Rinpočhe** (1933-2023), který se stal jedním z předních učitelů lineage, osobně dokončil plných 100 000 prostrace. Z jeho biografie: „Tímto dokončil čtyři předběžné praktiky sta tisíc prostrace a tak dále v posloupnosti. Také provedl retreaty řady nezbytných praktik včetně Vadžrakilayi a Vadžrapániho.\"\n\n## Význam 100 000 prostrace a jejich akumulace\n\n**Tradiční počet 111 111** se skládá z 100 000 základních prostrace plus 11 111 dodatečných (10 procent „úrok\") k započtení chyb, přepočtů a nedokonalé praxe. Tento počet není arbitrární, ale vychází z tisíciletých zkušeností s transformačním procesem vyžadujícím takto rozsáhlou praxi.\n\n**Časová investice** vyžaduje značné odhodlání. Při přibližně 400 prostracích za hodinu s přestávkami praktikující dokončí 3000 prostrace za 8 hodin. Plné dokončení vyžaduje minimálně 45 dní v intenzivním retreatu (bez volných dní). V běžném životě to typicky trvá několik měsíců až let. Celkové hodiny pro všechny čtyři praxe ngöndrö: přibližně 1500 hodin. Tato rozsáhlá časová investice je záměrná – umožňuje hlubokou habituaci na oddanost a pokoru, fyzicky náročná povaha prolomuje odpor a ego, prodloužené praktické období umožňuje transformaci mysli a rozvíjí vytrvalost esenciální pro duchovní cestu.\n\n**Psychologické a spirituální efekty** se kumulují během tisíců opakování. Vytváří se hluboká habituace na oddanost a pokoru, fyzicky náročná povaha prolomuje odpor a ego, prodloužené praktické období umožňuje transformaci mysli a rozvíjí vytrvalost esenciální pro duchovní cestu. Praktikující často zažívají, jak se odhalují „vrstvy na vrstvách\" habituálních tendencí – praxe přináší nevědomé vzorce na povrch, ukazuje hloubku iluzí a pomáhá praktikujícím vidět hloubku jejich klamů.\n\n**Doktrinalní význam čísla** podle súter citovaných v učeních vysvětluje, že každá prostrace generuje zásluhy rovnající se počtu atomů v zemi pokryté tělem praktikujícího. Tyto zásluhy přispívají k budoucímu bohatství, příznivým znovuzrozením a nakonec osvícení. Když jsou dedikované všem cítícím bytostem s bódhičittou, zásluhy se stávají nevyčerpatelné. Jak učila Džetsün Khandró Rinpočhe: „Když, prostřednictvím stádií ngöndrö, sami přijdete s důvěrou ve svou Buddha přirozenost, od toho momentu již nejste závislí na jakékoliv metodě, praxi nebo meditaci. Ale dokud je nějaká obscurace mocnější než vaše důvěra ve vaši Buddha přirozenost, budete mít vždy někoho, před kým se prosternovat.\"\n\n**Pokračování praxe po dokončení**: Důležité je pochopit, že ngöndrö nikdy není „dokončeno\". Velcí mistři pokračují v prostracích po celý život – Trulšik Rinpočhe dělal 100 prostrace denně i ve svých osmdesátých letech, Dilgo Khjencie Rinpočhe udržoval ngöndrö jako svou hlavní praxi až do smrti, Tenga Rinpočhe pokračoval i po ztrátě končetin. Ken McLeod, zkušený učitel, jasně sdělil studentům: „Nikdy nebudou moci říct, že dokončili ngöndrö.\" Toto perspektivní posunutí je zásadní – ngöndrö není krok k překonání, ale živý základ celé cesty.\n\n## Běžné překážky a rady pro praktikující\n\n**Fyzické překážky** zahrnují bolest a zranění (kolena, záda, ramena, zápěstí), fyzické vyčerpání a únavu, což trvá déle pro starší praktikující nebo ty s fyzickými omezeními. Ochrana zahrnuje používání **prostracových desek** (hladké dřevěné desky pro klouzání), chrániče kolen a rukou, přestávky k vyhnutí se zranění, postupné budování – nepokusit se okamžitě o 1000+, správná forma – klouzat rukama dopředu spíše než „lámat\" záda, držet nohy pohromadě, tělo srovnané.\n\nPokud je bolest velmi silná, redukovat počty a postupně zvyšovat. Pokud je zraněný, provádět minimální prostrace (dokonce 3) k udržení kontinuity. Fyzická terapie nebo protahování mezi sezeními. Konzultovat s učitelem o modifikacích. Pro ty s fyzickými omezeními jsou přijatelné **poloviční prostrace** z kolen (*kumčhag*), **symbolické prostrace** s ruční mudrou vsedě, nebo **vizualizované prostrace** – Lama Zopa Rinpočhe učil, že pokud jsou prováděny správně, mohou generovat dokonce více zásluh.\n\n**Mentální a emocionální překážky** představují větší výzvu. Odpor a pochybnost se manifestují jako zpochybňování hodnoty nebo účelu praxe, myšlenky „toto je zastaralé\" nebo „není relevantní pro mou kulturu\", zda „jaký je smysl?\" zejména během těžkých období, pochybování o spojení s lineage nebo stromem útočiště. Nuda a monotonie způsobují, že mysl extenzivně bloudí, je obtížné udržet soustředění sezení po sezení, nekonečné myšlenky, vzpomínky a plány vznikají, pocit, že „nic se neděje\".\n\n**Znechucení** se objevuje, když čísla se zdají ohromující (100 000 se zdá nemožné), pokrok se zdá příliš pomalý, srovnávání s ostatními, kteří dokončí rychleji, narazení na „zdi\", kde motivace zmizí. **Pýcha a ego backlash** vytvářejí sofistikované argumenty proti pokračování – „ještě nejsem připraven\" se stává výmluvou, „vím lépe než tato tradiční praxe\", myšlenka, že praxe je „pod\" úrovní praktikujícího. Životní okolnosti jako rodinné odpovědnosti činí čas vzácným, pracovní nároky interferují s praktickým rozvrhem, nedostatek vhodného prostoru pro plné prostrace, sociální rozpaky o praxi.\n\n**Spirituální překážky** podle Džetsün Khandró Rinpočhe a dalších učitelů zahrnují odhalení obscurací – staré vzpomínky a nerozřešené problémy se vynořují, skryté vrstvy hněvu, žárlivosti a self-cherishing se stávají zjevnými, což může být psychologicky náročné čelit těmto vzorcům. **Fundamentální neochota**: učitelé poznamenávají, že překážky odhalují „skutečně nemáte naspěch dosáhnout osvícení\", mezera mezi aspirací a aktualizací se stává bolestivě jasnou, pohodlné návyky odolávají transformaci.\n\n**Praktické rady pro udržení praxe** začínají s esenciálním postojem. **Udržujte bódhičittu centrální**: Začněte každé sezení generováním přání prospět všem bytostem, pamatujte, že praktikujete pro osvobození všech cítících bytostí, ne pro osobní úspěch, dedikujte zásluhy na konci každého sezení. **Generujte správnou motivaci denně**: Kontemplujte čtyři myšlenky, které otáčejí mysl k dharme, pamatujte vzácné lidské zrození, nepermanenci, karmu a utrpení samsáry, pravidelně revidujte učení lamrim.\n\n**Důvěřujte procesu**: Pamatujte, že **velcí mistři** (Dilgo Khjencie, Trulšik Rinpočhe, Tenga Rinpočhe) pokračovali v ngöndrö jako denní praxi po celý život. Lama Tsongkhapa provedl 3 500 000 prostrace (35 sad po 100 000). Praxe není „začátečnické\" cvičení k rychlému překonání.\n\n**Praktické motivační strategie**: Rozdělit to do zvládnutelných cílů – někteří učitelé navrhují dělat sady po 10 000 spíše než soustředit se na 100 000. Dokončit 10 000, pak projít všemi čtyřmi praktikami, pak opakovat (dělat to 10krát). Slavit menší milníky. **Zaveďte udržitelnou rutinu**: Denní praxe je esenciální – i když jen 35-100 prostrace/den. Ranní praxe funguje nejlépe pro mnohé. **Udržujte kontinuitu**: Dělejte alespoň několik každý den; pokud vynecháte den, některé tradice říkají restartovat počítání (ačkoliv to se liší podle učitele). Připojte se k praktické skupině pro vzájemnou podporu.\n\n**Neporovnávejte**: Každý má jiné tempo založené na věku, zdraví, rodinné situaci. 10 000 za 10 dní není realistické pro většinu Západňanů s prací a rodinami. **Není to závod** – kvalita záleží více než rychlost. **Pracujte s překážkami**: Prohlížejte překážky jako samotnou praxi – odhalují, co potřebuje být purifikováno. Když se objeví odpor, zkoumejte: „Kde narážím na odpor a co to znamená?\" Překážky jsou příležitostmi vidět hloubku obscurací.\n\n**Důležitost správné motivace a bódhičitty** je kritická. Podle učení Karma Kagyu motivace transformuje celou praxi. Bez správné motivace se prostrace stávají pouhým fyzickým cvičením. S bódhičittou se každá prostrace stává **příčinou osvícení**. Motivace určuje, zda praxe vytváří zásluhy pro osvobození nebo jen světský prospěch. Každý den při probuzení: „Kéž dosáhnu buddhaství k prospěchu všech cítících bytostí.\" Generujte Čtyři neměřitelnosti: Kéž všechny bytosti mají štěstí a jeho příčiny, Kéž všechny bytosti jsou osvobozeny od utrpení a jeho příčin, Kéž všechny bytosti nikdy nejsou odděleny od radosti, Kéž všechny bytosti přebývají v rovnováze, osvobozeny od připoutanosti a averze.\n\n**Počítání a sledování pokroku** využívá tradiční metody jako málu korálků (108 korálků, jeden korál na prostraci, kompletní mála = 100 prostrace) nebo moderní elektronické počítadla (tamagotchi-podobné počítadla, tlačítko po každé prostraci, „iMala\" smartphone aplikace). **Esenciální je udržovat notebook** sledující denní praxi – zaznamenávat datum a počet dokončený každé sezení pomáhá udržet motivaci vidění pokroku. Učitelé často požadují vidět tyto záznamy.\n\nPo dokončení 100 000 prostrace **konzultujte s učitelem** – nepředpokládejte, že jste automaticky dokončeni. Požádejte o povolení přejít k praxi Vadžrasattvy. Učitel posoudí, zda vaše pýcha byla dostatečně purifikována, rozvinuli jste adekvátní oddanost, vaše mysl je receptivní pro hlubší purifikaci, došlo k reálné transformaci (ne jen dokončení čísel). Znaky připravenosti zahrnují: upřímná pokora se rozvinula, silná oddanost k Třem klenotům, ochota pokračovat bez odporu, pochopení, že ngöndrö není jen „předběžné\", ale základ cesty.\n\n## Závěr: Živá tradice transformace\n\nProstrace v tradici Karma Kagyu představují sofistikovanou integraci historického přenosu (nepřerušená lineage od Vadžradháry přes Karmapy), doktrinalního základu (zakořeněno v Mádhjamakovské filozofii a vadžrajánové metodologii), praktické aplikace (fyzické, verbální a mentální zapojení), soteriologického účelu (příprava na ultimátní realizaci Mahámudry) a akumulace zásluh (vytváření podmínek pro osvícení prostřednictvím dvou akumulací).\n\nJak učil 17. Karmapa: „Dharmová praxe není oddělená od našeho života. Stáváme se dharmou. Dharma se stává naším životem.\" Prostrace slouží jako základ pro pokročilou praxi, kompletní cestu samy o sobě, transformační praxi pro tělo, řeč a mysl, prostředek spojení s požehnání lineage, metodu purifikace a akumulace zásluh a přípravu na realizaci povahy mysli v Mahámudře.\n\nTradice Karma Kagyu pokračuje v rozkvětu globálně s 17. Karmapou poskytujícím současné vedení, zavedené tříleté retreat centra po celém světě, aktivní dharma centra učící a podporující praxi ngöndrö, tisíce praktikujících dokončující předběžné praktiky ročně a pokračující přenos „šepnuté lineage\" v nepřerušeném řetězci. Pro vážné praktikující prostrace nejsou překážkou k překonání, ale hlubokou metodou purifikace obscurací, akumulace zásluh a zakládání neotřesitelného základu nezbytného pro všechny pokročilé vadžrajánové praktiky.",
  "tags": [
    "budhismus"
  ],
  "category": "BU",
  "metadata": {
    "readingTime": "20 min",
    "repo": "prostrations"
  },
  "id": "article-1761558396836",
  "date": "2025-10-27",
  "title.en": "Postrations",
  "description.en": "Prostrations in the Karma Kagyu Tradition: A Complete Guide to Practice and Realization",
  "markdown.en": "# Prostrations in the Karma Kagyu Tradition: A Complete Guide to Practice and Realization\n\nThe first of the Four Basic Exercises in the Karma Kagyu Tradition, **prostrations or prostrations** (Tib. *phyag 'tshal ba* / *chaktsal*), is a profound spiritual practice that simultaneously engages the body, speech, and mind. Prostrations are not merely a physical exercise or ritual formality, but a sophisticated method of purifying obscurations and accumulating merit that prepares the practitioner for deeper realizations of Mahamudra. In the lineage from Vajradhara through Tilopa, Naropa, Marpa, Milarepa, Gampopa, and the current 17th Karmapa, prostrations form an irreplaceable foundation of tantric-Buddhist education.\n\n## Doctrinal significance of prostration in the Karma Kagyu tradition\n\n**Sanskrit philosophical basis** of prostration stems from the Mahayana understanding of two accumulations (Tib. *tshogs gnyis*) – the accumulation of merit (*bsod nams kyi tshogs*) and the accumulation of wisdom (*ye shes kyi tshogs*), which together constitute the causal conditions for enlightenment. Prostrations primarily build the accumulation of merit, creating favorable conditions for spiritual progress and the ability to realize emptiness. While the merits created with conceptual grasping remain dualistic, their combination with bodhicitta (the desire for the enlightenment of all beings) makes them inexhaustible.\n\nGampopa (1079-1153), who in his epochal synthesis combined the Kadampa tradition emphasizing the gradual path with the transmission of Mahamudra from Milarepa, laid the foundations for a structured approach to preliminary practices. In the text *The Gem of Liberation* (*Dam chos yid bzhin nor bu thar pa rin po che'i rgyan*), he explains that prostrations are a key way in which a practitioner expresses respect and devotion to a spiritual master: \"We express devotion by bowing, quickly standing up, bowing the head, going around, showing proximity at the right moment, and gazing at the master insatiably.\" He exemplified this approach by Sudhana, the son of a merchant who served his spiritual masters with complete devotion.\n\n**The developmental position in the lineage** of prostrations was achieved in the 16th century, when the 9th Karmapa Wangchuk Dorje (1556-1603) wrote the canonical text *Pagiam dröpä'i shingta* (*'phags lam bgrod pa'i shing rta*) - \"The Vehicle for Traveling the Noble Path\". This text, which still forms the standard practice of Karma Kagyu ngöndrö, accurately described the structure of the refuge tree, visualizations, and the technique of performing prostration. In the 19th century, Jamgön Kongtrül Lödro Thayé (1813-1900) created an authoritative commentary on this text, *Nedon dronme* (*nges don sgron me*) – \"The Torch of Certainty\", which greatly popularized the practice of ngöndrö.\n\nThe current 17th Karmapa, Orgyen Trinle Dorje, introduced both an updated version of the 9th Karmapa's text with new lineage supplications, and an abridged contemporary version, \"Ngöndrö for Our Present Time\", which takes into account the different living conditions of Western and modern practitioners. In his teaching in Seattle in 2008, he explained: \"The key points of all practices are to gather accumulations and to purify negative actions and obscurations. There is no practice that is not included in these two.\"\n\n## The Three Gates of Purification by Prostrations\n\n**The triadic structure of purification** (Tib. *lus ngag yid gsum* / sku gsung thugs gsum) is the core of the purification mechanics of prostration. In traditional terminology, *chak* (phyag) means \"sweeping away\" harmful actions and obscurations, like sweeping away impurities with a broom, while *tsal* ('tshal) means receiving the blessings of enlightened body, speech, and mind and gaining all the siddhis.\n\n**The first gate - purification of the body** (*lus* / *ku*) is achieved by physically touching the crown of the head with folded hands in prayer mudra and by prostration itself. This physical act purifies the negative karma associated with the body - killing, stealing, and sexual misconduct. When the five points of the body (both knees, both hands and forehead) touch the ground, the five defilements (the five poisons – anger, desire, ignorance, pride, jealousy) leave the body and transform into the five wisdoms: anger into mirror wisdom, desire into discriminating wisdom, ignorance into the wisdom of dharmadha, pride into the wisdom of equality and jealousy into all-realizing wisdom. Symbolically, the practitioner receives the blessing of the vajra body of the Buddha and all the objects of refuge.\n\n**The Second Gate – Purification of Speech** (*ngag* / *sung*) is accomplished by touching the throat with the prayer mudra and reciting the prayer for refuge. This purifies the negative karmic force associated with speech – lying, distracted speech, abusive words and unnecessary chatter. The practitioner receives the blessing of the Buddha's Vajra speech and awakens the qualities of enlightened communication. Continuous recitation of the refuge prayer during thousands of prostrations creates deep habits of devotion and trust in the Three Jewels.\n\n**The third gate – purification of the mind** (*yid* / *thug*) occurs by touching the heart center with the prayer mudra and maintaining visualization with one-pointed concentration. It purifies negative mental actions – greed, ill will and wrong views. In addition, it removes cognitive obscurations (*shé-drib*, *jñeyāvaraṇa*), which are subtler than emotional obscurations and arise from grasping phenomena as truly existing. The practitioner receives the blessing of the Buddha’s vajra mind, which creates the conditions for enlightened wisdom and direct perception of emptiness.\n\n**The synchronization of the three gates** is considered essential. As the 17th Karmapa taught: “There are three types of prostration – physical prostration with the body, prostration through speech, which is verbal praise and homage celebrating the positive qualities of the teacher, and prostration with the mind, which means showing deep respect and feeling great conviction for the person before whom we prostrate. When we perform authentic prostration, our mind is filled with true respect.”\n\n## Place of Prostration in the Four Basic Practices\n\n**The structural context of ngöndrö** (*sngon 'gro*, literally “that which goes before”) includes external and internal preliminary practices. The external or general preliminary practices, called the “Four Thoughts That Turn the Mind to the Dharma,” include contemplation of the precious human birth, death, and impermanence, karma, and the suffering of samsara. These contemplations generate authentic renunciation and create motivation for practice.\n\n**The Inner or Special Preliminary Practices** consist of four main exercises, each traditionally performed 100,000 times (plus an additional 11,111 to ensure accuracy, for a total of 111,111):\n\nThe first practice is **refuge and prostration with bodhicitta**, which purifies pride and egoic grasping. The practitioner clings to the Three Jewels (Buddha, Dharma, Sangha) and the Three Roots (Lama, Yidam, protectors) while simultaneously generating the aspiration to liberate all sentient beings. The second practice is **recitation of the hundred-syllable Vajrasattva mantra** (100,000 repetitions), which purifies hatred and aversion and removes negative karma from countless past lives. The third is **mandala offering** (100,000 repetitions), which purifies attachment by mentally giving the entire universe as an offering. The fourth practice is **guru yoga** (100,000 repetitions of the Karmapa khyenno mantra), which purifies all obscurations and opens the mind to the blessings of the lineage.\n\nThe **sequential logic** of these practices is thoughtful. The prostrations establish refuge—a fundamental attachment to the objects of refuge—and awaken bodhicitta. This foundation is essential for all subsequent practices. By working primarily with gross physical obscurations and pride, the prostrations prepare the practitioner for the deeper purification of emotional and mental patterns through Vajrasattva. As Jetsün Khandro Rinpoche taught, “If you still experience pride and lack humility even after you have performed 300,000 prostrations, it is not enough. Endless repetition of the ngöndrö practice without kind motivation would have little effect.”\n\nPractitioners cannot advance to Mahamudra or tantric sadhanas without completing the ngöndrö. As Shamarpa pointed out: \"It has been said that the Preliminary Practices are deeper and more important than the main practice. This is because Ngöndrö creates the necessary conditions for the practice of Mahamudra.\" Even Tsongkhapa, the founder of the Gelug school and one of the greatest Tibetan scholars, was instructed by Manjushri to undergo intensive Ngöndrö practices to achieve a breakthrough understanding of emptiness. Tsongkhapa's example of performing 3,500,000 prostrations (35 sets of 100,000), illustrates that Ngöndrö is not a \"beginner's\" practice, but the foundation of the entire path.\n\n## Proper technique according to Karma Kagyu instructions\n\n**The entry position** for full prostration requires an upright posture with the feet together and the formation of the prayer mudra (*añjali mudrā*): the palms pressed together at the base and tips of the fingers, the fingers extended upwards and the thumbs tucked inwards, creating a hollow space inside symbolizing the offering. This mudra is gradually raised slightly above the head and then touched in three places in a precise order.\n\n**The sequence of the mudra of the three gates** begins with a touch to the crown of the head or forehead (symbolizing the body of the Buddha, blessing the enlightened body, purifying bodily obscurations), continues to the throat (symbolizing the speech of the Buddha, blessing the enlightened speech, purifying the obscurations of speech) and ends at the heart center (symbolizing the mind of the Buddha, blessing the enlightened mind, purifying mental obscurations). After touching the heart, the descent to the ground follows.\n\n**The physical execution of full prostration** requires the practitioner to drop to the ground after touching the heart and lie down fully flat with the entire body extended, arms extended forward above the head, palms placed on the sides of the head. Five points must touch the ground: both knees, both hands and forehead. **The forehead must touch the ground** - failure to do so can create negative karma, according to the teachings. The body should be straight, not twisted. After touching the forehead to the ground, the practitioner should **quickly stand up**, fully straighten the body, and return to the standing position with the prayer mudra. Imperfect straightening between prostrations or remaining in the lying position on the ground for too long is considered by traditional teachings to create negative karma.\n\n**Short or half prostration** uses the same mudra sequence (crown, throat, heart), but the practitioner kneels, places the forehead on the floor with the palms flat at the sides, and quickly stands up. This variation is used for short prostrations when entering temples or before teachers.\n\n**Breathing and rhythm** should be natural. A typical rate is approximately 400 prostrations per hour with breaks, meaning that each prostration lasts 6-8 seconds. In an intensive retreat, practitioners typically perform 3,000 prostrations per day (four sessions of 750), requiring approximately 8 hours with breaks. In everyday life, it is common to perform 100-300 prostrations per day, leading to the completion of 100,000 in 1-3 years.\n\n**Physical Protection and Modifications**: Knee pads and prostration boards (smooth wooden boards for gliding) are recommended to protect the knees and wrists. For those with physical limitations, half kneeling prostrations (*kumchag*), symbolic prostrations with seated hand mudra, or visualized prostrations are acceptable. Lama Zopa Rinpoche taught that if visualized prostrations are done correctly with the idea of ​​countless multiplied bodies performing prostrations, they can generate even more merit than physical ones. Teachers may adjust the numbers for students who cannot complete 100,000.\n\n## Karma Kagyu-specific visualization of the refuge tree\n\n**The basic visualization setting** takes place in a beautiful park with soft meadows and gentle animals. In the center is an exquisite lotus lake (*padma*), from the center of which grows the golden trunk of the wish-fulfilling tree (*Pagsam Junshing* / *dpag bsam sbyung shing*). One trunk divides into five main branches, which represent the complete refuge field or \"accumulation field\" (*tshogs zhing*) - the most powerful object for generating merit.\n\nThe **Central Branch** (trunk/center) bears the main figure – **Vajradhara** (*Dorje Chang* / *rdo rje 'chang*) as the Root Guru or Lama. Vajradhara is deep blue in color, holding a vajra and bell in crossed hands, seated in the vajra position on a white moon, multi-colored lotus, and lion throne. He embodies all the Three Jewels and all the objects of refuge. A lesser Vajradhara appears at the top of the tree representing the source of the lineage. Around the central figure are the **Kagyu lineage masters** including Tilopa, Naropa, Marpa, Milarepa, Gampopa, and the subsequent Karmapas, lineage holders \"stacked one on top of the other\" or gathered around the central figure in what is called the Golden Rosary (*gser phreng*) – an unbroken transmission from Vajradhara to one's own personal teacher.\n\n**The **Front/Eastern Branch** (in front of the central figure) carries **Yidamas** (meditation deities/Buddha-figures) including Vajrayogina, Heruka Chakrasamvara and other Tantric deities. A host of meditation deities of all the mandalas, each surrounded by their entourage. **The **Right/Southern Branch** carries **Buddhas** (*Sangya*) – Buddhas of the past, present and future, Buddhas of the ten directions. In the centre is Shakyamuni Buddha, the red Amitabha Buddha and the blue Medicine Buddha. Approximately ten Buddhas represent the ten directions, surrounded by a rainbow.\n\n**The **Rear/West Branch** (behind the central figure) represents **Dharma** (teachings/scriptures) in the form of the holy texts, the \"Three Baskets\" (*Tripitaka*), the pure Dharma teachings of both realization and transmission. **The left/northern branch** carries the **Sangha** (spiritual community) – eight great bodhisattvas with Avalokiteshvara in the center, including Avalokiteshvara, Manjushri, Vajrapani, Tara, etc. In front of them are Shakyamuni's two main disciples: Shariputra and Maudgalyana. Next are the *pratyekabuddhas* (solitary realizers), *sravakas* (hearers/arhats), sixteen elders, and the Noble Sangha community, surrounded by a rainbow.\n\n**Under the tree** (on the clouds below) are the **dharmapalas** (protectors of the dharma) and guardians. Mahakala and other protectors, in the center **Dorje Bernagchen** (chief protector of the Karma Kagyu). Dakas, dakinis with a wise eye and an ocean-like host of protectors, approximately eleven protective deities on the clouds. The meadow surrounded by the lake is filled with a multitude of animals, birds, monks, and lay people performing prostrations and offerings in a beautiful, peaceful setting.\n\n**Quality of visualization**: All figures are transparent, made of light. If the practitioner cannot visualize clearly, he should have faith that they are present. Each group is surrounded by an \"ocean-like multitude\" of their own class. The entire assembly is radiant and pure. As the 9th Karmapa taught in his text, this visualization represents the complete transmission lineage from Vajradhara to his own personal teacher, embodying the Three Jewels and the Three Roots, and creating a supremely powerful field for generating merit.\n\n## Specific visualization while performing prostration\n\n**The initial setup** requires the practitioner to visualize themselves in ordinary form with male relatives on the right, female relatives on the left, standing at the head as the leader of a vast crowd including **all the maternal sentient beings** (mothers from past lives) – \"sentient beings as vast as space\" – all performing prostrations together.\n\n**During prostration**, a key purifying visualization takes place: From the field of merit (refuge tree, objects of refuge) **white nectar rays** and **lights** radiate. They can be visualized as lights emitting from the seed syllables in the hearts of the objects of refuge, flowing from the bodies of all the figures of refuge, emanating from the moon disk at the heart of Vajradhara, or coming from the right thumb of the central figure.\n\n**Entry of Purifying Light**: White light/nectar enters through the **crown aperture** (top of the head) of the practitioner, flows down from above and completely fills the entire body. **Excretion of obscurations** occurs simultaneously - negative karma and obscurations leave the body through the pores of the skin and the lower openings (for solid and liquid waste). The obscurations appear as **black tar and soot** (general negativity), **dark liquid and dark smoke** (obscuration), **pus, blood, mucus, snot** (illness and disease), **snakes, scorpions, spiders, insects** (harmful influences of spirits). All dissolve into the ground or disappear.\n\n**Filling with Purity**: The body becomes completely filled with white nectar and lights, becoming **transparent and clear** like a \"crystal vase filled with milk\", the body becomes of the nature of **clear light**. The practitioner experiences complete purification. **Absorption**: A replica of the field of merit (or the entire refuge tree) is absorbed into the practitioner, melting into light and dissolving into his body. The practitioner experiences **oneness** with the objects of refuge, his body, speech and mind becoming inseparable from the vajra body, speech and mind of the Three Jewels.\n\n**Transformation of the Five Poisons**: When the five points touch the ground, the five defilements of emotion leave and dissolve in the ground, transforming into the five wisdoms. The practitioner experiences complete purification through the dissolution of mental poisons and the reception of blessings from the Three Jewels.\n\n**End of the session**: All the figures of the refuge tree dissolve into the central figure (the Guru as Vajradhara), the central figure dissolves into the practitioner. The practitioner remains in a non-objectifying state of emptiness and clarity, not directed towards any extreme mode of existence, experiencing complete purification and inseparability from the objects of refuge.\n\n## Refuge Prayer and Mantras\n\n**Full version of the Refuge Prayer** from the text of the 9th Karmapa, recited during prostration:\n\n\"I and all maternal sentient beings as vast as space / I go for refuge to the holy exalted Gurus. / I go for refuge to the Yidams and their mandala of deities. / I go for refuge to the Blessed Buddhas. / I go for refuge to the Holy Dharma. / I go for refuge to the Noble Sangza. / I go for refuge to the host of the Dakus, Dakinis, Dharmapalas and protectors who have the eye of undefiled awareness.\"\n\n**Tibetan Transliteration**: *\"Dag dang namkhai tar dang nyam pai semchen tamchey chog chu dusum ji deshin shegpa tamchey chi ku sung tug yonten trinlay tamchay chigtu durpai ngowo jurpa...\"*\n\n**Standard Short Version**: \"To the Buddha, the Dharma, and the Sangha I take refuge until enlightenment. Through the merit of generosity and other perfections, may I attain Buddhahood for the benefit of all beings.\"\n\n**Method of Recitation**: The most common recitation is **one refuge prayer per prostration**. Prostrations are counted: 100,000+ repetitions. Some teachers count refuge prayers instead of prostrations. The recitation continues continuously during the prostration, maintaining a rhythm: the prayer is completed as one prostration is completed. A wrist mala (27 or 29 beads) can be used for counting.\n\n**Karmapa khyenno mantra** (*Karmapa khyenno* / ཀརྨ་པ་མཁྱེན་ནོ།) means \"Karmapa, you know me\" / \"Karmapa, think of me\" / \"Karmapa, take care of me\". It is a supplication to the embodiment of all the activities of the Buddhas, a call to the guru/lineage from the heart. It arose naturally from the devotion of the Tibetan people, formalized around the time of the 8th Karmapa Mikyo Dorje (1507-1554). The pre-Buddhist Tibetan custom of calling \"Khyenno!\" (You know me!) to deities was transformed into a mantra with the power of true words. In ngöndrö it is primarily used in the Guru Yoga section (after prostrations), but can be recited as a supplement, invoking the blessings of the Karmapa lineage, recited with devotion 100,000+ times in full practice.\n\n## Prostrations and Accumulation of Merit\n\n**Quantitative merit**, according to the sutras cited in the teachings, explains that each prostration generates merit equal to the number of atoms in the earth covered by the practitioner's body. This merit contributes to future wealth, auspicious rebirths, and ultimately enlightenment. One prostration creates the causes for rebirth as a king turning a wheel for as many lives as the atoms covered. Merit comparable to sacrificing vast wealth.\n\n**Qualitative merit** increases exponentially when combined with **bodhicitta motivation** (it is taught that it increases 100,000 times). Offering a single prostration to the Buddha with bodhicitta creates more merit than offering vast material wealth. Merit dedicated to all sentient beings becomes inexhaustible. When grounded in emptiness, they approach non-conceptual merit.\n\n**Many multiplying methods** according to Vajrayana teachings include: Holy Places (practice at pilgrimage sites or places of realization increases merit), Holy Time (practice during auspicious days such as full moons, Buddhist holidays), Bodhicitta (an enlightened mind aspiring to benefit all beings increases merit exponentially), Mantras (specific mantras can multiply effects - e.g. reciting certain mantras 7 times before prostrations multiplies merit 100,000 times), Dedication (proper dedication at the end prevents merit from being destroyed by anger or negativity).\n\nThe 17th Karmapa taught: “Successfully completing ngöndrö is not about doing 100,000 prostrations. If we want to know whether ngöndrö is working or not, we should check the state of our minds. Are negative emotions still controlling our minds, or are they diminishing?” This approach emphasizes that **transformation of the mind** is the ultimate measure of success, not the mechanical completion of a number.\n\n## Connecting to Vajrasattva Purification and Other Practices\n\n**The sequential purification process** requires that the prostrations be completed before moving on to Vajrasattva, although some teachers allow practitioners to do several repetitions of the later practices while focusing primarily on the prostrations. Prostrations purify the obscurations associated with the body and the affliction of pride. Vajrasattva purifies the obscurations associated with speech and hatred/aversion. The Mandala of Offering purifies the obscurations of the mind and attachment. Guru Yoga purifies the obscurations of all three (body, speech, mind).\n\n**How ​​the prostrations prepare for Vajrasattva**: They establish a refuge foundation—an essential foundation for all subsequent practices. By addressing the grosser physical obscurations through prostration, practitioners prepare their bodies and minds for the deeper purification of Vajrasattva practice. The humiliation of the ego through prostrations softens the ego so that the mind is more receptive to recognizing negativity in the practice of Vajrasattva. Completing 100,000 prostrations develops the mental and physical discipline needed for sustained recitation of Vajrasattva.\n\n**Relationship to Mandala Offering**: Prostrations prepare for the mandala offering by cultivating generosity—the physical act of prostration trains the letting go of attachment to the body and ego. Through repeated prostrations, practitioners learn to let go of self-importance, which prepares them to mentally give to the entire universe in the mandala practice. Prostrations begin the process of overcoming greed, which is further developed in the mandala practice.\n\n**Relationship to Guru Yoga**: Prostrations establish the foundation for Guru Yoga by developing devotion—prostrations to the refuge tree (with the root guru at the center) cultivates the devotion essential to Guru Yoga. Visualization during prostration shows the guru as inseparable from all the Buddhas, preparing for the ultimate union with the guru's mind in guru yoga. The physical act of surrender prepares the practitioner for the deeper mental and spiritual surrender required in guru yoga.\n\n**Four Powers of Purification** (when properly applied during prostration): Power of Support/Witness (visualization and prostration to the refuge assembly provide a powerful witness for confession), Power of Repentance (sincere regret for past negative actions), Power of Remedy (the physical and mental act of prostration serves as a counterpoint), Power of Resolution (a commitment not to repeat harmful actions). According to the teachers, while karma does not simply disappear, prostrations performed with the right motivation and the four powers create conditions where negative karma **cannot ripen** or ripens in a weakened form.\n\n## Quotes and Teachings from Karma Kagyu Masters\n\n**The 17th Karmapa Orgyen Trinle Dorje** explained the nature of prostration: \"Prostration (*chaksal*) in Tibetan, according to the oral lineage, in the first part, *chak* (*phyag*), has the meaning of something like 'sweeping away' any harmful actions and obscurations, just as we sweep away impurities with a broom. Then, *tsal* ('tshal), means that we receive the blessings of enlightened body, speech and mind and acquire all the siddhis.\"\n\nHe taught about the role of the guru in practice: \"The guru is essential: although some people think that they can practice without a teacher. We may think that we know how to do prostrations, but it is the teacher who helps us understand the nature of the practice so that our practice transforms our minds... Ultimately, the measure of the success of our practice lies in the transformation of our minds.\"\n\nIn Seattle in 2008, he taught about three types of prostrations, emphasizing: \"Prostration with our minds means showing deep respect and feeling great conviction for the person we are prostrating to. When we perform authentic prostration, our minds are filled with true respect... prostrations act as antidotes; for example... prostration is the antidote to jealousy.\"\n\n**Gampopa** in *The Gem of Liberation* begins with a prostration: \"I prostrate to the sublime Manjushri in youthful form. I pay homage to the Victorious Ones, their followers, the holy Dharma, and the lamas who are their foundation.\" In the chapter on the spiritual master, he explains: \"Devotion to him 'through respect' means performing prostrations, getting up quickly, bowing the head, going around, expressing a sense of closeness at the right time, looking at him alternately without satiety, and so on. An example is how Sudhana, the merchant's son, served his spiritual masters.\"\n\n**Jamgon Kongtrül Lödro Thayé** wrote *The Torch of Certainty*, a brilliant and detailed commentary on the 9th Karmapa's text \"The Vehicle for Traveling on the Path of Liberation,\" which is a standard text of the Ngondrö Karma Kagyu. This text describes the Four Fundamental Practices that all practitioners of Vajrayana Buddhism must complete, including the practice of prostration combined with refuge and bodhicitta. The 17th Karmapa specifically chose to teach from this text during the 2012-2013 Kagyu Monlam because \"the theme of the Monlam was to commemorate the lineage of Jamgon Kongtrül.\" Three outstanding contemporary masters—Kalu Rinpoche, Deshung Rinpoche, and Chögyam Trungpa Rinpoche—have all provided commentaries explaining the meaning of the Torch of Certainty for contemporary students.\n\n**Milarepa and the Story of His Purification** illustrates the principles of the practice. As Lama Zopa Rinpoche taught: “There are many different preliminary practices, a hundred thousand of this, a hundred thousand of that. Having Milarepa build the tower three times by himself was all preliminary practice for Milarepa. The three times of building included many hundred thousand prostrations, many hundred thousand Vajrasattva mantras, mandala offerings, all of these things. Every time Marpa rebuked Milarepa, it was an incredibly powerful purification, purifying Milarepa’s negative karma. Every time Marpa struck Milarepa, it was incredibly powerful, purifying so many eons of negative karma.”\n\n**The story of Milarepa's final teaching to Gampopa** illustrates the importance of devoted practice. When Gampopa had completed his studies with Milarepa and was preparing to leave, Milarepa said, \"I have one last teaching.\" The joyful Gampopa performed nine prostrations and awaited instructions. Milarepa turned, lifted his robe, and showed Gampopa his buttocks, which were covered with calluses that looked as if they were half flesh and half stone. \"See? This is how I attained enlightenment: by sitting and meditating. If you want to attain it in this life, make the same effort. This is my final teaching. I have nothing more to add.\"\n\n**Thrangu Rinpoche** (1933-2023), who became one of the lineage's leading teachers, personally completed the full 100,000 prostrations. From his biography: \"Thereby he completed the four preliminary practices of one hundred thousand prostrations and so on in succession. He also conducted retreats of a number of necessary practices including Vajrakilaya and Vajrapani.\"\n\n## The Meaning of 100,000 Prostrations and Their Accumulation\n\n**The traditional number of 111,111** consists of 100,000 basic prostrations plus 11,111 additional ones (10 percent \"interest\") to account for errors, miscalculations, and imperfect practice. This number is not arbitrary, but is based on thousands of years of experience with the transformational process that requires such extensive practice.\n\n**The time investment** requires considerable commitment. At approximately 400 prostrations per hour with breaks, a practitioner will complete 3,000 prostrations in 8 hours. Full completion requires a minimum of 45 days in intensive retreat (no days off). In everyday life, this typically takes several months to years. Total hours for all four ngöndrö practices: approximately 1,500 hours. This extensive time investment is intentional – it allows for deep habituation to devotion and humility, the physically demanding nature breaks down resistance and ego, the extended practice period allows for transformation of the mind and develops perseverance essential for the spiritual path.\n\n**Psychological and spiritual effects** accumulate over thousands of repetitions. Deep habituation to devotion and humility is created, the physically demanding nature breaks down resistance and ego, the extended practice period allows for transformation of the mind and develops perseverance essential for the spiritual path. Practitioners often experience \"layers upon layers\" of habitual tendencies being revealed – practice brings unconscious patterns to the surface, reveals the depth of illusions and helps practitioners see the depth of their delusions.\n\n**The doctrinal meaning of number**, according to the sutras cited in the teachings, explains that each prostration generates merit equal to the number of atoms in the earth covered by the practitioner's body. These merits contribute to future wealth, auspicious rebirths, and ultimately enlightenment. When dedicated to all sentient beings with bodhicitta, the merits become inexhaustible. As Jetsun Khandro Rinpoche taught: “When, through the stages of ngöndrö, you yourself come to trust in your Buddha nature, from that moment on you are no longer dependent on any method, practice, or meditation. But as long as some obscuration is more powerful than your trust in your Buddha nature, you will always have someone to prostrate to.”\n\n**Continuing the practice after completion**: It is important to understand that ngöndrö is never “finished.” Great masters continue to prostrate throughout their lives—Trulshik Rinpoche did 100 prostrations a day into his eighties, Dilgo Khyentse Rinpoche maintained ngöndrö as his main practice until his death, Tenga Rinpoche continued even after losing his limbs. Ken McLeod, an experienced teacher, clearly told students, “They will never be able to say they have completed ngöndrö.” This perspective shift is crucial—ngöndrö is not a step to overcome, but a living foundation for the entire journey.\n\n## Common Obstacles and Advice for Practitioners\n\n**Physical obstacles** include pain and injury (knees, back, shoulders, wrists), physical exhaustion and fatigue, which takes longer for older practitioners or those with physical limitations. Protection includes the use of **prostration boards** (smooth wooden boards for sliding), knee and hand guards, breaks to avoid injury, gradual build-up – do not attempt 1000+ at once, proper form – slide hands forward rather than “cracking” back, keep feet together, body aligned.\n\nIf pain is very severe, reduce the number of prostrations and gradually increase. If injured, perform minimal prostrations (even 3) to maintain continuity. Physical therapy or stretching between sessions. Consult with teacher for modifications. For those with physical limitations, **half prostrations** from the knees (*kumchag*), **symbolic prostrations** with the seated hand mudra, or **visualized prostrations** are acceptable – Lama Zopa Rinpoche taught that if done correctly, they can generate even more merit.\n\n**Mental and emotional obstacles** present a greater challenge. Resistance and doubt manifest as questioning the value or purpose of the practice, thoughts of \"this is outdated\" or \"not relevant to my culture\", \"what is the point?\" especially during difficult times, doubting one's connection to the lineage or refuge tree. Boredom and monotony cause the mind to wander extensively, making it difficult to maintain focus session after session, endless thoughts, memories and plans arise, a feeling that \"nothing is happening\".\n\n**Discouragement** occurs when numbers seem overwhelming (100,000 seems impossible), progress seems too slow, comparisons with others who finish faster, hitting a \"wall\" where motivation disappears. **Pride and ego backlash** create sophisticated arguments against continuing - \"I'm not ready yet\" becomes an excuse, \"I know better than this traditional practice\", the idea that the practice is \"below\" the practitioner's level. Life circumstances such as family responsibilities make time scarce, work demands interfere with the practice schedule, lack of appropriate space for full prostrations, social embarrassment about the practice.\n\n**Spiritual obstacles** according to Jetsun Khandro Rinpoche and other teachers include the uncovering of obscurations - old memories and unresolved issues surface, hidden layers of anger, jealousy and self-cherishing become apparent, which can be psychologically challenging to confront these patterns. **Fundamental Reluctance**: Teachers note that obstacles reveal \"you are not really in a hurry to reach enlightenment\", the gap between aspiration and actualization becomes painfully clear, comfortable habits resist transformation.\n\n**Practical advice for maintaining practice** begins with the essential attitude. **Keep bodhicitta central**: Begin each session by generating the wish to benefit all beings, remember that you are practicing for the liberation of all sentient beings, not for personal achievement, dedicate merit at the end of each session. **Generate the right motivation daily**: Contemplate the four thoughts that turn the mind to the dharma, remember the preciousness of human rebirth, impermanence, karma and the suffering of samsara, regularly review the lamrim teachings.\n\n**Trust the process**: Remember that **great masters** (Dilgo Khyentse, Trulshik Rinpoche, Tenga Rinpoche) continued ngöndrö as a daily practice throughout their lives. Lama Tsongkhapa did 3,500,000 prostrations (35 sets of 100,000). The practice is not a \"beginner's\" exercise to get through quickly.\n\n**Practical motivational strategies**: Break it down into manageable goals - some teachers suggest doing sets of 10,000 rather than focusing on 100,000. Complete 10,000, then go through all four practices, then repeat (do it 10 times). Celebrate smaller milestones. **Establish a sustainable routine**: Daily practice is essential - even if it's just 35-100 prostrations/day. Morning practice works best for many. **Maintain continuity**: Do at least a few every day; if you miss a day, some traditions say to restart the count (although this varies by teacher). Join a practice group for mutual support.\n\n**Don’t compare**: Everyone has a different pace based on age, health, family situation. 10,000 in 10 days is not realistic for most Westerners with jobs and families. **It’s not a race** – quality matters more than speed. **Work with obstacles**: View obstacles as the practice itself – they reveal what needs to be purified. When resistance arises, examine: “Where am I encountering resistance and what does it mean?” Obstacles are opportunities to see the depth of obscurations.\n\n**The importance of right motivation and bodhicitta** is critical. According to the teachings of Karma Kagyu, motivation transforms the entire practice. Without right motivation, prostrations become mere physical exercises. With bodhicitta, every prostration becomes a **cause of enlightenment**. Motivation determines whether the practice creates merit for liberation or just worldly benefit. Every day upon awakening: \"May I attain Buddhahood for the benefit of all sentient beings.\" Generate the Four Immeasurables: May all beings have happiness and its causes, May all beings be free from suffering and its causes, May all beings never be separated from joy, May all beings abide in equanimity, free from attachment and aversion.\n\n**Counting and tracking progress** uses traditional methods such as mala beads (108 beads, one bead per prostration, complete mala = 100 prostrations) or modern electronic counters (Tamagotchi-like counters, button after each prostration, \"iMala\" smartphone app). **It is essential to keep a notebook** tracking daily practice – recording the date and number completed each session helps to keep you motivated to see progress. Teachers often ask to see these records.\n\nAfter completing 100,000 prostrations **consult your teacher** – do not assume you are automatically finished. Ask permission to move on to Vajrasattva practice. The teacher will assess whether your pride has been sufficiently purified, you have developed adequate devotion, your mind is receptive to deeper purification, and real transformation has occurred (not just completing numbers). Signs of readiness include: sincere humility developed, strong devotion to the Three Jewels, willingness to continue without resistance, understanding that ngöndrö is not just a \"preliminary\", but the foundation of the path.\n\n## Conclusion: A Living Tradition of Transformation\n\nProstrations in the Karma Kagyu tradition represent a sophisticated integration of historical transmission (unbroken lineage from Vajradhara through the Karmapas), doctrinal foundation (rooted in Madhyamaka philosophy and Vajrayana methodology), practical application (physical, verbal and mental engagement), soteriological purpose (preparation for the ultimate realization of Mahamudra), and accumulation of merit (creating the conditions for enlightenment through the two accumulations).\n\nAs the 17th Karmapa taught: \"Dharma practice is not separate from our life. We become the dharma. The dharma becomes our life.\" Prostrations serve as a foundation for advanced practice, a complete path in themselves, a transformational practice for body, speech, and mind, a means of connecting with lineage blessings, a method of purifying and accumulating merit, and a preparation for realizing the nature of mind in Mahamudra.\n\nThe Karma Kagyu tradition continues to flourish globally with the 17th Karmapa providing current leadership, established three-year retreat centers around the world, active dharma centers teaching and supporting the practice of ngöndrö, thousands of practitioners completing preliminary practices annually, and the continued transmission of the \"whispered lineage\" in an unbroken chain. For serious practitioners, prostrations are not an obstacle to overcome, but a profound method of purifying obscurations, accumulating merit, and establishing the unshakable foundation necessary for all advanced Vajrayana practice.",
  "tags.en": [
    "buddhism"
  ]
}