[
  {
    "id": "article-1753387272610",
    "title": "Proč nikdy nepoužívat indexy pole jako ID v @dnd-kit: Komplexní průvodce pro React vývojáře",
    "date": "2025-07-24",
    "filename": "articles/article-1753387272610.json",
    "description": "Používání indexů pole jako identifikátorů v knihovně @dnd-kit může vést k závažným chybám při přetahování, ztrátě interního stavu komponent, nesprávným animacím a výkonovým problémům. Tento článek vysvětluje, proč jsou stabilní ID klíčové pro správné fungování drag & drop logiky, jak @dnd-kit pracuje s identifikátory a nabízí správné techniky generování a správy ID. Vhodné pro všechny React vývojáře, kteří chtějí tvořit robustní a bezchybné uživatelské rozhraní.",
    "tags": [
      "React",
      "Javascript",
      "Frontend"
    ],
    "category": "tutorial",
    "metadata": {
      "readingTime": "7 min"
    },
    "title.en": "Why you should never use array indices as IDs in @dnd-kit: A comprehensive guide for React developers",
    "description.en": "Using array indices as identifiers in the @dnd-kit library can lead to serious drag and drop errors, loss of internal component state, incorrect animations, and performance issues. This article explains why stable IDs are crucial for proper drag & drop logic, how @dnd-kit works with identifiers, and provides proper techniques for generating and managing IDs. Suitable for all React developers who want to create robust and error-free user interfaces."
  },
  {
    "id": "article-1753199626390",
    "title": "Uživatelská příručka - Lab Blog",
    "date": "2025-07-22",
    "filename": "articles/article-1753199626390.json",
    "description": "Lab Blog je moderní aplikace pro čtení a vytváření blogových článků s podporou Markdown formátu. Aplikace nabízí jedinečný \\\"Eye mód\\\", který umožňuje přepínat mezi čistým čtenářským prostředím a plnohodnotným editačním rozhraním.",
    "tags": [
      "markdown",
      "blog",
      "editor"
    ],
    "category": "tutorial",
    "metadata": {
      "readingTime": "10 min"
    },
    "title.en": "User Guide - Lab Blog",
    "description.en": "Lab Blog is a modern application for reading and creating blog articles with support for the Markdown format. The application offers a unique \\\"Eye mode\\\" that allows you to switch between a clean reading environment and a full-fledged editing interface."
  }
]