[
  {
    "id": "article-1753624398782",
    "title": "Technologie : Create React App, React Scripts,  Proxy konfigurace",
    "date": "2025-07-27",
    "filename": "articles/article-1753624398782.json",
    "description": "Článek obsahuje: Technické detaily s příklady kódu, Vysvětlení, jak věci fungují \"pod kapotou\", Praktické tipy a řešení častých problémů, Alternativy a budoucnost těchto technologií,\nBest practices pro práci s CRA",
    "tags": [
      "frontend",
      "Javascript",
      "Create React App",
      "React Scripts",
      "Proxy"
    ],
    "category": "framework",
    "metadata": {
      "readingTime": "10 min"
    },
    "title.en": "Technology: Create React App, React Scripts, Proxy configuration",
    "description.en": "Článek obsahuje: Technické detaily s příklady kódu, Vysvětlení, jak věci fungují \"pod kapotou\", Praktické tipy a řešení častých problémů, Alternativy a budoucnost těchto technologií,\nBest practices pro práci s CRA\n213 / 5 000\nThe article contains: Technical details with code examples, Explanations of how things work \"under the hood\", Practical tips and solutions to common problems, Alternatives and the future of these technologies, Best practices for working with CRA"
  },
  {
    "id": "article-1753446746048",
    "title": "Čistý kód v praxi: Kompletní refaktoring React aplikace",
    "date": "2025-07-25",
    "filename": "articles/article-1753446746048.json",
    "description": "V tomto článku vám ukážu, jak jsem kompletně refaktoroval React aplikaci podle principů čistého kódu - od monolitického 566řádkového souboru až po modulární, čitelnou a udržitelnou architekturu.",
    "tags": [
      "React",
      "Javascript",
      "frontend",
      "clean code"
    ],
    "category": "concept",
    "metadata": {
      "readingTime": "12 min"
    },
    "title.en": "Clean Code in Practice: Complete React Application Refactoring",
    "description.en": "In this article, I'll show you how I completely refactored a React application following clean code principles - from a monolithic 566-line file to a modular, readable, and maintainable architecture."
  },
  {
    "id": "article-1753387272610",
    "title": "@dnd-kit: Problém s indexy jako ID",
    "date": "2025-07-24",
    "filename": "articles/article-1753387272610.json",
    "description": "Používání indexů pole jako identifikátorů v knihovně @dnd-kit může vést k závažným chybám při přetahování, ztrátě interního stavu komponent, nesprávným animacím a výkonovým problémům. Tento článek vysvětluje, proč jsou stabilní ID klíčové pro správné fungování drag & drop logiky, jak @dnd-kit pracuje s identifikátory a nabízí správné techniky generování a správy ID. Vhodné pro všechny React vývojáře, kteří chtějí tvořit robustní a bezchybné uživatelské rozhraní.",
    "tags": [
      "React",
      "Javascript",
      "frontend"
    ],
    "category": "framework",
    "metadata": {
      "readingTime": "7 min"
    },
    "title.en": "@dnd-kit: Problem with indexes as IDs",
    "description.en": "Using array indices as identifiers in the @dnd-kit library can lead to serious drag and drop errors, loss of internal component state, incorrect animations, and performance issues. This article explains why stable IDs are crucial for proper drag & drop logic, how @dnd-kit works with identifiers, and provides proper techniques for generating and managing IDs. Suitable for all React developers who want to create robust and error-free user interfaces."
  },
  {
    "id": "article-1753199626390",
    "title": "Uživatelská příručka - Lab Blog",
    "date": "2025-07-22",
    "filename": "articles/article-1753199626390.json",
    "description": "Lab Blog je moderní aplikace pro čtení a vytváření blogových článků s podporou Markdown formátu. Aplikace nabízí jedinečný \\\"Eye mód\\\", který umožňuje přepínat mezi čistým čtenářským prostředím a plnohodnotným editačním rozhraním.",
    "tags": [
      "markdown",
      "blog",
      "editor"
    ],
    "category": "tutorial",
    "metadata": {
      "readingTime": "10 min"
    },
    "title.en": "User Guide - Lab Blog",
    "description.en": "Lab Blog is a modern application for reading and creating blog articles with support for the Markdown format. The application offers a unique \\\"Eye mode\\\" that allows you to switch between a clean reading environment and a full-fledged editing interface."
  }
]