[
  {
    "id": "article-1757854696834",
    "title": "Universal Process Manager",
    "title.en": "Universal Process Manager",
    "date": "2025-09-14",
    "filename": "articles/article-1757854696834.json",
    "description": "Robustní systém pro správu procesů s automatickým restartováním, monitoringem zdraví a čistým oddělením od spravovaných aplikací.",
    "description.en": "A robust, production-ready process management system with automatic restarts, health monitoring, and clean separation from managed applications.",
    "tags": [
      "process-manager",
      "python",
      "sqlite",
      "architektura",
      "monitoring",
      "zdravi-aplikaci"
    ],
    "tags.en": [
      "process-manager",
      "python",
      "sqlite",
      "architecture",
      "monitoring",
      "health-checks"
    ],
    "category": "tutorial, technologie",
    "category.en": "tutorial, technology",
    "metadata": {
      "readingTime": "15 min"
    }
  },
  {
    "id": "article-1757520132204",
    "title": "Mini Blog Platform, moderního řešení pro publikování článků",
    "title.en": "Mini Blog Platform, a modern solution for publishing articles",
    "date": "2025-09-10",
    "filename": "articles/article-1757520132204.json",
    "description": "Mini Blog Platform je moderní řešení pro publikování článků postavené na nejnovějších technologiích React ekosystému. Projekt je hostován na GitHub Pages pod doménou hezky.github.io.",
    "description.en": "\nMini Blog Platform is a modern solution for publishing articles built on the latest technologies of the React ecosystem. The project is hosted on GitHub Pages under the domain hezky.github.io.",
    "tags": [
      "web",
      "blog",
      "Javascript",
      "Frontend"
    ],
    "tags.en": [
      "web",
      "blog",
      "Javascript",
      "frontend"
    ],
    "category": "tutorial, technologie",
    "category.en": "tutorial, technology",
    "metadata": {
      "readingTime": "5 min"
    }
  },
  {
    "id": "article-1753387272610",
    "title": "@dnd-kit: Problém s indexy jako ID",
    "date": "2025-07-24",
    "filename": "articles/article-1753387272610.json",
    "description": "Používání indexů pole jako identifikátorů v knihovně @dnd-kit může vést k závažným chybám při přetahování, ztrátě interního stavu komponent, nesprávným animacím a výkonovým problémům. Tento článek vysvětluje, proč jsou stabilní ID klíčové pro správné fungování drag & drop logiky, jak @dnd-kit pracuje s identifikátory a nabízí správné techniky generování a správy ID. Vhodné pro všechny React vývojáře, kteří chtějí tvořit robustní a bezchybné uživatelské rozhraní.",
    "tags": [
      "React",
      "Javascript",
      "frontend"
    ],
    "category": "framework",
    "metadata": {
      "readingTime": "7 min"
    },
    "title.en": "@dnd-kit: Problem with indexes as IDs",
    "description.en": "Using array indices as identifiers in the @dnd-kit library can lead to serious drag and drop errors, loss of internal component state, incorrect animations, and performance issues. This article explains why stable IDs are crucial for proper drag & drop logic, how @dnd-kit works with identifiers, and provides proper techniques for generating and managing IDs. Suitable for all React developers who want to create robust and error-free user interfaces."
  }
]
